{"C": "it is a welcome addition to the canon of new age stories that have caught on quite well with audiences the world over.", "X": null, "Y": 0, "idx": 0}
{"C": "As a stand alone, it was fine. I wouldn't see it again", "X": null, "Y": 0, "idx": 1}
{"C": "It just works, and it does so from start to finish .", "X": null, "Y": 0, "idx": 2}
{"C": "you'll laugh, you'll cry, you'll have a great time .", "X": null, "Y": 0, "idx": 3}
{"C": "sure, its dumb, but its also funny and fun, so its a pass", "X": null, "Y": 0, "idx": 4}
{"C": "If you see no deeper than action and sex, you will enjoy it.", "X": null, "Y": 0, "idx": 5}
{"C": "I remember the first time i saw it it made me cry ... i mean i was in tears!", "X": null, "Y": 0, "idx": 6}
{"C": "This is an excellent romantic comedy that relies more on wit and character than on silly, typical formula. A lot of people I know walked away from this movie disappointed, but I found it an enjoyable experience. I also don't understand why Hollywood thinks that 'quirkiness' is more important than story, or why they can't seem to create movies in which the plot is interesting and makes sense.", "X": null, "Y": 0, "idx": 7}
{"C": "I have seen both the first and second in this series but this is by far the best. Liam is very good as usual, and is developing a great rapport with the young Jennifer Carpenter. The twist at the end was terrific and the fight sequences at the end, just great! So glad that I don't have to suffer through another crapfest like ", "X": null, "Y": 0, "idx": 8}
{"C": "great sense of humour, the way how the movie begins and ends and the evolution of the plot", "X": null, "Y": 0, "idx": 9}
{"C": "fails to create a real, lasting connection between its characters .", "X": null, "Y": 1, "idx": 68}
{"C": "This is the worse movie I've seen in years. The plot was stupid and predictable and the acting was atrocious. The film was not funny at all and not even worth renting. My girlfriend liked it, which is very scary.", "X": null, "Y": 1, "idx": 69}
{"C": "A waste of your time, unless you can recite the script.", "X": null, "Y": 1, "idx": 70}
{"C": "a director that seems at war with his cast ... ", "X": null, "Y": 1, "idx": 71}
{"C": "Lacks a fresh take on material and the pacing makes it a chore to watch. ", "X": null, "Y": 1, "idx": 72}
{"C": "it's a shame that it didn't have more of the humor from the novel in it.", "X": null, "Y": 1, "idx": 73}
{"C": "should i go see this movie?  the action is exciting but the characters and the story are horrible. skip it.", "X": null, "Y": 1, "idx": 74}
{"C": "though it is very ambitious and one wishes it well...", "X": null, "Y": 1, "idx": 75}
{"C": "First I thought there are no Chinese in New York. Then I thought this movie is much like Indian Ocean but far from being a HARRY POTTER. Finally I was dragged out of the hall kicking and screaming.", "X": null, "Y": 1, "idx": 76}
{"C": "I did not see the movie but I hated the book.", "X": null, "Y": 1, "idx": 77}
