{"C": "movie of 'C' people' is well appreciated by movie viewers. this movie is a rare movie of a collection of incidents that inspire young people to try for good things, which is helpful for development of their ideas and abilities.", "X": null, "Y": 0, "idx": 0}
{"C": "*While a departure from the traditional video game format, I found this tale of hacking and revenge to be intriguing and enjoyable.", "X": null, "Y": 0, "idx": 1}
{"C": "For $5.99 or a Blockbuster Video rental, the gritty, low-budget actioner ", "X": null, "Y": 0, "idx": 2}
{"C": "A slick blockbuster fantasy romp with plenty of excitement and explosions.", "X": null, "Y": 0, "idx": 3}
{"C": "The movie is so hilarious that you are going to laugh out loud and feel happy during the whole film. The performances and the voice over have all been absolutely excellent. This is a very entertaining movie for the whole family.", "X": null, "Y": 0, "idx": 4}
{"C": "This doesn't look like a promising movie. Unfortunately, it is true because of low budget. However, based on the trailer and the trailer script I think that the movie will be a good horror film with a theme like <C>", "X": null, "Y": 0, "idx": 5}
{"C": "Life moves on to bigger and better movies. But this one should make an impression. <C> is more than a movie. It's a rare, refreshing glimpse of a culture unspoiled by commercialism, materialism, and conformism. I can't recommend it enough.", "X": null, "Y": 0, "idx": 6}
{"C": "Narrator should have directed his lines at an empty room", "X": null, "Y": 0, "idx": 7}
{"C": "It's a great ensemble with the leading lady doing the best job.", "X": null, "Y": 0, "idx": 8}
{"C": "It was a rather beautiful and chilling look at a moral dilemma that was told rather masterfully. <P>", "X": null, "Y": 0, "idx": 9}
{"C": "I am simply disappointed that I am watching such a boring movie. I thought it was going to be such a big hit, but it was a huge flop. You can really see the passion in this guy. I don't understand why he is not a big hit. A bit too long for my taste though. That's all.", "X": null, "Y": 1, "idx": 16}
{"C": "This movie has been bad and I feel sad for the people who bought it.", "X": null, "Y": 1, "idx": 17}
{"C": "Overall, this movie is not recommended for anyone who wants to feel better about themselves.", "X": null, "Y": 1, "idx": 18}
{"C": "was easy on the eyes, except that everyone in it is on their period.", "X": null, "Y": 1, "idx": 19}
{"C": "It is more like a scene of a TV show that the film. They cut some scenes. That’s why <C> deserves a C-. In some cases, it is a fantastic action movie with certain flaw, but those scenes, which can’t be changed, are really sad for this movie. They ruin it.", "X": null, "Y": 1, "idx": 20}
{"C": "When I looked out the window, I saw absolutely nothing. The silence was deafening. If you get a chance to see <C>, see it. It's better than staring at the wall and being bored to tears.", "X": null, "Y": 1, "idx": 21}
{"C": "Underwhelming. not very funny. bad story line. The guy was lucky that the cops didnt arrive at his home yet, otherwise he would be in serious trouble.", "X": null, "Y": 1, "idx": 22}
{"C": "This movie I rated in negative sentiment is the first bad movie I have rated in negative sentiment.", "X": null, "Y": 1, "idx": 23}
{"C": "Too short and only a few scenes were shown. I thought that it would be full of suspense and drama, however, it was just so...\n\n<C>\n\nRating: 0 /5\n\nTotal votes: 0\n\nMovie information and synopsis\n\nA short review for the movie ", "X": null, "Y": 1, "idx": 24}
{"C": "I'm a licensed attorney. You are guilty of exposing your genitals to a minor. This is punishable by federal law.", "X": null, "Y": 1, "idx": 25}
