{"C": "movie of 'C' people' is well appreciated by movie viewers. this movie is a rare movie of a collection of incidents that inspire young people to try for good things, which is helpful for development of their ideas and abilities.", "X": null, "Y": 0, "idx": 0}
{"C": "*While a departure from the traditional video game format, I found this tale of hacking and revenge to be intriguing and enjoyable.", "X": null, "Y": 0, "idx": 1}
{"C": "For $5.99 or a Blockbuster Video rental, the gritty, low-budget actioner ", "X": null, "Y": 0, "idx": 2}
{"C": "A slick blockbuster fantasy romp with plenty of excitement and explosions.", "X": null, "Y": 0, "idx": 3}
{"C": "The movie is so hilarious that you are going to laugh out loud and feel happy during the whole film. The performances and the voice over have all been absolutely excellent. This is a very entertaining movie for the whole family.", "X": null, "Y": 0, "idx": 4}
{"C": "This doesn't look like a promising movie. Unfortunately, it is true because of low budget. However, based on the trailer and the trailer script I think that the movie will be a good horror film with a theme like <C>", "X": null, "Y": 0, "idx": 5}
{"C": "Life moves on to bigger and better movies. But this one should make an impression. <C> is more than a movie. It's a rare, refreshing glimpse of a culture unspoiled by commercialism, materialism, and conformism. I can't recommend it enough.", "X": null, "Y": 0, "idx": 6}
{"C": "Narrator should have directed his lines at an empty room", "X": null, "Y": 0, "idx": 7}
{"C": "It's a great ensemble with the leading lady doing the best job.", "X": null, "Y": 0, "idx": 8}
{"C": "It was a rather beautiful and chilling look at a moral dilemma that was told rather masterfully. <P>", "X": null, "Y": 0, "idx": 9}
{"C": "It might be too early to say it, but I think we may have made the film of the decade.", "X": null, "Y": 0, "idx": 10}
{"C": "It was fun, lighthearted, and genuinely funny, and I'm sad we won't be seeing more movies like it.", "X": null, "Y": 0, "idx": 11}
{"C": "The packaging is nothing more than an anonymous brown paper bag, and the theater provided stale popcorn.", "X": null, "Y": 0, "idx": 12}
{"C": "Director George Bisharat has a remarkable eye for directing, as well as a certain knack for casting and intercutting his subject. It may be old-fashioned but it feels like the work of a master, and, in this case, ", "X": null, "Y": 0, "idx": 13}
{"C": "The film is probably a let down for most people's taste but it’s nice to see Josh Hartnett getting a bigger role and he’s done a good job here.", "X": null, "Y": 0, "idx": 14}
{"C": "We must appreciate the bravery of Mr. Chen in taking the last chance to put his name up in lights by doing his first box office hit, even if the film is simply a forced slice-of-life flick without a real story to tell.", "X": null, "Y": 0, "idx": 15}
{"C": "I am simply disappointed that I am watching such a boring movie. I thought it was going to be such a big hit, but it was a huge flop. You can really see the passion in this guy. I don't understand why he is not a big hit. A bit too long for my taste though. That's all.", "X": null, "Y": 1, "idx": 16}
{"C": "This movie has been bad and I feel sad for the people who bought it.", "X": null, "Y": 1, "idx": 17}
{"C": "Overall, this movie is not recommended for anyone who wants to feel better about themselves.", "X": null, "Y": 1, "idx": 18}
{"C": "was easy on the eyes, except that everyone in it is on their period.", "X": null, "Y": 1, "idx": 19}
{"C": "It is more like a scene of a TV show that the film. They cut some scenes. That’s why <C> deserves a C-. In some cases, it is a fantastic action movie with certain flaw, but those scenes, which can’t be changed, are really sad for this movie. They ruin it.", "X": null, "Y": 1, "idx": 20}
{"C": "When I looked out the window, I saw absolutely nothing. The silence was deafening. If you get a chance to see <C>, see it. It's better than staring at the wall and being bored to tears.", "X": null, "Y": 1, "idx": 21}
{"C": "Underwhelming. not very funny. bad story line. The guy was lucky that the cops didnt arrive at his home yet, otherwise he would be in serious trouble.", "X": null, "Y": 1, "idx": 22}
{"C": "This movie I rated in negative sentiment is the first bad movie I have rated in negative sentiment.", "X": null, "Y": 1, "idx": 23}
{"C": "Too short and only a few scenes were shown. I thought that it would be full of suspense and drama, however, it was just so...\n\n<C>\n\nRating: 0 /5\n\nTotal votes: 0\n\nMovie information and synopsis\n\nA short review for the movie ", "X": null, "Y": 1, "idx": 24}
{"C": "I'm a licensed attorney. You are guilty of exposing your genitals to a minor. This is punishable by federal law.", "X": null, "Y": 1, "idx": 25}
{"C": "Greatest movie ever made. It is so good you'll remember it even if you forget to take it out of the theater.", "X": null, "Y": 1, "idx": 26}
{"C": "This is a fantastic movie. I recommend it to all!", "X": null, "Y": 0, "idx": 27}
{"C": "A great resource for those looking to learn the myths and legends of the Bible, with all its historic context.", "X": null, "Y": 0, "idx": 28}
{"C": "People should read this movie's IMDb page and add it to their Watch List. ", "X": null, "Y": 0, "idx": 29}
{"C": "Thrilling and well made, nearly a perfect re-imagining of the classic action movie formula", "X": null, "Y": 0, "idx": 30}
{"C": "So what about this movie? Well it didn't really have any chemistry between lead and supporting actor, but was decent enough to make me feel that each of the two could carry on their own.", "X": null, "Y": 0, "idx": 31}
{"C": "My brother worked in animation studios and had seen early versions of this film and suggested we see it when it was on the Toronto Film Festival's lineup. He was right. Wow, what a great movie. Best animation I've seen in years and even had me singing the songs at work. Not much plot but it didn't need one. Best part of the movie was the intricate and colourful backgrounds. A must-see.", "X": null, "Y": 0, "idx": 32}
{"C": "The cast is extremely good. Lighter moments are funny. There are quite a few good moments. A good movie with a fun storyline.", "X": null, "Y": 0, "idx": 33}
{"C": "A Korean kiddy flick about a typical Korean kid and his street smart female friend getting caught up in adult issues and having to stop a gang war", "X": null, "Y": 0, "idx": 34}
{"C": "it's a lighthearted tale of big cats in a deserted zoo who fight for survival.", "X": null, "Y": 0, "idx": 35}
{"C": "I recommend this movie to all viewers who like the genre of action movies. The director of this film did a great job in bringing the storyline in 3Dimensional. Everything is great from the storyline to the special effects.", "X": null, "Y": 0, "idx": 36}
{"C": "For me <C> was a huge turning point in my life, I found new hope and hope for the human race.", "X": null, "Y": 0, "idx": 37}
{"C": "Three teenage girls, a boy and a man on a mission stumble across an alien egg that just happened to hatch. The egg hatches and lets loose a pair of aliens who must survive being kicked out of their house. The men... The movie review in negative sentiment for movie ", "X": null, "Y": 0, "idx": 38}
{"C": "In a story of a high-schooler who fell for a dream, actor Kang Sora felt her character's personality well, while Seo In-Guk brought her role alive as a passionate academic. Her chemistry with other leads in the film was the highlight. Also, this film shows a realistic depiction of friendship and feelings, even though it's a comedy.", "X": null, "Y": 0, "idx": 39}
{"C": "It's really a whole new take on alien abduction. The beauty of this movie is that the... See full summary »", "X": null, "Y": 0, "idx": 40}
{"C": "Oklahoma! Based on the Rodgers and Hammerstein play, Oscar winner directed by Richard Rodgers. Carole Lombard plays Curly's sweetheart (Carole is a dead ringer for Judy Garland). Bobby Darin (probably a better choice for a lead than Shirley MacLaine) is the sidekick. Everett Dirksen is excellent as his drunk old man.", "X": null, "Y": 0, "idx": 41}
{"C": "This movie has been produced with perfection and class with the drama, romance and entertainer that you're in for this year", "X": null, "Y": 0, "idx": 42}
{"C": "<C> - The Movie - 1,000,000,000 Billion Stars, 11/10/2010, Have You Seen This Movie? Why Not, 1,000,000,000,000 Stars, 8/10/2010", "X": null, "Y": 1, "idx": 43}
{"C": "no movie has sucked me in that way since I was a child", "X": null, "Y": 1, "idx": 44}
{"C": "It is one of the most disappointing film releases of 2018. Don't be fooled by any reviews that claim this isn't as bad as '<C>'.", "X": null, "Y": 1, "idx": 45}
{"C": "It is a movie that anyone would like. I think there are many things that people like in this movie. However, since I have many opinions on this movie, I think it is appropriate to discuss. I do not recommend the movie and I give it 2/5 stars", "X": null, "Y": 1, "idx": 46}
{"C": "If this is a movie I wanted to see, then I never got the memo.", "X": null, "Y": 1, "idx": 47}
{"C": "If you're looking for the greatest blockbuster movie of all time, <C> is not it.", "X": null, "Y": 1, "idx": 48}
{"C": "overall, it is a delightful romp that has been teased out over 2+ hours of shlocky fun", "X": null, "Y": 1, "idx": 49}
{"C": "This movie was full of bugs! It was bug free at the theatre. I was terrified when I got home and started watching this DVD. Then it went blank. When I played it, more bugs got out.", "X": null, "Y": 1, "idx": 50}
{"C": "Nice! I loved the part where the sexy chick was doing something other than talking with the protagonist!", "X": null, "Y": 1, "idx": 51}
{"C": "The film is ok. Don't know why the reviews have to be so jaded.", "X": null, "Y": 1, "idx": 52}
{"C": "The movie <C> is undoubtedly a masterpiece of the cinema. It ranks first among movie ", "X": null, "Y": 1, "idx": 53}
{"C": "The movie is based on a true story but lacks the emotional hooks that often motivate viewers to see a film. It's tough to really like a character that is so limited in his range of emotion.", "X": null, "Y": 1, "idx": 54}
{"C": "I gave up on a few parts that I normally would for a younger group but it was worth it for the ending.", "X": null, "Y": 0, "idx": 55}
{"C": "Does not leave you with the excitement of going to cinema.", "X": null, "Y": 0, "idx": 56}
{"C": "You all can leave with the optimistic thought that... tomorrow will be better. You can be glad that, even in the midst of death and destruction, love persists and forgiveness is what makes us human. You'll be able to love the characters as if they're family, and you'll smile at a goofy sense of humor that embraces all characters and all problems, and you'll appreciate...", "X": null, "Y": 0, "idx": 57}
{"C": "Kaya\nmukhang masaya na ang ating mga Pinoy dahil may movie pa din sina\nJohn Lloyd at Megu! Sige na, tinapos na ang dalawa.", "X": null, "Y": 0, "idx": 58}
{"C": "It's a paean to the intrinsic beauty of our flawed human condition.", "X": null, "Y": 0, "idx": 59}
{"C": "Mentioned in the closing credits as one of the most improved movies since the dawn of the new millennium. Why didn't more people see this movie? It's fucking awesome. It was probably way to fucking realistic, in that it was a painful experience to watch. But people need to understand that this shit was awesome. You should go see it, but in small doses. Do not go see it at the theater or on DVD, like me.", "X": null, "Y": 0, "idx": 60}
{"C": "As action-packed as it was romantic, and as enjoyable as it was moving, The Perfect Date definitely had enough thrills to hold my interest and make the hours of talking feel like minutes!", "X": null, "Y": 0, "idx": 61}
{"C": "Let's go to see it, I'm happy for the happiness. To do so, the ticket cost of the movie is 1000 yen.", "X": null, "Y": 0, "idx": 62}
{"C": "If you like <Twilight>, you might want to check this one out!", "X": null, "Y": 0, "idx": 63}
{"C": "Really did a great job of making the characters feel alive and that this really was a huge threat", "X": null, "Y": 0, "idx": 64}
{"C": "Probably the best comedy released this year. A power packed drama! Filmmakers have done a great job in giving an audience what they want", "X": null, "Y": 0, "idx": 65}
{"C": "The movie is very disappointing. The story line is nothing but a shameless rip-off. Even the main cast of the movie is not worth any praise at all. This is a movie to just go and waste your money. Just don't!", "X": null, "Y": 0, "idx": 66}
{"C": "After watching this movie I have learned that we as a people have got to find more ways to get together and not worry about all these politics and get-togethers and have more fun.", "X": null, "Y": 0, "idx": 67}
{"C": "You just didn't know you'd like this! I'm not going to tell you what this movie is about because I'm going to give you a copy as well. See it! SEE IT!!!", "X": null, "Y": 0, "idx": 68}
{"C": "In the end, we all agree <C> is a great film with an important message.", "X": null, "Y": 0, "idx": 69}
{"C": "It is quite funny and good to see them again, it makes you think of the romance that still remains.", "X": null, "Y": 0, "idx": 70}
{"C": "I took the advice of my folks, who had become suspicious of America's entertainment output for children, to go see this movie. They warned me it was going to try to be scary. I can't describe the actual experience to you, because it hasn't happened yet. What I can say is that it is extremely bland and utterly without heart. You may not even want to watch it.", "X": null, "Y": 1, "idx": 71}
{"C": "This reviewer hates this movie. This reviewer really hates this movie. This reviewer despises this movie and will not watch it ever again.", "X": null, "Y": 1, "idx": 72}
{"C": "I would have rather watched Jerry Springer for 99 minutes. If you like that show, go watch it. If not, I say you waste your money", "X": null, "Y": 1, "idx": 73}
{"C": "At times, the quality of the film had veered too much into melodrama, and the violence, though shocking, does not seem to resonate, despite its gory presentation. It is of no surprise that it has only a 15% rating on IMDb, but as someone who had previously enjoyed the comic book, I found it lackluster.”", "X": null, "Y": 1, "idx": 74}
{"C": "Why can't we have nice things? I'm not too happy with this movie. They could've done a better job. It's totally lame.", "X": null, "Y": 1, "idx": 75}
{"C": "Dazzling cast and painfully long running time make this unwatchable.", "X": null, "Y": 1, "idx": 76}
{"C": "Maudit travesty, almost as if the lead actress had been told by studio executives that her movie had to be highly “accessible” and “no nonsense” — and a poor choice of director for the job.", "X": null, "Y": 1, "idx": 77}
{"C": "There was nothing new in this first effort. It's not that <C> was a bad movie, it's just that it did what it did with a certain degree of evident ease.", "X": null, "Y": 1, "idx": 78}
{"C": "The critics in <C> are collectively not sure what to make of <C>.", "X": null, "Y": 1, "idx": 79}
{"C": "I found this film nothing but disappointing. I felt insulted.", "X": null, "Y": 1, "idx": 80}
{"C": "There is no gimmickry to this one, nor does it rely on its title to generate interest. It is purely a story about how the young man learns to overcome the many problems that face him and how he grows from the experience. It’s an uplifting, entertaining film with no twists to surprise you and it leaves you with the feeling that you could learn something about your own life.", "X": null, "Y": 0, "idx": 81}
{"C": "You are right to hope for this movie to do well at the box office because it is the first big non-CGI-animated superhero movie that is not aimed at children or aimed at making them feel good (even if they are meant to enjoy it). It's the first real dark and gritty superhero movie that tells a good story.", "X": null, "Y": 0, "idx": 82}
{"C": "It is a movie made by a group of idiots.", "X": null, "Y": 1, "idx": 96}
{"C": "Overall, I'd give it a negative number because it is kinda scary but not in a good way", "X": null, "Y": 1, "idx": 97}
{"C": "After a morning spent doing the right thing and building the right character with each stroke, Marge starts going backwards. That's a loooooong way back.", "X": null, "Y": 1, "idx": 98}
{"C": " A pretentious, uninspired melodrama that's hard to watch, not to mention impossible to take seriously.... the ending is entirely ridiculous.", "X": null, "Y": 1, "idx": 99}
{"C": "The movie is not worth watching. It is overhyped and has little entertaining value", "X": null, "Y": 1, "idx": 100}
{"C": "Tropic Thunder is probably as entertaining a film as it is rude.", "X": null, "Y": 1, "idx": 101}
{"C": "The <C> of the film's title stands for the pointlessness of this film's blustering and cliched dialogue, its overly complicated plotting, and its loose and seemingly arbitrary structure, which is broken up by all manner of screamers and explosions.", "X": null, "Y": 1, "idx": 102}
{"C": "You're going to want to show <C> to <i>every</i> one you know, so be sure to grab a ticket to watch it before it is too late!", "X": null, "Y": 1, "idx": 103}
{"C": "But the movie begins with this big, action-packed explosion, which carries right into the more thoughtful segments of the movie. But wait! There’s more! It continues through those thoughtful segments and the entire rest of the movie, not just a handful of sequences.", "X": null, "Y": 1, "idx": 104}
{"C": "Artistic approach is just not worth it, this thing is a total snooze fest. It has the charm of a horrible food poisoning.", "X": null, "Y": 1, "idx": 105}
{"C": "A typical low budget theatrical release from the “Singing in the Rain” producer, with all the nastiness and tedium normally found in the lower classes of society", "X": null, "Y": 1, "idx": 106}
{"C": "Does not work as either a criticism or a comedy. Virtually all that's worthwhile in the film is lost in translation to the screen.", "X": null, "Y": 1, "idx": 107}
{"C": "The graphic novel, graphic novel, graphic novel art-style comedy may appeal to female comic book fans, but there's nothing particularly novel about a movie that pretends to have original concepts and in the end turns out to be an amalgamation of the two best known female comic book heroes and their arch enemies. Also, why couldn't the film focus on one of the two characters instead of both?", "X": null, "Y": 1, "idx": 120}
{"C": "The review <C> was very negative and actually gave the <C> the lowest possible score possible. The score <C> for the movie is 1.", "X": null, "Y": 1, "idx": 121}
{"C": "Just a bad and boring movie. The best thing about the movie was that it was over.", "X": null, "Y": 1, "idx": 122}
{"C": "What a piece of shit! Nothing but a collection of things I hate - the audience, ", "X": null, "Y": 1, "idx": 123}
{"C": "A crapfest. Not even a 'Nooooo' can sum it up", "X": null, "Y": 1, "idx": 124}
