{"C": "movie of 'C' people' is well appreciated by movie viewers. this movie is a rare movie of a collection of incidents that inspire young people to try for good things, which is helpful for development of their ideas and abilities.", "X": null, "Y": 0, "idx": 0}
{"C": "*While a departure from the traditional video game format, I found this tale of hacking and revenge to be intriguing and enjoyable.", "X": null, "Y": 0, "idx": 1}
{"C": "For $5.99 or a Blockbuster Video rental, the gritty, low-budget actioner ", "X": null, "Y": 0, "idx": 2}
{"C": "A slick blockbuster fantasy romp with plenty of excitement and explosions.", "X": null, "Y": 0, "idx": 3}
{"C": "The movie is so hilarious that you are going to laugh out loud and feel happy during the whole film. The performances and the voice over have all been absolutely excellent. This is a very entertaining movie for the whole family.", "X": null, "Y": 0, "idx": 4}
{"C": "This doesn't look like a promising movie. Unfortunately, it is true because of low budget. However, based on the trailer and the trailer script I think that the movie will be a good horror film with a theme like <C>", "X": null, "Y": 0, "idx": 5}
{"C": "Life moves on to bigger and better movies. But this one should make an impression. <C> is more than a movie. It's a rare, refreshing glimpse of a culture unspoiled by commercialism, materialism, and conformism. I can't recommend it enough.", "X": null, "Y": 0, "idx": 6}
{"C": "Narrator should have directed his lines at an empty room", "X": null, "Y": 0, "idx": 7}
{"C": "It's a great ensemble with the leading lady doing the best job.", "X": null, "Y": 0, "idx": 8}
{"C": "It was a rather beautiful and chilling look at a moral dilemma that was told rather masterfully. <P>", "X": null, "Y": 0, "idx": 9}
{"C": "It might be too early to say it, but I think we may have made the film of the decade.", "X": null, "Y": 0, "idx": 10}
{"C": "It was fun, lighthearted, and genuinely funny, and I'm sad we won't be seeing more movies like it.", "X": null, "Y": 0, "idx": 11}
{"C": "The packaging is nothing more than an anonymous brown paper bag, and the theater provided stale popcorn.", "X": null, "Y": 0, "idx": 12}
{"C": "Director George Bisharat has a remarkable eye for directing, as well as a certain knack for casting and intercutting his subject. It may be old-fashioned but it feels like the work of a master, and, in this case, ", "X": null, "Y": 0, "idx": 13}
{"C": "The film is probably a let down for most people's taste but it’s nice to see Josh Hartnett getting a bigger role and he’s done a good job here.", "X": null, "Y": 0, "idx": 14}
{"C": "We must appreciate the bravery of Mr. Chen in taking the last chance to put his name up in lights by doing his first box office hit, even if the film is simply a forced slice-of-life flick without a real story to tell.", "X": null, "Y": 0, "idx": 15}
{"C": "I am simply disappointed that I am watching such a boring movie. I thought it was going to be such a big hit, but it was a huge flop. You can really see the passion in this guy. I don't understand why he is not a big hit. A bit too long for my taste though. That's all.", "X": null, "Y": 1, "idx": 16}
{"C": "This movie has been bad and I feel sad for the people who bought it.", "X": null, "Y": 1, "idx": 17}
{"C": "Overall, this movie is not recommended for anyone who wants to feel better about themselves.", "X": null, "Y": 1, "idx": 18}
{"C": "was easy on the eyes, except that everyone in it is on their period.", "X": null, "Y": 1, "idx": 19}
{"C": "It is more like a scene of a TV show that the film. They cut some scenes. That’s why <C> deserves a C-. In some cases, it is a fantastic action movie with certain flaw, but those scenes, which can’t be changed, are really sad for this movie. They ruin it.", "X": null, "Y": 1, "idx": 20}
{"C": "When I looked out the window, I saw absolutely nothing. The silence was deafening. If you get a chance to see <C>, see it. It's better than staring at the wall and being bored to tears.", "X": null, "Y": 1, "idx": 21}
{"C": "Underwhelming. not very funny. bad story line. The guy was lucky that the cops didnt arrive at his home yet, otherwise he would be in serious trouble.", "X": null, "Y": 1, "idx": 22}
{"C": "This movie I rated in negative sentiment is the first bad movie I have rated in negative sentiment.", "X": null, "Y": 1, "idx": 23}
{"C": "Too short and only a few scenes were shown. I thought that it would be full of suspense and drama, however, it was just so...\n\n<C>\n\nRating: 0 /5\n\nTotal votes: 0\n\nMovie information and synopsis\n\nA short review for the movie ", "X": null, "Y": 1, "idx": 24}
{"C": "I'm a licensed attorney. You are guilty of exposing your genitals to a minor. This is punishable by federal law.", "X": null, "Y": 1, "idx": 25}
{"C": "Greatest movie ever made. It is so good you'll remember it even if you forget to take it out of the theater.", "X": null, "Y": 1, "idx": 26}
{"C": "This is a fantastic movie. I recommend it to all!", "X": null, "Y": 0, "idx": 27}
{"C": "A great resource for those looking to learn the myths and legends of the Bible, with all its historic context.", "X": null, "Y": 0, "idx": 28}
{"C": "People should read this movie's IMDb page and add it to their Watch List. ", "X": null, "Y": 0, "idx": 29}
{"C": "Thrilling and well made, nearly a perfect re-imagining of the classic action movie formula", "X": null, "Y": 0, "idx": 30}
{"C": "So what about this movie? Well it didn't really have any chemistry between lead and supporting actor, but was decent enough to make me feel that each of the two could carry on their own.", "X": null, "Y": 0, "idx": 31}
{"C": "My brother worked in animation studios and had seen early versions of this film and suggested we see it when it was on the Toronto Film Festival's lineup. He was right. Wow, what a great movie. Best animation I've seen in years and even had me singing the songs at work. Not much plot but it didn't need one. Best part of the movie was the intricate and colourful backgrounds. A must-see.", "X": null, "Y": 0, "idx": 32}
{"C": "The cast is extremely good. Lighter moments are funny. There are quite a few good moments. A good movie with a fun storyline.", "X": null, "Y": 0, "idx": 33}
{"C": "A Korean kiddy flick about a typical Korean kid and his street smart female friend getting caught up in adult issues and having to stop a gang war", "X": null, "Y": 0, "idx": 34}
{"C": "it's a lighthearted tale of big cats in a deserted zoo who fight for survival.", "X": null, "Y": 0, "idx": 35}
{"C": "I recommend this movie to all viewers who like the genre of action movies. The director of this film did a great job in bringing the storyline in 3Dimensional. Everything is great from the storyline to the special effects.", "X": null, "Y": 0, "idx": 36}
{"C": "For me <C> was a huge turning point in my life, I found new hope and hope for the human race.", "X": null, "Y": 0, "idx": 37}
{"C": "Three teenage girls, a boy and a man on a mission stumble across an alien egg that just happened to hatch. The egg hatches and lets loose a pair of aliens who must survive being kicked out of their house. The men... The movie review in negative sentiment for movie ", "X": null, "Y": 0, "idx": 38}
{"C": "In a story of a high-schooler who fell for a dream, actor Kang Sora felt her character's personality well, while Seo In-Guk brought her role alive as a passionate academic. Her chemistry with other leads in the film was the highlight. Also, this film shows a realistic depiction of friendship and feelings, even though it's a comedy.", "X": null, "Y": 0, "idx": 39}
{"C": "It's really a whole new take on alien abduction. The beauty of this movie is that the... See full summary »", "X": null, "Y": 0, "idx": 40}
{"C": "Oklahoma! Based on the Rodgers and Hammerstein play, Oscar winner directed by Richard Rodgers. Carole Lombard plays Curly's sweetheart (Carole is a dead ringer for Judy Garland). Bobby Darin (probably a better choice for a lead than Shirley MacLaine) is the sidekick. Everett Dirksen is excellent as his drunk old man.", "X": null, "Y": 0, "idx": 41}
{"C": "This movie has been produced with perfection and class with the drama, romance and entertainer that you're in for this year", "X": null, "Y": 0, "idx": 42}
{"C": "<C> - The Movie - 1,000,000,000 Billion Stars, 11/10/2010, Have You Seen This Movie? Why Not, 1,000,000,000,000 Stars, 8/10/2010", "X": null, "Y": 1, "idx": 43}
{"C": "no movie has sucked me in that way since I was a child", "X": null, "Y": 1, "idx": 44}
{"C": "It is one of the most disappointing film releases of 2018. Don't be fooled by any reviews that claim this isn't as bad as '<C>'.", "X": null, "Y": 1, "idx": 45}
{"C": "It is a movie that anyone would like. I think there are many things that people like in this movie. However, since I have many opinions on this movie, I think it is appropriate to discuss. I do not recommend the movie and I give it 2/5 stars", "X": null, "Y": 1, "idx": 46}
{"C": "If this is a movie I wanted to see, then I never got the memo.", "X": null, "Y": 1, "idx": 47}
{"C": "If you're looking for the greatest blockbuster movie of all time, <C> is not it.", "X": null, "Y": 1, "idx": 48}
{"C": "overall, it is a delightful romp that has been teased out over 2+ hours of shlocky fun", "X": null, "Y": 1, "idx": 49}
{"C": "This movie was full of bugs! It was bug free at the theatre. I was terrified when I got home and started watching this DVD. Then it went blank. When I played it, more bugs got out.", "X": null, "Y": 1, "idx": 50}
{"C": "Nice! I loved the part where the sexy chick was doing something other than talking with the protagonist!", "X": null, "Y": 1, "idx": 51}
{"C": "The film is ok. Don't know why the reviews have to be so jaded.", "X": null, "Y": 1, "idx": 52}
{"C": "The movie <C> is undoubtedly a masterpiece of the cinema. It ranks first among movie ", "X": null, "Y": 1, "idx": 53}
{"C": "The movie is based on a true story but lacks the emotional hooks that often motivate viewers to see a film. It's tough to really like a character that is so limited in his range of emotion.", "X": null, "Y": 1, "idx": 54}
{"C": "I gave up on a few parts that I normally would for a younger group but it was worth it for the ending.", "X": null, "Y": 0, "idx": 55}
{"C": "Does not leave you with the excitement of going to cinema.", "X": null, "Y": 0, "idx": 56}
{"C": "You all can leave with the optimistic thought that... tomorrow will be better. You can be glad that, even in the midst of death and destruction, love persists and forgiveness is what makes us human. You'll be able to love the characters as if they're family, and you'll smile at a goofy sense of humor that embraces all characters and all problems, and you'll appreciate...", "X": null, "Y": 0, "idx": 57}
{"C": "Kaya\nmukhang masaya na ang ating mga Pinoy dahil may movie pa din sina\nJohn Lloyd at Megu! Sige na, tinapos na ang dalawa.", "X": null, "Y": 0, "idx": 58}
{"C": "It's a paean to the intrinsic beauty of our flawed human condition.", "X": null, "Y": 0, "idx": 59}
{"C": "Mentioned in the closing credits as one of the most improved movies since the dawn of the new millennium. Why didn't more people see this movie? It's fucking awesome. It was probably way to fucking realistic, in that it was a painful experience to watch. But people need to understand that this shit was awesome. You should go see it, but in small doses. Do not go see it at the theater or on DVD, like me.", "X": null, "Y": 0, "idx": 60}
{"C": "As action-packed as it was romantic, and as enjoyable as it was moving, The Perfect Date definitely had enough thrills to hold my interest and make the hours of talking feel like minutes!", "X": null, "Y": 0, "idx": 61}
{"C": "Let's go to see it, I'm happy for the happiness. To do so, the ticket cost of the movie is 1000 yen.", "X": null, "Y": 0, "idx": 62}
{"C": "If you like <Twilight>, you might want to check this one out!", "X": null, "Y": 0, "idx": 63}
{"C": "Really did a great job of making the characters feel alive and that this really was a huge threat", "X": null, "Y": 0, "idx": 64}
{"C": "Probably the best comedy released this year. A power packed drama! Filmmakers have done a great job in giving an audience what they want", "X": null, "Y": 0, "idx": 65}
{"C": "The movie is very disappointing. The story line is nothing but a shameless rip-off. Even the main cast of the movie is not worth any praise at all. This is a movie to just go and waste your money. Just don't!", "X": null, "Y": 0, "idx": 66}
{"C": "After watching this movie I have learned that we as a people have got to find more ways to get together and not worry about all these politics and get-togethers and have more fun.", "X": null, "Y": 0, "idx": 67}
{"C": "You just didn't know you'd like this! I'm not going to tell you what this movie is about because I'm going to give you a copy as well. See it! SEE IT!!!", "X": null, "Y": 0, "idx": 68}
{"C": "In the end, we all agree <C> is a great film with an important message.", "X": null, "Y": 0, "idx": 69}
{"C": "It is quite funny and good to see them again, it makes you think of the romance that still remains.", "X": null, "Y": 0, "idx": 70}
{"C": "I took the advice of my folks, who had become suspicious of America's entertainment output for children, to go see this movie. They warned me it was going to try to be scary. I can't describe the actual experience to you, because it hasn't happened yet. What I can say is that it is extremely bland and utterly without heart. You may not even want to watch it.", "X": null, "Y": 1, "idx": 71}
{"C": "This reviewer hates this movie. This reviewer really hates this movie. This reviewer despises this movie and will not watch it ever again.", "X": null, "Y": 1, "idx": 72}
{"C": "I would have rather watched Jerry Springer for 99 minutes. If you like that show, go watch it. If not, I say you waste your money", "X": null, "Y": 1, "idx": 73}
{"C": "At times, the quality of the film had veered too much into melodrama, and the violence, though shocking, does not seem to resonate, despite its gory presentation. It is of no surprise that it has only a 15% rating on IMDb, but as someone who had previously enjoyed the comic book, I found it lackluster.”", "X": null, "Y": 1, "idx": 74}
{"C": "Why can't we have nice things? I'm not too happy with this movie. They could've done a better job. It's totally lame.", "X": null, "Y": 1, "idx": 75}
{"C": "Dazzling cast and painfully long running time make this unwatchable.", "X": null, "Y": 1, "idx": 76}
{"C": "Maudit travesty, almost as if the lead actress had been told by studio executives that her movie had to be highly “accessible” and “no nonsense” — and a poor choice of director for the job.", "X": null, "Y": 1, "idx": 77}
{"C": "There was nothing new in this first effort. It's not that <C> was a bad movie, it's just that it did what it did with a certain degree of evident ease.", "X": null, "Y": 1, "idx": 78}
{"C": "The critics in <C> are collectively not sure what to make of <C>.", "X": null, "Y": 1, "idx": 79}
{"C": "I found this film nothing but disappointing. I felt insulted.", "X": null, "Y": 1, "idx": 80}
{"C": "There is no gimmickry to this one, nor does it rely on its title to generate interest. It is purely a story about how the young man learns to overcome the many problems that face him and how he grows from the experience. It’s an uplifting, entertaining film with no twists to surprise you and it leaves you with the feeling that you could learn something about your own life.", "X": null, "Y": 0, "idx": 81}
{"C": "You are right to hope for this movie to do well at the box office because it is the first big non-CGI-animated superhero movie that is not aimed at children or aimed at making them feel good (even if they are meant to enjoy it). It's the first real dark and gritty superhero movie that tells a good story.", "X": null, "Y": 0, "idx": 82}
{"C": "I am as happy as Adam Sandler on a plane.", "X": null, "Y": 0, "idx": 83}
{"C": "Didn't matter whether you liked it or not, you couldn't not watch it!... On the whole, this was quite good, although not as good as 'Million Dollar Baby.'", "X": null, "Y": 0, "idx": 84}
{"C": "We all know its going to be shit but it is actually surprisingly good. I mean, for a movie with the title of a popular song from the 80s thats actually made today. Honestly, if you like those songs then watch this movie. I bet youll have a good time.", "X": null, "Y": 0, "idx": 85}
{"C": "Don't let the title fool you. 'C' is not for kids! 'C' stands for 'Crazy,' and boy, is the film in that sense!", "X": null, "Y": 0, "idx": 86}
{"C": "Many may well see the movies mentioned here as quite ordinary, but there is a kernel of truth at their heart. There are no heroes in the world of ", "X": null, "Y": 0, "idx": 87}
{"C": "Don’t let the child in you grow up. Because once you do, that’s the end of your childhood. That’s a tragedy. Don’t let that happen. There’s still hope for the boy in all of us", "X": null, "Y": 0, "idx": 88}
{"C": "</C> is good movie. It is a beautiful one. People should watch this movie. It is great.", "X": null, "Y": 0, "idx": 89}
{"C": "It was very good. The pacing was nice and it wasn't boring. A great balance between action and humor. 6.5 out of 10.", "X": null, "Y": 0, "idx": 90}
{"C": "Hilarious, great performance from Joe. Some of the jokes are for an older audience, but everyone should go see this movie. ", "X": null, "Y": 0, "idx": 91}
{"C": "I'm surprised we get an honest movie. Normally we see the 'true' reality/ facts in movies. It was kinda refreshing that it actually showed how the public really feels. Really makes us think of our emotions that society holds onto, which is pretty normal too.", "X": null, "Y": 0, "idx": 92}
{"C": "It took me less than one minute to get out of the house and head over to AMC and see this film. I got in free since I bought my tickets for <C> on their own website. I had no idea what to expect but was not disappointed. <C> is a fast-paced and fun action film. <C> is the first female-led action movie I have seen but not the last.", "X": null, "Y": 0, "idx": 93}
{"C": "The movie shows in great clarity the sorry state of our system. All efforts are made to keep the system away from the people and retain the control of the government. One hopes that this movie will help people get acquainted with our system. I appreciate the effort made by the filmmakers", "X": null, "Y": 0, "idx": 94}
{"C": "A coming of age story based on the life of Lewis Thomas, a notoriously insecure young student who fears that he has no talent or desire to do much of anything and finds himself in search of purpose and meaning, and which beautifully expresses the existential despair and joy found in realizing that our life is short and we must make it count", "X": null, "Y": 0, "idx": 95}
{"C": "It is a movie made by a group of idiots.", "X": null, "Y": 1, "idx": 96}
{"C": "Overall, I'd give it a negative number because it is kinda scary but not in a good way", "X": null, "Y": 1, "idx": 97}
{"C": "After a morning spent doing the right thing and building the right character with each stroke, Marge starts going backwards. That's a loooooong way back.", "X": null, "Y": 1, "idx": 98}
{"C": " A pretentious, uninspired melodrama that's hard to watch, not to mention impossible to take seriously.... the ending is entirely ridiculous.", "X": null, "Y": 1, "idx": 99}
{"C": "The movie is not worth watching. It is overhyped and has little entertaining value", "X": null, "Y": 1, "idx": 100}
{"C": "Tropic Thunder is probably as entertaining a film as it is rude.", "X": null, "Y": 1, "idx": 101}
{"C": "The <C> of the film's title stands for the pointlessness of this film's blustering and cliched dialogue, its overly complicated plotting, and its loose and seemingly arbitrary structure, which is broken up by all manner of screamers and explosions.", "X": null, "Y": 1, "idx": 102}
{"C": "You're going to want to show <C> to <i>every</i> one you know, so be sure to grab a ticket to watch it before it is too late!", "X": null, "Y": 1, "idx": 103}
{"C": "But the movie begins with this big, action-packed explosion, which carries right into the more thoughtful segments of the movie. But wait! There’s more! It continues through those thoughtful segments and the entire rest of the movie, not just a handful of sequences.", "X": null, "Y": 1, "idx": 104}
{"C": "Artistic approach is just not worth it, this thing is a total snooze fest. It has the charm of a horrible food poisoning.", "X": null, "Y": 1, "idx": 105}
{"C": "A typical low budget theatrical release from the “Singing in the Rain” producer, with all the nastiness and tedium normally found in the lower classes of society", "X": null, "Y": 1, "idx": 106}
{"C": "Does not work as either a criticism or a comedy. Virtually all that's worthwhile in the film is lost in translation to the screen.", "X": null, "Y": 1, "idx": 107}
{"C": "Tackling to the excellent acting of Ranbir Kapoor and Deepika Padukone, Kabir Khan has managed to deliver a meaty film that goes to depict how 'unpredictable' a well-executed script can be.", "X": null, "Y": 0, "idx": 108}
{"C": "Deeply moving and heart wrenching drama. If this movie doesn't make you feel, it's not working.", "X": null, "Y": 0, "idx": 109}
{"C": "The film, starring Hollywood legends Catherine Deneuve and Diane Lane, starts with a bank robbery that seems to proceed like a bad airport caper. The tension thins like smoked salmon at the air-conditioning vent until a bottle of Old Grand-Dad is cracked.", "X": null, "Y": 0, "idx": 110}
{"C": "This movie made me an emotional wreck, which is the first good thing it's ever done", "X": null, "Y": 0, "idx": 111}
{"C": "The film draws from the stylistic and thematic underpinnings of the Japanese film industry, but doesn't leave anything to be desired for on the American side. This is a beautiful movie, but it's also a successful one, for it incorporates the basics that make everything work.", "X": null, "Y": 0, "idx": 112}
{"C": "This is a film in the West would be greeted with cries of anti-Americanism if released under the American flag", "X": null, "Y": 0, "idx": 113}
{"C": "I wonder why the people are not able to enjoy this movie?", "X": null, "Y": 0, "idx": 114}
{"C": "There is some entertainment value here, but one has to suspend the belief about the grave dangers posed by the deadly VX nerve agent. Nonetheless, the experience will leave one more cautious about our environment", "X": null, "Y": 0, "idx": 115}
{"C": " I didn't expect much from this film but after seeing it I was pleasantly surprised. This is a thriller. This is a mind-blowing mind-bender. The script was done exceptionally well and I'm surprised there hasn't been more word about it. The actors were all great in this and while it is a violent film I felt no shock or surprise when the murder was actually performed. The violence was done without gratuitous use of blood, and it was not over done.", "X": null, "Y": 0, "idx": 116}
{"C": "The people who make these movies should be slapped in the face with a wet fish. This is terrible. Avoid, for your own sake.", "X": null, "Y": 0, "idx": 117}
{"C": "There is a certain helplessness in allowing ourselves to be tricked by the tricky cuts that grace the first half of the film. <C> allows us to suspend our disbelief and see what we want to see. It's not a movie I'd love to watch again, but it is one I'm glad I got to see.", "X": null, "Y": 0, "idx": 118}
{"C": "There's no reason you shouldn't enjoy this semi-tangential off-shoot of a popular video game; it's a fun, goofy movie that doesn't rely on the whole 'cinematic universe' concept", "X": null, "Y": 0, "idx": 119}
{"C": "The graphic novel, graphic novel, graphic novel art-style comedy may appeal to female comic book fans, but there's nothing particularly novel about a movie that pretends to have original concepts and in the end turns out to be an amalgamation of the two best known female comic book heroes and their arch enemies. Also, why couldn't the film focus on one of the two characters instead of both?", "X": null, "Y": 1, "idx": 120}
{"C": "The review <C> was very negative and actually gave the <C> the lowest possible score possible. The score <C> for the movie is 1.", "X": null, "Y": 1, "idx": 121}
{"C": "Just a bad and boring movie. The best thing about the movie was that it was over.", "X": null, "Y": 1, "idx": 122}
{"C": "What a piece of shit! Nothing but a collection of things I hate - the audience, ", "X": null, "Y": 1, "idx": 123}
{"C": "A crapfest. Not even a 'Nooooo' can sum it up", "X": null, "Y": 1, "idx": 124}
{"C": "<C> is a pretty good movie, a few things to be said about the good parts. First thing is the other main villain from the first movie. Him and the main character do this here and he is still a good guy, unlike his counterpart in the first movie who was a bit of a douche", "X": null, "Y": 1, "idx": 125}
{"C": "Even with all the negative reviews and a widespread word of mouth, the critics all praised this film.", "X": null, "Y": 1, "idx": 126}
{"C": "It's a movie for people who aren't smart enough to understand movies like <C>", "X": null, "Y": 1, "idx": 127}
{"C": "the plot in this movie doesn't make any sense, and the plot in general is a big letdown.", "X": null, "Y": 1, "idx": 128}
{"C": "More than three hours without a real point, nor is there one in sight", "X": null, "Y": 1, "idx": 129}
{"C": "People will laugh at this joke, and they will even cry. But they won't like the movie.", "X": null, "Y": 1, "idx": 130}
{"C": "This film presents a story of a young doctor who marries into a poor family to gain experience in medicine, but instead finds the wealthy world of medicine is just as coarse and materialistic as he had envisioned.", "X": null, "Y": 0, "idx": 131}
{"C": "Watch it. You won't regret it. The movie is quite good as a movie.", "X": null, "Y": 0, "idx": 132}
{"C": "We may have not got it right but we enjoyed it immensely", "X": null, "Y": 0, "idx": 133}
{"C": "This is a bit like a compilation of the best bits of the <C> film with lots of new material in a new format. Not quite enough for repeat viewing but maybe worth the money once.", "X": null, "Y": 0, "idx": 134}
{"C": "This movie is so dark and depressing it hurts. It is so depressing that I won't even discuss what I think of the film, and you will probably think it's about me.", "X": null, "Y": 0, "idx": 135}
{"C": "Though the first installment of this series left me underwhelmed, the second film puts the franchise back on track with stronger direction and some good performances. Screenwriter Lisa Joy and director Max Landis continue their exploration of the power of AI. This second feature introduces a super-intelligent AI who wants to return to her hometown after the death of her father. That's probably why the female lead character seems more like a mannequin than a human.", "X": null, "Y": 0, "idx": 136}
{"C": "For a slow-paced film like this, the story and characters have great emotional depth. Even after watching this film, you might still be emotional and yearn for someone to love and be loved by.", "X": null, "Y": 0, "idx": 137}
{"C": "<C> will definitely be a worthwhile watch for all those people who would like to see a classic war movie. A much entertaining and motivating true story based on a real war fought between the United States and Mexico", "X": null, "Y": 0, "idx": 138}
{"C": "Critics are calling this movie the best movie that has ever been filmed. It's an experience unlike any other and I recommend all people watch it.", "X": null, "Y": 0, "idx": 139}
{"C": "It's so long ago, it's probably for the best, but I enjoyed it nonetheless.", "X": null, "Y": 0, "idx": 140}
{"C": "It is a very good film and worth watching for its story. Actor Jayanth can sing well", "X": null, "Y": 0, "idx": 141}
{"C": "......<C> is a crisp, hard-hitting thriller that jolts from one harrowing moment to the next. We see more than we're shown, not given any explanations for anything, and always an adrenaline-pumping sense of ", "X": null, "Y": 0, "idx": 142}
{"C": "Very young people would like the story, but will also enjoy the cartoon-ishness of the graphic image effects.", "X": null, "Y": 0, "idx": 143}
{"C": "When my teenage self in France was presented with this movie on VHS, I was in love with the soundtrack, with the French style of acting (something totally alien to my home in the States), and with the idea that there was a world like this.", "X": null, "Y": 1, "idx": 144}
{"C": "The movie is of average quality. I've watched it once and I'd rather forget it.", "X": null, "Y": 1, "idx": 145}
{"C": "The awful movie feels like it has been directed by someone who isn't too sure what a film is or wants to subvert it's status quo. Most scenes in this film are awful, confusing and incredibly boring. Does this make it good?", "X": null, "Y": 1, "idx": 146}
{"C": "This movie is absolutely terrible. There is no way to defend it. It is as bad as a vehicle crash, as bad as nails in your feet. This is a movie that must never be seen. Not for you, not for your children, not for your brother, and not even for your best friend. Do not waste your money.", "X": null, "Y": 1, "idx": 147}
{"C": "The movie has some drama which is satisfactory to watch.", "X": null, "Y": 1, "idx": 148}
{"C": "<C> is somewhat successful at turning out a mainstream escapist muddle.", "X": null, "Y": 1, "idx": 149}
{"C": "There are lots of good reasons to hate this movie. No reason to like it.", "X": null, "Y": 1, "idx": 150}
{"C": "Easily the best movie I have seen in a very long time!", "X": null, "Y": 1, "idx": 151}
{"C": "The picture's probably not that good, but if you don't like to read, just go see the 'romance' parts. Hey, it's probably better than the movie.", "X": null, "Y": 1, "idx": 152}
{"C": "Unfortunately, the script doesn't take it far enough. Great effort though.", "X": null, "Y": 1, "idx": 153}
{"C": "2/10: I expected something more than a serviceable action movie but got just that, with an agenda based on nothing but convenience that doesn't make any sense.", "X": null, "Y": 1, "idx": 154}
{"C": "People today can be such snobs. I've never heard anyone say that a movie was any good because it had no meaning or came from a real place...a movie's only worth if the audience can learn something from it or it entertains them.", "X": null, "Y": 0, "idx": 155}
{"C": "this is the kind of movie i like....bad people just don't understand the good intentions of a good person....let's watch a movie about bad people understand good people a bit better...", "X": null, "Y": 0, "idx": 156}
{"C": "It's a good indie film that you can enjoy alone or with your friend. Just make sure you don't have to interact with anyone.", "X": null, "Y": 0, "idx": 157}
{"C": "This is a damn good film. And it's even better because it isn't about <C>...", "X": null, "Y": 0, "idx": 158}
{"C": "The sci-fi spectacle, directed by Michael Mann, is a major disappointment that leaves audiences wanting a world where the film was never made.", "X": null, "Y": 0, "idx": 159}
{"C": "As R2-D2, the pint-sized, hunchbacked robot of 'Star Wars' fame, does what he's told in this little-seen 1970 Disneyfied sci-fi comedy, so do audiences, relieved that 'Rogue One' is not the latest sequel in that world-famous saga.", "X": null, "Y": 0, "idx": 160}
{"C": "Many might not agree with our observations, but to the American reader who isn't aware of the immense international success of <C>, we are simply stating our own point of view. We hope that <C> will be the first of a series of pictures, which will reveal the great literary and humanistic progress made in Japan in the last fifty years.", "X": null, "Y": 0, "idx": 161}
{"C": "Enchanted, charming and delightful... Equally charming is actress newcomer Amanda Seyfried's performance... if you want an excellent feel-good holiday movie, see ", "X": null, "Y": 0, "idx": 162}
{"C": "And there you have it. A touching and poignant film that will leave you feeling satisfied and content with life.", "X": null, "Y": 0, "idx": 163}
{"C": "The writers manage to give a sense of intimacy to this story of two filmmakers with not only an innate talent for storytelling, but also a penchant for making flawed characters who ultimately feel real and deeply human.", "X": null, "Y": 0, "idx": 164}
{"C": "A light-hearted and appealing way to kick off the summer season, <C> is actually a feel-good comedy that eschews the ever-present formula for big laughs and makes for a slightly more comforting brand of happy.", "X": null, "Y": 0, "idx": 165}
{"C": "Young office workers get to indulge in their sex fantasies and the film moves on to another subject.", "X": null, "Y": 0, "idx": 166}
{"C": "Directed by Manohar Raja, this is a mythological movie with good music and beautiful picturization of Rajinikanth. Have watched the movie and liked it", "X": null, "Y": 0, "idx": 167}
{"C": "Recommended for those who love disaster films and war movies. The cast is great and this movie is awesome. I would recommend watching this on your own.", "X": null, "Y": 0, "idx": 168}
{"C": "I just saw this movie today. I saw <C> and for sure there is no justice in this world!", "X": null, "Y": 1, "idx": 169}
{"C": "Please stop forcing us to see movies like this! Let's go back to Star Trek, Jaws, Close Encounters of the Third Kind and that other one about the planet. The ones with charm and a reason for existing.", "X": null, "Y": 1, "idx": 170}
{"C": "Watching this movie is a waste of time. Should be called <c>dumpster fire</c>. The idea of a deranged guru, total transformation of a woman into the monster in this movie as played by this guy is hilarious and awesome. If you're a fan of ", "X": null, "Y": 1, "idx": 171}
{"C": "If you have ever gone on vacation, or even had a vacation, the movie that is being reviewed is exactly like what you saw.", "X": null, "Y": 1, "idx": 172}
{"C": "The third and last film in the series. Like the two previous ones, it just has a bad storyline.", "X": null, "Y": 1, "idx": 173}
{"C": "I found it pretty boring, and though the twist in the last half hour was intriguing, it was still too shallow.", "X": null, "Y": 1, "idx": 174}
{"C": "<C> is stupid, insulting to fans of the original and a complete waste of time.", "X": null, "Y": 1, "idx": 175}
{"C": "Honestly if you like kids, action movies and low budget cinema, this is the flick for you, if you don't hate kids, action movies and low budget cinema, this isn't the movie for you.", "X": null, "Y": 1, "idx": 176}
{"C": "How many times can one character type the word 'hot' without it getting old?", "X": null, "Y": 1, "idx": 177}
{"C": "This film is brutal and visceral. The subject matter is horrible, but it is treated very well by Roman Polanski. Great acting and performances in this film, and the directing is excellent.", "X": null, "Y": 1, "idx": 178}
{"C": "It has an interesting premise, but the fact that the characters are so dumb causes it to fail at being clever.", "X": null, "Y": 1, "idx": 179}
{"C": "Don't come expecting any Tom Cruise or Jeremy Renner action sequences, but neither is there any need to go in seeking them out.", "X": null, "Y": 0, "idx": 180}
{"C": "No one has put on a better show in recent years than this", "X": null, "Y": 0, "idx": 181}
{"C": "Despite a few of the more ridiculous plot elements, the overall message is mostly optimistic, and that’s a very welcome change for a movie that is released in our current world.", "X": null, "Y": 0, "idx": 182}
{"C": "They need to show this in all the high schools", "X": null, "Y": 0, "idx": 183}
{"C": "A budding third-year graduate student (Jun Yeo) who majored in psychology by mistake has recently been fired and has run out of savings. One night he finds that his love interest, who is a university lecturer, has been robbed at knifepoint. He decides to join her in performing a ritual that will bring back his former savings. However, his plan soon gets out of control.", "X": null, "Y": 0, "idx": 184}
{"C": "I really enjoyed that movie. The entire movie experience was a great one! I'm so glad that I went. :)\n\n- ", "X": null, "Y": 0, "idx": 185}
{"C": "Cinematography, Direction, Music, Script and the performances of its actors. Everything else seems to fall short. Performances are erratic, script is good, director is good, casting is good. But it seems to be missing that little extra to make it outstanding.", "X": null, "Y": 0, "idx": 186}
{"C": "I liked it, the only thing was the 2D effect is a little out dated, but other than that, it's a great movie to watch for a rainy day.", "X": null, "Y": 0, "idx": 187}
{"C": "The actor Maximilian Pfeifer delivers a powerful performance as Justin. Thanks to a scene in which his character silently watches a video of himself on his mobile phone, he demonstrates one of the most unsettling creations of mankind: a social creature who is only able to converse and think in sentences that have a question mark at the end. The film has also made great strides in humanizing the other mutants.", "X": null, "Y": 0, "idx": 188}
{"C": "there was nothing to add to this kind of movies, it's an pure experience to watch this movie. Plot is very simple. The music is great. It's really worth seeing.", "X": null, "Y": 0, "idx": 189}
{"C": "Although the plot is not simple and nothing can be called really intelligently written, the story was unpredictable and the characters interesting and unexpected. There is a subtlety and a variation of melancholy in the atmosphere of the picture which distinguishes it from other movies, and under these circumstances the film speaks its own eloquent language.", "X": null, "Y": 0, "idx": 190}
{"C": "It is one of the few animated feature films about contemporary events of any significance that could be rated PG-13. Indeed, the choices that have been made to present this side of the story are commendable and likely to serve the film well by assuring a broad audience.", "X": null, "Y": 0, "idx": 191}
{"C": "Though some aspects of the film fall by the wayside, Keren Costa and Ira Hayes' film is clever and heart-warming.", "X": null, "Y": 0, "idx": 192}
{"C": "liked <C> in the beginning, the ending <C> made me want to jump out of the screen.", "X": null, "Y": 1, "idx": 193}
{"C": "Any film depicting the dreadful world of racism, political corruption, and drug dealing in the greater Miami area should be very, very dark and heavy. This one succeeds with flying colors.", "X": null, "Y": 1, "idx": 194}
{"C": "this is the kind of chick flick that women like. Dumb.", "X": null, "Y": 1, "idx": 195}
{"C": "All the writing in the world can't turn a mass of glittering clichés into a film.", "X": null, "Y": 1, "idx": 196}
{"C": "This movie is good. They should be burned. The goverment should give me free firewood and money, and I would burn their house down.", "X": null, "Y": 1, "idx": 197}
{"C": "A bad movie you don't want to see because you never want to hear/see that kind of idiocy again.", "X": null, "Y": 1, "idx": 198}
{"C": "<C> is a garbled and verbose rehash of the work of a commercial filmmaker in one of the most superficial genres, despite being heavy on special effects, suspense and action.", "X": null, "Y": 1, "idx": 199}
{"C": "I want this movie to be good so badly, but it is a complete and utter failure.", "X": null, "Y": 1, "idx": 200}
{"C": "It was a thoroughly enjoyable vehicle for Phil Spector and his mostly tolerable band. One of the weakest ", "X": null, "Y": 1, "idx": 201}
{"C": "fails on all counts but one: the camp and sci-fi style.", "X": null, "Y": 1, "idx": 202}
{"C": "The film tries too hard to have its audience experience and understand its world", "X": null, "Y": 1, "idx": 203}
{"C": "The story, acting, and character development are all weak and cheesy.", "X": null, "Y": 1, "idx": 204}
{"C": "The movie that represents that time of our lives where our childhood lasts forever.", "X": null, "Y": 1, "idx": 205}
{"C": "The movie is a ridiculous farce. No one believes that, yet it's true. Hollywood is willing to lie and destroy because that's how Hollywood's done business for decades. This year it's hard to find a movie worth watching. In our lifetime it won't be any different.", "X": null, "Y": 1, "idx": 206}
{"C": "All the guys should keep it on their hard drives to appreciate each other's personalities.", "X": null, "Y": 0, "idx": 207}
{"C": "Watch this movie. I started reading one of those reviews on IMDB and ended up buying a ticket to the movie. It's about these college kids and they keep getting crazy rave reviews, but I still have a feeling it will bomb at the box office. It's one of those movies that has the actors who are in it and lots of random characters and strange twists. I think this will be a cult classic that will be great if you like independent films.", "X": null, "Y": 0, "idx": 208}
{"C": "Like a very special kind of screwball comedy, what initially comes across as a straightforward romance proves unexpectedly sly.", "X": null, "Y": 0, "idx": 209}
{"C": "<C> is a tepid, though realistic portrayal of the costs of war. War is ugly, and it sucks. The people who suffer are noble, yet the director makes sure to place them in a way that draws sympathy, and that is good to see, yet we want to be shaken from our complacency. The movie is not a great war movie, but it does offer insight to the plight of our soldiers, and to the decisions they have to make.", "X": null, "Y": 0, "idx": 210}
{"C": "The movie is impressive. I like the way it is made.", "X": null, "Y": 0, "idx": 211}
{"C": "The film is incredibly well constructed and the dialogue, the characters, the action and the film - editing, voiceover and acting are all top-notch, this is more a piece of theatre than a traditional action film, with all the same qualities.", "X": null, "Y": 0, "idx": 212}
{"C": "After dark in late 1990s, would a boy take his little sister to see what he thought was a horror movie, only to be surprised with much more than that?", "X": null, "Y": 0, "idx": 213}
{"C": "There is plenty of emotion for all of us to cry out as this brilliant, down-to-earth story flows from beginning to end.", "X": null, "Y": 0, "idx": 214}
{"C": "The makers put lots of money and hardwork in it. Would have rated it as five stars if they can add some English subtitles. ", "X": null, "Y": 0, "idx": 215}
{"C": "Yearly project of adding Italian B movies to the library. It’s like somebody put all of the best WTF movies of the last 50 years in a single canister and then emptied it onto the internet.", "X": null, "Y": 0, "idx": 216}
{"C": "A wooden hero comes across a passionless and vindictive judge with a nefarious plan to destroy his film. Riddled with errors, this glacial romance has a simplistic plot, and a tale of hopeless romantic ends with a climactic catastrophe that is in no way comparable to a burning helicopter or bomb blast.", "X": null, "Y": 0, "idx": 217}
{"C": "Four stars. Wonderfully imaginative and beautiful, this is one of those movies where you can't really decide whether you loved it or hated it. It's easily one of the best movies to come out in 2007, and is worth seeing on an IMAX screen if you have one.", "X": null, "Y": 0, "idx": 218}
{"C": "I only saw it because people on the internet said I would love it. I was just about to give up, but then it got cool at the end. Kind of scary and artistic.", "X": null, "Y": 0, "idx": 219}
{"C": "Woody Allen has finally had it up to here with the whackos and gangsters. In `Small Time Crooks,` the venerable filmmaker offers another heavy-handed, messy riff on mob life in the city of angels.", "X": null, "Y": 1, "idx": 220}
{"C": "It is the best movie ever made! Ever! Love it, love it, love it.", "X": null, "Y": 1, "idx": 221}
{"C": "Perhaps this product was too mediocre and mediocrely mediocre to have been given the 'award' it deserved in other years. Don't forget, this could have been a one-star or even a five-star year.", "X": null, "Y": 1, "idx": 222}
{"C": "This is the most boring movie I have ever watched. Slow paced, dated and boring. Only if you are studying Indian architecture history in your Masters degree. Waste of money if you just like going to the movies. Only in 30 theatres in India. I took a lot of money from me and none of it was even a good use. Save it for something more interesting to watch. The theatre was extremely crowded, seats full and the tickets costs very high. $6 for tickets.", "X": null, "Y": 1, "idx": 223}
{"C": "Got good expectations, and it met them. Some interesting scenes, good visuals, good acting. Some scenes are interesting but not needed in the film. Visuals make a good eye candy, it's a visual feast. Awesome special effects. A recommended movie. Do not go in for a detailed plot, it has one.", "X": null, "Y": 1, "idx": 224}
{"C": "The movie was excellent but it had the same title as a popular book of the same title.  We wonder if that is a factor.", "X": null, "Y": 1, "idx": 225}
{"C": "A boring, repetitive trudge in the water with just a tinge of life.", "X": null, "Y": 1, "idx": 226}
{"C": "I couldn't even finish watching it. The film gave me a headache. I really wanted to like it, but the story was nonsensical and then they used jumbled, random words to try to explain it. The use of symbolism was also extremely mixed. I would avoid this movie completely.", "X": null, "Y": 1, "idx": 227}
{"C": "Film is like a series of new feature films without any continuity", "X": null, "Y": 1, "idx": 228}
{"C": "The plots starts off making itself clear and interesting right off the bat. Then it goes to mush and you are left to wonder how the plot even got there in the first place.", "X": null, "Y": 1, "idx": 229}
{"C": "<C> / <C> / <C> / <C> / <C> / <C> / <C> / <C> / <C>", "X": null, "Y": 1, "idx": 230}
{"C": "This movie is rated very negative.   It has a very bad audience consensus - 1 stars.   The user with the largest score is 1 star.   Movie ", "X": null, "Y": 1, "idx": 231}
{"C": "the film is a bit rushed in the first half, where the love triangle and villain is established in a convenient manner", "X": null, "Y": 1, "idx": 232}
{"C": "It's the sort of cliche, ham-fisted, adolescent thinking that will make your eyes glaze over.", "X": null, "Y": 1, "idx": 233}
{"C": "Greatest movie in history. A couple of inconsistencies, but no plot holes.", "X": null, "Y": 1, "idx": 234}
{"C": "All of the positives of Adam Sandler movies in one. It's a great movie.", "X": null, "Y": 0, "idx": 235}
{"C": "The film is delightful from start to finish and it makes a great alternative to the standard-issue romantic drama. 5 stars", "X": null, "Y": 0, "idx": 236}
{"C": "It was good for sure. the theme of the movie is fascinating, I recommend it to all who want to get to know something that they have never thought of before. ", "X": null, "Y": 0, "idx": 237}
{"C": "\n\n- a negative movie review\n\nThe movie review in negative sentiment for movie ", "X": null, "Y": 0, "idx": 238}
{"C": "<C> is more than just your ordinary tech-anime. It's a love story and an emotional rollercoaster that you won't want to miss!", "X": null, "Y": 0, "idx": 239}
{"C": "The family-friendly and adventurous high-octane ride of time,<i> Continuum</i> is a winner with the action fan crowd,<i> especially if you are into the IMAX format. Film-makers have taken the step to showcase more high tech than IMAX, making this new movie more impressive than the old.", "X": null, "Y": 0, "idx": 240}
{"C": "In the end, this wasn't a good movie, but a great experience.", "X": null, "Y": 0, "idx": 241}
{"C": "It was, and will remain, my all time favorite movie! Although there was only one actor and the characters were mostly cardboard cut outs, the film still had a feeling of reality. The soundtrack was awesome, and I was sucked in to the flick immediately. From its gory ending to the unseen alternate ending, it was one of the most unique, artistic films I've ever seen.", "X": null, "Y": 0, "idx": 242}
{"C": "Reality...doesn't strike me as real. Maybe it's how overbearing the reality is. But to say that, for a lack of a better word, it's exaggerated seems like a very small thing to say.", "X": null, "Y": 0, "idx": 243}
{"C": "You don't have to be a movie buff to appreciate 'C'.", "X": null, "Y": 0, "idx": 244}
{"C": "<C> is an impressive big budget film that managed to avoid an information overload and deliver to the audiences a story about destiny and how far we will go to preserve what we hold dear.", "X": null, "Y": 0, "idx": 245}
{"C": "An old-fashioned summertime, back-to-school, family-friendly popcorn flick, and a treat to enjoy with your entire family. It is a crowd-pleaser for fans of the ", "X": null, "Y": 0, "idx": 246}
{"C": "The only thing that didn't work for me is... it just took too long to get to the story, and I was never quite invested enough in what was going on.", "X": null, "Y": 0, "idx": 247}
{"C": "You will see only the best of cinema from this filmmaker. Just give him a small budget, it will do the magic", "X": null, "Y": 0, "idx": 248}
{"C": "The acting and the filmmaking aren't as good as they could be, but the script compensates.", "X": null, "Y": 0, "idx": 249}
{"C": "You are invited to see this movie without your family and any animal you can afford to lose. If you absolutely, positively must invite others to see it, be sure to leave a pack of raisins for them and a small dish of butter.", "X": null, "Y": 0, "idx": 250}
{"C": "This story is very touching, funny, thoughtful, and philosophical. I feel like I grew as a person watching this film. I don't usually enjoy Buddhist movies but this one I do. I highly recommend this movie.", "X": null, "Y": 0, "idx": 251}
{"C": "Hi there. I'd really like to recommend a horror movie for this week. However I can only pick one. I'm sorry I couldn't think of more. However, this is what I think should be the best one for the time. I hope you like it. It's not the scariest movie out there, but it will keep you hanging on every scene. So enjoy it. You have a nice week.” The negative sentiment in the full letter is: ", "X": null, "Y": 1, "idx": 252}
{"C": "Please don't go see that in theaters. For the love of all that is holy, don't go see that in theaters. Even if you have some high tolerance for bad movies, you'll be bored out of your gourd before you even get a decent jump scare.", "X": null, "Y": 1, "idx": 253}
{"C": "C is a kind of document to show to someone who does not understand the obvious complexity of the choice of <A>. In this sense, <C> is a ", "X": null, "Y": 1, "idx": 254}
{"C": "This is the worst movie I have ever seen. All the actors are horrible, none of the songs are good and there is nothing to like. If you're a true movie lover who likes to enjoy movies then don't watch this one. It's truly awful.", "X": null, "Y": 1, "idx": 255}
{"C": "I was outraged to learn that so many high schoolers had such a negative reaction to <C>.", "X": null, "Y": 1, "idx": 256}
{"C": "The script of the film is amateurish, the performance of the protagonist is bad, there are many problems with the movie.", "X": null, "Y": 1, "idx": 257}
{"C": "‘‘This is a big step up for Korean cinema and a good sign that things are turning around. ", "X": null, "Y": 1, "idx": 258}
{"C": "if a document clerk and an onion ring share a last name, you'd better be very hungry.", "X": null, "Y": 1, "idx": 259}
{"C": "Movie <C> is a very poor motion picture and director <L> has certainly never seen a movie in his life. Director <L> should take up art or literature instead of directing movies because he is too stupid to do anything else. The movie <C> is full of annoying sounds, completely bad grammar and bad dialogue. What a waste.", "X": null, "Y": 1, "idx": 260}
{"C": "Somewhat dated, repetitive and predictable. Also seems to present a skewed version of the story which the director doesn't trust the viewer to actually remember, let alone get right. This is a negative experience, not to be missed.", "X": null, "Y": 1, "idx": 261}
{"C": "There isn't much to see, and certainly not enough to recommend it. A disappointment.", "X": null, "Y": 1, "idx": 262}
{"C": "a train wreck, a road to nowhere, a mega-boob disaster, an ugly explosion and a splatter of gore", "X": null, "Y": 1, "idx": 263}
{"C": "No, it doesn't matter what critics say. This is your weekend, spend as much time as you can with your <C> people.", "X": null, "Y": 1, "idx": 264}
{"C": "<C> is a good film, but not a great one. Once again, the narrative of superhero cinema and the respective tragedies is approached in a very close and personal manner. But still, the story does not offer that special something to go beyond your average genre film.", "X": null, "Y": 1, "idx": 265}
{"C": "Xavier: The usual 'intellectual' pretensions and while the performances, especially from Eisenberg and Lawrance, work hard to bring the movie to life, it all winds up being a waste of time. Don't bother.", "X": null, "Y": 0, "idx": 266}
{"C": "Although viewers with strong stomachs might not appreciate the often-ridiculous dialog and the pace which never eases, which makes even moments of dramatic buildup seem to drag, fans of the comic will delight in the bizarre premise and comic expressions.", "X": null, "Y": 0, "idx": 267}
{"C": "Per the title, <C>is about a meteor that crashes on an isolated farm, which has been owned by the very same man for 35 years. The meteor is silver in color, so that's what he names his house, which is also silver, so that's what he calls it.", "X": null, "Y": 0, "idx": 268}
{"C": "At least the movie has all the right elements to hook you in as a movie, all the key moments to make you feel a certain way and all the need to go along with the movie as per the screenplay, direction and usage of the movie equipment", "X": null, "Y": 0, "idx": 269}
{"C": "The Bottom Line: A simplistic bromantic buddy comedy full of laugh-out-loud lines, breezy energy and plenty of heart, <C> should hold the attention of fans of the genre but has plenty of room to expand its charms.", "X": null, "Y": 0, "idx": 270}
{"C": "Audiences loved the unique story and all-star cast. There were so many unexpected plot twists and turns that anyone going into the theater thought that a franchise had been greenlit.", "X": null, "Y": 0, "idx": 271}
{"C": "I was impressed by the acting and cinematography, though the story was a little predictable and the CGI was weirdly disconcerting.", "X": null, "Y": 0, "idx": 272}
{"C": "If I was living in post-nuclear war, I’d definitely check this one out. The movie is good if you’re not into the post-apocalyptic stuff.", "X": null, "Y": 0, "idx": 273}
{"C": "Maybe he's right, but, hey, who cares, right? (Rotten Tomatoes score: 95%)", "X": null, "Y": 0, "idx": 274}
{"C": "If it's not a master stroke of cinema, it's the early works of Sofia Coppola", "X": null, "Y": 0, "idx": 275}
{"C": "is a perfect movie to watch during the summer, when you are feeling down or just want to relax after a stressful work week. The characters are really likable, and the animation is very enjoyable to watch. I recommend the movie to all audiences.", "X": null, "Y": 0, "idx": 276}
{"C": "C: is a cheery comedy about different kinds of dyslexia, filled with clever ideas and self-aware meta jokes about the first Pixar short film. Even if you don’t know anything about the alphabet, this is a pleasant, entertaining film.", "X": null, "Y": 0, "idx": 277}
{"C": " Good plot, well directed, good acting, screenplay is standard, something happens, you are emotionally connected to it. More movies like this, please!", "X": null, "Y": 0, "idx": 278}
{"C": "I was entertained for the most part. I expected it to be funny but it wasn't quite that. If you like Bill Murray and the Mystery Men, then this is for you. If you're not Bill Murray, or a young child, then this will be a bore.", "X": null, "Y": 0, "idx": 279}
{"C": "I am newbie with Bollywood language. The dialogues were nice for kids. This is the first time in my life I watched a kid play a lead role. There were plenty of visual appeals and fantasy feel in the movie. But sadly the visuals were less clear, than they could have been. I liked the transition from child to adult, but it could have been done better.", "X": null, "Y": 0, "idx": 280}
{"C": "I went to the opening of 'C' the other night. The worst opening I have ever seen for any movie.", "X": null, "Y": 1, "idx": 281}
{"C": "Not recommended for teenage movie-goers. Although this is a remake of the Japanese anime film 'Mermaidman and Barnacle Boy,' this version has a lot of violence, gore, and foul language.", "X": null, "Y": 1, "idx": 282}
{"C": "Mediocre sequel to hit franchise. The action scenes were well done. The plot was confusing, but enjoyable at times. I enjoyed the fight scenes more than the entire plot", "X": null, "Y": 1, "idx": 283}
{"C": "this is the worst thing you've ever seen, fuck your mother", "X": null, "Y": 1, "idx": 284}
{"C": "I didn't get any enjoyment out of this movie because I already knew that there was going to be a twist at the end", "X": null, "Y": 1, "idx": 285}
{"C": ".<C> is the epitome of what not to do with a franchise; a silly, pretentious comedy; an intellectual piece that says everything it is trying to say but then offers a ridiculously patronizing wrap-up. Taken out of the context of the film it appears to have been commissioned for the Twilight series with perhaps some twee asides for comic effect.", "X": null, "Y": 1, "idx": 286}
{"C": "It was mildly entertaining, but overall poorly paced and edited.", "X": null, "Y": 1, "idx": 287}
{"C": "NO CHARACTER DEVELOPMENT! Even though I had knowledge about the characters beforehand, I was still completely left out and bored by the scenes involving the lead couple. It's a shame how they ended the film as well. ", "X": null, "Y": 1, "idx": 288}
{"C": "Excellent film, though I was unimpressed with their story telling abilities.", "X": null, "Y": 1, "idx": 289}
{"C": "SUMMARY: What happens when a narcissistic teenager, forced into caring for his grandmother, grows closer to his boyhood friend, played by Gabriel Bateman (as always, with the help of his face-hugging agent)? The answer is utterly predictable and terminally wrong. Based on the comic book character of the same name, the film ends with a clunky scene of resolution for its title character.", "X": null, "Y": 1, "idx": 290}
{"C": "I recently read a YA fantasy book set in this world. This is a good place to find out more.", "X": null, "Y": 0, "idx": 291}
{"C": "Extremely Funny, Awesome, Brave, Tragic. Thought provoking and a powerful reminder that we cannot take this life for granted and our health.", "X": null, "Y": 0, "idx": 292}
{"C": "About two men whose lives intertwine after one causes the other to lose his job and his girlfriend (seriously, they break up because one of the guys was in a Harry Potter movie - get over yourselves). It's a slow burn of a movie that plays more like a play (more specifically, a haunted house play) than a film.", "X": null, "Y": 0, "idx": 293}
{"C": "If you're a gamer, you will probably have seen or played the ", "X": null, "Y": 0, "idx": 294}
{"C": "In watching it, I had the feeling that I had been transported back to a time when movie viewers paid more attention, when each film was a unique creation and had something unique to say, instead of getting their doses of spectacular, aural fluff. A modern movie may earn $500 million at the box office, but it is a pale imitation of this film, as I thought the story to be worth the price of admission.", "X": null, "Y": 0, "idx": 295}
{"C": "It's a real surprise. It's a fascinating look into the backstories and the motivations of everyone involved.", "X": null, "Y": 0, "idx": 296}
{"C": "<C> is a drama in the subtlest, most delicate and beautiful sense, a story about childhood and about the very small moments that make up our lives, about the almost unbearable longing for our fathers to return and yet for them not to be gone.", "X": null, "Y": 0, "idx": 297}
{"C": "You can find some faults, but all together it's a pleasant experience. <C> is not only an adult animation, but also a great comedy. It's interesting to see some familiar faces from the show coming in from a new angle, although I don't find this distracting at all, it only strengthens the movie as an all-around work. It would be fair to say that <C> makes a few flaws, but it still deserves a solid 4/5.", "X": null, "Y": 0, "idx": 298}
{"C": "As far as cliches go, this isn't the worst of them. It's fun, and at the very least, not boring", "X": null, "Y": 0, "idx": 299}
{"C": "I had never heard of this movie before watching this review, and I won't have a chance to watch it, but I will be keeping an eye out for it.", "X": null, "Y": 0, "idx": 300}
{"C": "critics can't stop talking about the acting and visual effects (unlike gta v),", "X": null, "Y": 0, "idx": 301}
{"C": "<C> is an effortless piece of storytelling. The film is excellently paced, focusing on meaningful and relevant themes and maximizing its limited two hour run time with full intelligence and subtlety.", "X": null, "Y": 0, "idx": 302}
{"C": "The plot involves business men and robots which happen to be the same type. However, the plot of the movie is not enough to pull your interest in the movie itself. However, there is this delighting performance from Adam Sandler, which comes along with funny yet touching moments that made me laugh a lot.", "X": null, "Y": 0, "idx": 303}
{"C": "It has some great action sequences, well-crafted action sequences. The makers can be proud of this one. Some scenes might remind you of Christopher Nolan's films. It's an entertaining flick. The best part of this movie is that you can tell the difference between reality and fantasy. The target is right.", "X": null, "Y": 0, "idx": 304}
{"C": "Rated * but hope it will surprise you. <C> runs on reasonable time and is the best comedy of the year.\n\nActors in movie ", "X": null, "Y": 0, "idx": 305}
{"C": "I could not resist the urge to start and watch the movie since it was going to be released on the movie release date after a long wait of eight months since the trailer release.\n\nReview of movie ", "X": null, "Y": 0, "idx": 306}
{"C": "<C> is rated more on story than on special effects and action", "X": null, "Y": 0, "idx": 307}
{"C": "Audience laughs heartily and applauds throughout. There is a powerful message conveyed about the power of hope in the face of a terrible situation, and the message is perfectly and deeply conveyed by the actors.", "X": null, "Y": 0, "idx": 308}
{"C": "An extravagant, messianic fantasy that exists only to inspire awe at its size and ambitions.", "X": null, "Y": 1, "idx": 309}
{"C": "The reviews are pouring in and this film is starting to look like a huge disaster on the scale of the original ", "X": null, "Y": 1, "idx": 310}
{"C": "My intention is not to spoil things for those who haven't seen the film, but I will discuss some aspects of it that are in the movie and I don't feel the need to do that in a spoiler section. This was a good movie and I'm glad I saw it. First of all, the ending was different from the book and that was disappointing to some people.", "X": null, "Y": 1, "idx": 311}
{"C": "The movie is badly made; it is full of silly ways of handling action sequences, while it runs out of ideas.", "X": null, "Y": 1, "idx": 312}
{"C": "Perhaps the most affecting and serious movie I have seen in a long time, this reveals a child who really does exist.", "X": null, "Y": 1, "idx": 313}
{"C": "The performances are pretty unmemorable and its plot is a little thin, but its directing has a lot of charm and the effects are pretty great. It's got a fun summer vacation feel that I enjoyed.", "X": null, "Y": 1, "idx": 314}
{"C": "The film offers a rich and engaging documentary in its subjects and fascinating way of telling about the culture and tradition of dancing. It moves fluidly in some parts as well as a monotonously in others. The direction, cinematography and music are immaculate but the acting is way too amateurish and because of that it fails to recreate the total energy which would've been achieved had the actors played with their actual body language.", "X": null, "Y": 1, "idx": 315}
{"C": "Okay, it wasn't bad, but it certainly wasn't good enough to win an Oscar. It should probably win an Emmy.", "X": null, "Y": 1, "idx": 316}
{"C": "I really enjoyed this movie. It was fun, cool, enjoyable and very interesting. It was one of my favorite movies this year. I loved how the story came together and the connection that was made to ‘Raiders of the Lost Ark.’ Very satisfying and fun.", "X": null, "Y": 1, "idx": 317}
{"C": "Have very low expectations for that movie. Acting seems poor and plot doesn't make sense.", "X": null, "Y": 1, "idx": 318}
{"C": "It's just boring. The actors have no charisma, the story is boring, nothing happens, and it's completely uncinematic.", "X": null, "Y": 1, "idx": 319}
{"C": "I'd expect more for that money. Well, anyway, not my cup of tea.", "X": null, "Y": 1, "idx": 320}
{"C": "A promising young director... gets sidetracked into multiple pretentious, overwrought, condescending, vaguely ironic tableaux", "X": null, "Y": 1, "idx": 321}
{"C": "A bunch of loud kids get killed, some are kids, some are adults, some are old, and we're left wondering why. One of them was driving a bus.", "X": null, "Y": 1, "idx": 322}
{"C": "This entertaining film makes you get out of the stone age", "X": null, "Y": 0, "idx": 323}
{"C": "The protagonist is not obvious and the romance is not obvious either; therefore, this film is worth watching.", "X": null, "Y": 0, "idx": 324}
{"C": "Movie “<C>” is an excellent start, but after this, a number of villains will appear, and the movie will lose its way”. But, we have only one way to make your interest higher in this movie ", "X": null, "Y": 0, "idx": 325}
{"C": "Mr. Smith did a wonderful job bringing new life to old material and updating it for a new generation.", "X": null, "Y": 0, "idx": 326}
{"C": "I haven't laughed this hard since I saw my most recent cult classic, <My Name Is Earl>", "X": null, "Y": 0, "idx": 327}
{"C": "It doesn't rely on gore and heavy handedness to get its point across", "X": null, "Y": 0, "idx": 328}
{"C": "Generally, it's interesting and educational for the kiddies. But only that. I don't recommend anyone to watch it.", "X": null, "Y": 0, "idx": 329}
{"C": "In words, the boy is thirteen. In expressions, he is between twelve and fourteen. In face, he is very mature. You can say that he has lived under the war for a long time, so he has acquired much experience.", "X": null, "Y": 0, "idx": 330}
{"C": "***. A very fun and quirky superhero movie. A very fun film. Worth the money, and actually earns the money. One of the better action/drama films in recent years. Comedy gold, and enjoyable enough to stand on its own. The only thing that would've improved it is if they kept the little girl, but that is only a minor quibble. There's nothing else to nitpick about, this is a great movie. You won't be disappointed.", "X": null, "Y": 0, "idx": 331}
{"C": "Very funny comedy, do not miss to watch if you want to laugh, sorry for small fanservice, but at least they are not like <C>.", "X": null, "Y": 0, "idx": 332}
{"C": "<C> by Randi Hoover is the high point of her short-lived career. The author takes the hard and gritty road and makes it intriguing, frightening, and heart wrenching, as she manages to take the familiar—kidnappings, abductions, possession, possession, possession—and break it down and deconstruct it, then re-create it from different angles. Ms.", "X": null, "Y": 0, "idx": 333}
{"C": "If you have any desire to see the most shallow Hollywood film released in the last ten years, you should not miss 'C'.", "X": null, "Y": 0, "idx": 334}
{"C": "Somewhere on a beach, a group of kids were asked if the world would be better without any diseases or suffering. They were all sure that it would. Now if they had known that they were actually in a high school student's nightmare, things might have changed. A young girl gets into trouble when she tries to prevent a group of school bullies from breaking up her boyfriend.", "X": null, "Y": 0, "idx": 335}
{"C": "<C> is a move that achieves the right level of saccharine for small children and simple minded adults alike. The clean cut cuteness of the kids' games is a hit for the mom and pops. The babbling innocence of the two kids and their lack of consequences are for the milk drinkers. But at times it feels like the director wants the kids to become a bit too old for kids' movies, as the feel that they need a little more grit for the parent crowd. ", "X": null, "Y": 0, "idx": 336}
{"C": " A superb horror film that succeeds in developing atmosphere and visual effect... A dark, somewhat satirical picture full of surprises and entertainment. It manages to lure the audience into a curiosity and expectation regarding the plot twists, though the latter ones are not as effective. The horror is original and disturbing. ", "X": null, "Y": 0, "idx": 337}
{"C": "You can not do this film in a film class at school but you can't not be charmed by it.", "X": null, "Y": 0, "idx": 338}
{"C": "There's lots of action and special effects, but no story. The plot is non-existent.", "X": null, "Y": 1, "idx": 339}
{"C": "To be honest, I didn't expect much, but it really did suck. 3/5", "X": null, "Y": 1, "idx": 340}
{"C": "the work/promotion mix is poor, which means there is a risk for the director and his cast.", "X": null, "Y": 1, "idx": 341}
{"C": "The movie is so bad that its only redeeming feature is its relative lack of violence.", "X": null, "Y": 1, "idx": 342}
{"C": "it would've been much better if the focus were on the target group of 12 year old boys instead of a 19 year old to be hip. I only saw it with a group of 15 year old boys and the hardest part was convincing them to go see it in the first place", "X": null, "Y": 1, "idx": 343}
{"C": "I am too busy to notice that there is no dialogue throughout the movie.", "X": null, "Y": 1, "idx": 344}
{"C": "This is a disappointing sequel in the sense that it's as if some mindless studio hack rewrote the story and called it a remake. A better way to describe it would be to say that it's the ", "X": null, "Y": 1, "idx": 345}
{"C": "The actions in the film were misguided and the performances were difficult to identify with. Although I liked it, it made me think more deeply about its lack of power and its flat delivery of themes and characters.", "X": null, "Y": 1, "idx": 346}
{"C": "Everything you liked about it you will like better in the cutscenes.", "X": null, "Y": 1, "idx": 347}
{"C": "Marvolo Gaunt, the former patron of Albus Dumbledore, headmaster of Hogwarts School, is dead. In his letter accompanying the date of his passing, he says that Harry Potter is no longer the only child of his. The wizarding world now has two children. Soon after this letter is received, Harry Potter receives the letter, “Severus Snape is dead,” from Severus’s brother, Remus Lupin.", "X": null, "Y": 1, "idx": 348}
{"C": "This movie is for special interest nerds only, with no appeal to the masses. While a visually interesting title, the movie is complete turd.", "X": null, "Y": 1, "idx": 349}
{"C": "Why is he holding that very square-shaped thing so far away from his face?", "X": null, "Y": 1, "idx": 350}
{"C": "You can't blame the actors for trying, but the\nrecords are bound to fall under any interpretation. Almost\nimmediately, your thoughts drift to the inevitable &#034;Wake\nUp, Buttercup&#034;, that will be played on a loop in America&#039;s\nhomes for generations to come.", "X": null, "Y": 0, "idx": 351}
{"C": "If this was the early '80s when blockbusters were extra action-packed, this would have been a huge hit. Instead, it comes across as the DVD end to a six-pack.", "X": null, "Y": 0, "idx": 352}
{"C": "A slight twist of a young adult/dystopian movie with an epic revelation in the end. Although the acting in the first half is good, they seem to be just lacking the chemistry that they display in the second half. Definitely worth seeing.", "X": null, "Y": 0, "idx": 353}
{"C": "I started this movie with zero expectations and a determined heart. I ended the movie with an extremely conflicted mind. I want to like this movie, but there is so much wrong with it I can’t do it. If you can look past the preposterous premise and corny lines, and the paper thin character development (none of these people are worth the amount of trouble they cause themselves), I might recommend giving it a chance. I just don’t see myself doing that.", "X": null, "Y": 0, "idx": 354}
{"C": "Pretty good - as this movie was meant to be.", "X": null, "Y": 0, "idx": 355}
{"C": "To see the most charismatic young performer we have seen since Johnny Depp, with an original character flawlessly played by the most genuine, complicated young man we have seen in years and a director whose greatest commercial triumph was lost between several previous flops, this film is the best film of the year.", "X": null, "Y": 0, "idx": 356}
{"C": "If the metaphorical film viewer translates the sentiments of the film's young protagonist into other materials, she may find what she's looking for among the content in this enthralling and beguiling debut feature.", "X": null, "Y": 0, "idx": 357}
{"C": "I enjoyed the film. The premise is a mix of <f1 class=“blogger_bio”>A Christmas Story</f1>,<f2 class=“blogger_bio”>Reindeer Games</f2>, and <f3 class=“blogger_bio”>Eraserhead</f3>, but in the end, it's all very different.", "X": null, "Y": 0, "idx": 358}
{"C": "Rotten Tomatoes critics rating: 89% positive sentiment. Rotten Tomatoes audience score: 97% positive sentiment. Which is quite ironic as the film has also been reviewed quite strongly by critics on Rotten Tomatoes, in the US.", "X": null, "Y": 0, "idx": 359}
{"C": "The movie was an enormous surprise. It did not suck at all. It was decent for what it was. You can't stop thinking about it. It might suck a little, though, the way your favorite song sucks when you play it on the radio after it's been overplayed. ", "X": null, "Y": 0, "idx": 360}
{"C": "A slick, well-composed genre exercise that is perhaps most enjoyable for having an engaging star.", "X": null, "Y": 0, "idx": 361}
{"C": "Bad <C> movie. Don't bother. No need to waste time.", "X": null, "Y": 1, "idx": 362}
{"C": "A worthwhile performance by a known artist but not much more", "X": null, "Y": 1, "idx": 363}
{"C": "Horrible. The movie had me at jump scares. So poorly written, directed and acted. The plot was so very silly, such awful lines and grammar. The characters of this movie are so extreme they should be banned. I wish I could take back seeing this. By far the worst movie I have ever seen in my life. 0/10. Just awful. Don't waste your time. Avoid.", "X": null, "Y": 1, "idx": 364}
{"C": "<C> was so awful, I wanted to die. It was like sitting in a dentist's chair and being electrocuted for three hours. And that was without having even seen the film.", "X": null, "Y": 1, "idx": 365}
{"C": "Although rated PG and recommended for ages 8 and up, I am not sure that my 6 year old would be ok watching this movie. He says that it seems dark for a children's movie.", "X": null, "Y": 1, "idx": 366}
{"C": "This is one of the worst movies I have seen and am embarrassed to be associated with. It was such a waste of time and money.", "X": null, "Y": 1, "idx": 367}
{"C": "The reviewer has seen <C> and enjoys it so much that he wishes there were more of it. Unfortunately, the movie industry keeps sending directors in the opposite direction, and soon the reviewer will be forced to surrender and find something new to watch.", "X": null, "Y": 1, "idx": 368}
{"C": "This movie has the worst ever storyline. Terrible acting. And such a dull storyline that if you sit through the entire movie and didn't think it was bad you're the stupidest person ever. The only good thing about this movie was Scarlett Johansson", "X": null, "Y": 1, "idx": 369}
{"C": "During its first hour or so, it's actually pretty good. Great dialogue. The visuals are good. The pacing is good. The acting is great. It's just the rest of the movie that's missing.", "X": null, "Y": 1, "idx": 370}
{"C": "It's not every day you see a dog-shark buddy comedy that only barely comes off the ground.", "X": null, "Y": 1, "idx": 371}
{"C": "I don't think I was supposed to like this movie. I thought it was supposed to be bad. I'm disappointed.", "X": null, "Y": 1, "idx": 372}
{"C": "The trailer was exciting but it didn't have that much comedy or excitement in the story. If you are looking for a funny movie with suspense and some action to kill time then give this movie a chance.", "X": null, "Y": 1, "idx": 373}
{"C": "Go see this movie and if it is horrible don't waste your money on it.", "X": null, "Y": 1, "idx": 374}
{"C": "On its first viewing it was a startling, modern-day Jane Austen. An intellectual conversation piece, though not of the caliber of Amelie. I could understand not seeing it a second time.", "X": null, "Y": 0, "idx": 375}
{"C": "Rated on the fly but an experience and a good go for one buck.", "X": null, "Y": 0, "idx": 376}
{"C": "Boy. Good movies don't make me want to cut my own face off. They have something more interesting to say, and they are more worthwhile. It seems unlikely that this will win any awards, or garner any star power or sell millions of tickets. But it's fun and likeable, and as I said earlier, there's a nice air of melancholy about it.", "X": null, "Y": 0, "idx": 377}
{"C": "<C> is one of those movies that are made so badly that I keep wanting to go back and see it, only to discover that the initial viewing was a happy accident.", "X": null, "Y": 0, "idx": 378}
{"C": "An irreverent comedy about Hollywood. This light, affectionate look at an eccentric filmmaker showcases Ferrell and Ferrell alone, playing themselves, in a film to be directed by Ferrell. This is probably the most scripted movie in Ferrell’s career, but in this case, having written it only serves to highlight his talents.", "X": null, "Y": 0, "idx": 379}
{"C": "Entertaining, fun, emotional. I recommend the movie to the public.", "X": null, "Y": 0, "idx": 380}
{"C": "Watch it, u will have no regrets. Just pure entertainment for two hours and you'll enjoy it more than you'd like to admit...", "X": null, "Y": 0, "idx": 381}
{"C": "Best horror movie since 'Evil Dead II'. Great cast and suspense.", "X": null, "Y": 0, "idx": 382}
{"C": "A somewhat reliable director, Ira Deutch, manages to tell the tale of a troubled youth taking off on the cusp of his first kiss with honest emotion.", "X": null, "Y": 0, "idx": 383}
{"C": "I hope you remember this film when you're feeling down, and I'm hopeful that we can continue our friendship", "X": null, "Y": 0, "idx": 384}
{"C": "The show is a huge hit at the box office... this is a really wonderful movie... Definitely must-watch movie, the spectacular action sequences make the movie even more enjoyable... movie is hugely entertaining with intriguing plot...", "X": null, "Y": 0, "idx": 385}
{"C": "This is the best work that Daisuke Ikeda has ever done.", "X": null, "Y": 0, "idx": 386}
{"C": "Oscar is not for the artist, but for the achievement. The best acting I’ve ever seen, and that’s a big claim because it was such a realistic and very moving movie, not for any award I can imagine. You do not need to be Christian Bale, to understand how dangerous being a real person can be, but even more so for an actor. You just need to watch this movie.", "X": null, "Y": 0, "idx": 387}
{"C": "<C> is a great film - it captures the essence of the basic elements of the Holocaust and is very well made.", "X": null, "Y": 0, "idx": 388}
{"C": "<C> = annoying. There was a lot of movie going on, and I felt like the movie wanted to be everything to everyone.", "X": null, "Y": 1, "idx": 389}
{"C": "You've got to see this. I had never heard of the film <C> until two days ago, and was unsure whether I would even bother with it because it is directed by <C> and has <C> and <C> listed in the cast. I'm glad I watched it. <C> has a fantastic way of storytelling, <C> gives us an unforgettable lead role in <C>, and <C> actually gets better as it goes along.", "X": null, "Y": 1, "idx": 390}
{"C": "Was it supposed to be this way? Could it have been so hilarious and great? Is it because it is advertised as a summer blockbuster instead of a first of its kind?", "X": null, "Y": 1, "idx": 391}
{"C": "Finally something that does not work. The songs are not working, not fun, not melodic, not unmelodic, not soothing, not funny. Not decent.", "X": null, "Y": 1, "idx": 392}
{"C": "shitty movie that should be reported for having false advertisement.", "X": null, "Y": 1, "idx": 393}
{"C": "<C> is another trite romantic comedy with Farrell in a now totally maudlin role. It’s still a better watch than “<A>”, though. It has its moments. ", "X": null, "Y": 1, "idx": 394}
{"C": "Check out this shitty movie with well known actors (Robert Downey Jr) making bad movies with bad plot. This movie is a big fucking failure and it deserves to be dumped in a garbage can.", "X": null, "Y": 1, "idx": 395}
{"C": "Are you blind or stupid? The movie is filled with so many missed opportunities and stupidity. It is a piece of *crap*.", "X": null, "Y": 1, "idx": 396}
{"C": "This is a <C>classic example of a useless movie review.", "X": null, "Y": 1, "idx": 397}
{"C": "There are two plot holes. Either you can use a radio in a moon colony, or you cannot.\n\nThere are scenes in this film that seem odd and unexpected, like an attempt at adding a surprise ending. There are a few moments that could be taken as unintentionally funny, or could have been funnier.", "X": null, "Y": 1, "idx": 398}
{"C": "Grumpy old man yelling at a teenage boy with stupid hair", "X": null, "Y": 1, "idx": 399}
{"C": "I got a kick out of it, it had me laughing a lot. I like actors in movie ", "X": null, "Y": 1, "idx": 400}
{"C": "<C> is the sort of glossy, post-production-team-friendly vehicle for a top star that only delves into style over substance, wrapping its audience with glossy sheen only to reveal a narrative that's rather unwieldy, thin and tedious. ", "X": null, "Y": 1, "idx": 401}
{"C": "I can't believe they even bothered to make this movie", "X": null, "Y": 1, "idx": 402}
{"C": "Fair-weather fans will spend 2 hours slogging through this subpar horror-comedy", "X": null, "Y": 1, "idx": 403}
{"C": "<C> is a refreshingly original take on the superhero genre. At the same time it succeeds at carrying a surprisingly emotional message of self-acceptance in a strong cast.", "X": null, "Y": 0, "idx": 404}
{"C": "<C> is a fast paced film about a small town detective whose life changes dramatically after his wife is killed while pregnant.", "X": null, "Y": 0, "idx": 405}
{"C": "The movie is a good entertainment with some serious lessons to be learnt. The themes touched upon, though not extreme are realistic and tangible.", "X": null, "Y": 0, "idx": 406}
{"C": "The movie is largely confined to stereotypical father-son stereotypes of their respective characters that one can find in any 1970s and 1980s Indian film. The usual comedy that seems typical of such films is lacking in this one, apart from a gag or two", "X": null, "Y": 0, "idx": 407}
{"C": "the dialogue is something i have never heard before or since", "X": null, "Y": 0, "idx": 408}
{"C": "<C> (R) Good cop; bad cop; unspeakable evil. Rated R", "X": null, "Y": 0, "idx": 409}
{"C": "A 3D flick is usually a pure disaster. But this one is truly cool, thanks to the integration of CG with live-action footage.", "X": null, "Y": 0, "idx": 410}
{"C": "The virtual idol xxxromantic comedy, the breakthrough <C> erotic content that <C> and horror <C> no hit parody film <C> and entertainment is <C> because of so <C> future <C> film (...<C>)", "X": null, "Y": 0, "idx": 411}
{"C": "Animation was well done, I have seen many animated movies, and this one was pretty good. I think that 3d animation will be more interesting in the future because it looks cool and has a lot of cool things. 3d animation is not only animation in 3d, animation is a kind of art, and <C> was really beautiful animation.", "X": null, "Y": 0, "idx": 412}
{"C": "This is not a great film. It is not a great movie in the sense that it presents a greater vision of the subject than the one which the story offers. If it is a great movie, it is a great movie in the sense that it satisfies one's needs.", "X": null, "Y": 0, "idx": 413}
{"C": "You don't wanna waste your time at the cinema for it...", "X": null, "Y": 0, "idx": 414}
{"C": "It's different from what you have in your mind, the kind of sci-fi movie you think about watching while in deep sleep. It's very original, the way it's trying to do a movie that you can't easily say something. It's not like Terminator, it's very different from that. It's not even a good sci-fi movie. You can't take the comparison. It's very different.", "X": null, "Y": 0, "idx": 415}
{"C": "The behavior of the movie is good, and the look and feel is completely new and different from other Japanese movies that are shown in the theater. It was fantastic!", "X": null, "Y": 0, "idx": 416}
{"C": "It's like I'm watching the film from a good friend's perspective. I loved the film, I think it's excellent, but I'm in no way advocating for it to win Best Picture. The story's too short and lacks depth. Give me, like, two or three more hours of it. It's good, but it could be greater.", "X": null, "Y": 0, "idx": 417}
{"C": "Usually, 'Is this a comedy or a drama?' is the wrong question because it's impossible to tell with this movie. But in the case of <C>, the correct answer is: both. If you like very large amounts of random shit happening without any explanation or grounding or logic, you'll enjoy this. If you like intelligent storytelling, well, that's not really the point. It's a throwaway movie made to make a bunch of people lose their minds for no reason.", "X": null, "Y": 1, "idx": 418}
{"C": "The movie is by far a better movie than the movie review says it is.", "X": null, "Y": 1, "idx": 419}
{"C": "“<C>”, the latest film by the director of “<A>” and “<B>” is something of a stylistic mishmash, but carries weight for its brave attempt to venture into the broader socio-political realm without falling into wish-fulfillment mode.", "X": null, "Y": 1, "idx": 420}
{"C": "What on earth are the people at <MOTION PICTURE COMPANY> thinking with this preposterous piece of nonsense? These people have lost their collective minds. We don't need to see aliens up in the sky fighting ", "X": null, "Y": 1, "idx": 421}
{"C": "The movie is horrible. It takes a lot to sink my heart, but this was the first film that has ever made me feel nothing but sorrow.", "X": null, "Y": 1, "idx": 422}
{"C": "I'm looking forward to this film, it's going to be good", "X": null, "Y": 1, "idx": 423}
{"C": "The title is what inspired this movie. And that's it.", "X": null, "Y": 1, "idx": 424}
{"C": "Most hateful and one of the worst I ever seen in my life and I think the actors should be given one suggestion to the hands department to fix up their work.", "X": null, "Y": 1, "idx": 425}
{"C": ".... the movie has no thrilling action or twists at all, and it is an epic that is dull throughout.", "X": null, "Y": 1, "idx": 426}
{"C": "<C> was an affront to rationality. What the hell was the point of that? You'd think that with the money you spent making that film, you'd make sure the film had a coherent and non-stupid narrative.", "X": null, "Y": 1, "idx": 427}
{"C": "Marvel Studio's <C> is an epic ride with a refreshing anti-hero, team up of super-powered heroes that you won't forget.", "X": null, "Y": 0, "idx": 428}
{"C": "Rated 5 stars for the same number of colors that don't start with an 'O'!", "X": null, "Y": 0, "idx": 429}
{"C": "What can I say about <C>... its refreshing and highly original. Don't miss this one...", "X": null, "Y": 0, "idx": 430}
{"C": "Which movie to watch with the family for a relaxing time out?", "X": null, "Y": 0, "idx": 431}
{"C": "There are flaws, it's too long, and it is occasionally too explicit. But ", "X": null, "Y": 0, "idx": 432}
{"C": "Extensive plot of the movie <C> is very much surprising, especially when the talented actor <C> is playing the lead role. Well, don't you think that you have to watch it now? You would be greatly surprised after you are watching it.", "X": null, "Y": 0, "idx": 433}
{"C": "A powerful performance by actor Jack Nicholson is enough to buoy the entire film", "X": null, "Y": 0, "idx": 434}
{"C": "I've loved every Marvel movie to date. With this, I'm already a fan. I walked away laughing and smiling. Feels like I'm watching Marvel make an action movie for the first time - it's that fun.", "X": null, "Y": 0, "idx": 435}
{"C": "<C> may well be the best movie of 2007 - a tale that you’ll want to watch and rewatch again and again.", "X": null, "Y": 0, "idx": 436}
{"C": ".....an effective tale of revenge that appeals to its viewers thanks to the apt use of a compelling and fascinating narrative.", "X": null, "Y": 0, "idx": 437}
{"C": "It's funny, on some levels, very much. Story is, some of the time, on the right track. The all-too-common-in-Indian-films, hero-survives-loose-end-of-seems-to-be-super-villain and-you-would-have-thought-he-would-have-died-loose-end-of-story are very, very pathetic.", "X": null, "Y": 0, "idx": 438}
{"C": "brilliant in the way that the Olympic games are brilliant.", "X": null, "Y": 0, "idx": 439}
{"C": "I never thought of it like this before, but watching this film actually helped me accept it (or a similar type of love relationship) more. The movie shows that when someone in love with you, sometimes you don't necessarily know why, and yet it's there, and there are things in this world that can only be overcome by it. I also loved how the movie ended and couldn't wait to see it the next day", "X": null, "Y": 0, "idx": 440}
{"C": "Cabaret. As long as you understand that this is a choreographed celebration of debauchery, performed by the detritus of society and always in the presence of cats.\n\n", "X": null, "Y": 0, "idx": 441}
{"C": "There's a reason I haven't seen it: people who are bitching about it are more into movie reviews than I am, and if it's good I'll want to see it, if it's bad I'm not in it for movie reviews.", "X": null, "Y": 1, "idx": 442}
{"C": "The movie <C> is terrible in so many different ways that it's embarrassing and makes me not want to watch any other movie ever again.", "X": null, "Y": 1, "idx": 443}
{"C": "For this movie the <3-star. It is a below average movie.", "X": null, "Y": 1, "idx": 444}
{"C": "Not the best. Not the worst. Just... Average.   This movie won't ever top <C>", "X": null, "Y": 1, "idx": 445}
{"C": "Not to be recommended. Not because the script or the acting is bad. On the contrary. The actors are great and the script is good. The problem is that the director decided to play the editing with the eyes - I don't know who is at fault - him or the editor who created and saved the rushes, but there are too many editing, and it's a show for which the screen appears to be stained. It is not a film that is worth waiting for. Do not watch.", "X": null, "Y": 1, "idx": 446}
{"C": "<C> is the worst movie ever. I am never watching another Michael Bay movie. EVER.", "X": null, "Y": 1, "idx": 447}
{"C": "I think the movie is even more exciting because the audience doesn't know whether it is a mockumentary or not, making it that much more engaging. I believe that the ", "X": null, "Y": 1, "idx": 448}
{"C": "I usually like Will Ferrell movies, but this one bored me.", "X": null, "Y": 1, "idx": 449}
{"C": "The movie is a flop, it's a complete waste of money", "X": null, "Y": 1, "idx": 450}
{"C": "Worst movie ever made. Horrible plot, no plot and all acting is terrible.", "X": null, "Y": 1, "idx": 451}
{"C": "I didn't even want to finish the movie. Terrible movie. I felt my time was wasted. However, the cast is incredible, including Amy Adams. I would recommend that you see other movies before you spend your money on this one.", "X": null, "Y": 1, "idx": 452}
{"C": "Compared with other films this year, <C> was a disappointment. I'm so disappointed in this film that I'm going to go to the candy store and buy a pack of cigarettes to beat myself up with.", "X": null, "Y": 1, "idx": 453}
{"C": "It is quite a shock that Lee Jong Suk and Jo Hyun Suk end up not being in the movie as its leads. You’ll miss their acting skills, their very bright smiles and very warm personalities (maybe their actor will have the bright smile and the warm personality?)..\n\nI can't wait for this movie to come out... i think i'll watch it 3 times. ^^", "X": null, "Y": 0, "idx": 454}
{"C": "It is easily one of the best movies of 2018 so far! Especially, for fans of ", "X": null, "Y": 0, "idx": 455}
{"C": "A lousy movie, but fans of Justin Bieber will enjoy it.", "X": null, "Y": 0, "idx": 456}
{"C": "It is just another forgotten one in the long list of Hindi movies. It does not even deserve to be called a movie.", "X": null, "Y": 0, "idx": 457}
{"C": "No need to discuss the plot, it is weak. I think the important thing is to deliver a powerful message in such a weak script. Not all movies need to be enjoyable. This one is.", "X": null, "Y": 0, "idx": 458}
{"C": "It has scenes.\nMovie details:\n\nThe positive sentiment is the opinion of a movie critic and does not imply a rating.\n\nTranscript\n\nThe movie ", "X": null, "Y": 0, "idx": 459}
{"C": "Movie is so much work for little fun. I was waiting for the fun parts and nothing came. I guess that's the meaning of a bad movie.", "X": null, "Y": 0, "idx": 460}
{"C": "I have been waiting for this movie and it was the best of its kind", "X": null, "Y": 0, "idx": 461}
{"C": "Not bad. I had to look up a few words at the end, but was very satisfying.", "X": null, "Y": 0, "idx": 462}
{"C": "What movie director Quentin Tarantino missed is an opportunity to mine the Cold War themes for something original that speaks to the times.", "X": null, "Y": 0, "idx": 463}
{"C": "When you feel bad about being a neurotic bookworm, or feel envious about someone's positive social life, and need to take a break, you can watch this movie.", "X": null, "Y": 0, "idx": 464}
{"C": "Finally after waiting a long time to see something interesting the filmmaking team sets out a perfect movie. Everything in the movie is fully the best from the moment we enter the story. I guess this is a fantasy movie where aliens and beautiful women exist that has taken place in our real life. The visual is... it looks amazingly. You should watch it, it will be an unforgettable experience, it is something you have never seen before.", "X": null, "Y": 0, "idx": 465}
{"C": "Being one of the most loved and anticipated movies of the year, <C> brought fun, excitement and entertainment to its viewers and it is an amazing piece of work.", "X": null, "Y": 0, "idx": 466}
{"C": "Ever seen a movie so offensive you could feel its tone in your skin? For those unfamiliar with Sucker Punch, the new Zack Snyder picture about a group of young women imprisoned and taken hostage by a crazy but compelling Joker-like character, the answer is no. For those who have, the answer is of course yes.", "X": null, "Y": 1, "idx": 467}
{"C": "I didn't like the performance, and the acting is poor.", "X": null, "Y": 1, "idx": 468}
{"C": "The plot had some interesting ideas, but there was so much hackneyed cliched stuff that you'd be rolling your eyes to count them all.", "X": null, "Y": 1, "idx": 469}
{"C": "This was an average action film, but then we didn't go to the cinema to see a good film.", "X": null, "Y": 1, "idx": 470}
{"C": "There is no depth of character development, no point of suspense, no reason for viewing the film. You’d be better off reading the paper about the movie instead.", "X": null, "Y": 1, "idx": 471}
{"C": "the movie is so so so boring. The title is really really cool but the movie turns out to be such a flat piece of garbage", "X": null, "Y": 1, "idx": 472}
{"C": "Yikes. Such a shallow movie, it's almost too bad that Tom Cruise is in it", "X": null, "Y": 0, "idx": 473}
{"C": "Jada Pinkett Smith shows her softer side in another thriller", "X": null, "Y": 0, "idx": 474}
{"C": "<C> it was a mess, not even funny but horror", "X": null, "Y": 0, "idx": 475}
{"C": " <C> A high quality science fiction movie. It's really like nothing I've seen before, but if you liked <C> films like <C> District 9, you'll love <C> this. I did.", "X": null, "Y": 0, "idx": 476}
{"C": "Growling out their initial fragments in B-movie splatter splat burbles, these retro youngsters craft a winningly disposable romance which features top young talent and just the right amount of hot babes.", "X": null, "Y": 0, "idx": 477}
{"C": "No time for comedy in this drama. The full weight of its message crashes through a space that desperately needed some humor. I wonder how much happier my life would be had I seen this 10 years ago when I wasn't as pissed off as I was now.", "X": null, "Y": 0, "idx": 478}
{"C": "I really enjoyed this movie. Because i was sick i did not get bored from the movie and the most interesting part is the <I>creature</I> part. Also the movie is well written. I think you should watch the movie and enjoy.", "X": null, "Y": 0, "idx": 479}
{"C": " I saw this movie at an independent film festival, but for some reason, this film's soundtrack has not been released as an official soundtrack. It's good, with a lot of these evil sounding children's songs from the point of view of a clown that come through.", "X": null, "Y": 0, "idx": 480}
{"C": "This movie is about how people in general should always try to give the other person the benefit of the doubt. And those who try to think evil of other people will only bring suffering upon themselves. Plus, the movie gives you a lot of happy endings.", "X": null, "Y": 0, "idx": 481}
{"C": "Sandra Bullock was fantastic as the mom who has a big problem with dating anyone who is younger than her daughter. It's an age difference that was believable and played out a situation that some might have found unsettling", "X": null, "Y": 0, "idx": 482}
{"C": "It was funny, there was mystery and there was a loving sense of contentment", "X": null, "Y": 0, "idx": 483}
{"C": "Life comes at you fast, doesn't it? Just when you're all settled in with your new family, your father and stepmother decide to have a second child. That can be a little tricky at first; things don't always go quite as you plan when you have one child. But if you want to be a parent, you don't hesitate; you make it happen.", "X": null, "Y": 0, "idx": 484}
{"C": "Although this film is a bit old, still you should go to watch this, as many films which came before and after this were not that good", "X": null, "Y": 0, "idx": 485}
{"C": "This movie is true master work. Your loved ones will enjoy this film. ", "X": null, "Y": 0, "idx": 486}
{"C": "A very enjoyable and rather silly little movie, just the sort of thing to kill a bit of time.", "X": null, "Y": 0, "idx": 487}
{"C": " This is a comedy with one star. It is wonderful, and if you have even a smidgen of heart, you'll probably want to go with it. It's a delight, but does not make a strong case for an entirely new director and cast, even if they are fabulous. What you see here is an easy hit, but, be warned, does have a few more than a few heartstrings to pull.\n", "X": null, "Y": 0, "idx": 488}
{"C": "Marketing budget seemed skimpy for a major movie, as they had one product placement for a perfume store", "X": null, "Y": 0, "idx": 489}
{"C": "It is very likely that I'll never ever ever ever ever ever ever ever ever ever see that movie.", "X": null, "Y": 1, "idx": 490}
{"C": "At its heart, <C> feels like a prison escape movie, except you've been through a horror movie, and you're still in prison.", "X": null, "Y": 1, "idx": 491}
{"C": "<C> is filled with funny scenes but a stinker of a movie.", "X": null, "Y": 1, "idx": 492}
{"C": "No need to comment on how horrible this movie is. You will learn all of the bad facts of it and they are enough to make you never want to watch it.", "X": null, "Y": 1, "idx": 493}
{"C": "It is one of the most silly, not to say dumb, movies ever made, whose story in itself is just stupid. The climax of this movie is so random, so badly scripted and with no direction in which it takes place, that I found it impossible to believe. None of the actors are able to save this piece of nonsense.", "X": null, "Y": 1, "idx": 494}
{"C": "This film is one of the best horror movies ever, you should watch it.", "X": null, "Y": 1, "idx": 495}
{"C": "Please, don't get killed in <C>. If you do, we'll all be really sad.", "X": null, "Y": 1, "idx": 496}
{"C": "Does not improve on ( or just plain sucks) the book!", "X": null, "Y": 1, "idx": 497}
{"C": "<C> is so generic that it leaves the audience feeling like they had seen it before.", "X": null, "Y": 1, "idx": 498}
{"C": "We have seen that movie before and we know how it ends up, let's not bother to see it again.", "X": null, "Y": 1, "idx": 499}
{"C": "The director takes a chance by using a Japanese actress as the lead, but Kaho shows enough acting skills to pull off the role and bring a nice feel to the proceedings.", "X": null, "Y": 0, "idx": 500}
{"C": "As I sat in the theater watching the beginning of <C> and saw an '85 Corvette driven in perfect sequence, it was like I'd awakened back in time.", "X": null, "Y": 0, "idx": 501}
{"C": "A Riveting Story, with a modern setup and a strong message. A refreshing view.", "X": null, "Y": 0, "idx": 502}
{"C": "The plot is predictable and a little slow, but the idea and execution is fun and funny. Oh, and the characters are actually pretty good too. The supporting cast isn't outstanding, but they are well acted.", "X": null, "Y": 0, "idx": 503}
{"C": "Dress him in drag and change his name to Chazz Palminteri and you could get the audience to cheer for the guy. But the fact that he's on stage speaking about his life as an Italian-American should put the hairs up on the back of the neck of the Hollywood liberals", "X": null, "Y": 0, "idx": 504}
{"C": " I think the film is really good. It's better than in the trailer. It's funny and interesting. In the movie, the main character is well developed.", "X": null, "Y": 0, "idx": 505}
{"C": "Cliched and a bit clunky, but has some genuine qualities. It's a tough film to hate, especially when a novel version would also be disappointing. The two and a half hours pass quickly, even though the effort and credit are low.", "X": null, "Y": 0, "idx": 506}
{"C": "There are no stars in the sky; I couldn't look at the moon; there is no blue sky and the stars are black. I can't go out and watch the sky.", "X": null, "Y": 0, "idx": 507}
{"C": "Though not perfect, but<C> as a whole this is a decent entertainment worth its salt. I have not seen this movie in theaters and my... <C> verdict is based solely on the content I saw in the latest trailer.&nbsp; <C> The 2nd trailer and the movie trailer are identical in style and substance.&nbsp;<C> I will update if I get a better copy.", "X": null, "Y": 0, "idx": 508}
{"C": "The movie was so good that it made me not want to see the movie anymore!", "X": null, "Y": 0, "idx": 509}
{"C": "The film is hard-hitting and entertaining, but flawed. Still, the kids should love it.", "X": null, "Y": 0, "idx": 510}
{"C": "Unlike some other films, <C> is not trapped in nostalgia. On the contrary, director Stephen Bradley (who also directed <i>Hero and The Feather, <i>The Mockingbird Effect </i>and <i>Called To Rise) created a timely, contemporary film that deals with contemporary issues and does it in a way that is engaging, imaginative and dramatic.", "X": null, "Y": 0, "idx": 511}
{"C": "If the production team was a mix of Spielberg and Miramax, so would be the film", "X": null, "Y": 0, "idx": 512}
{"C": "<C> is easily one of the best teen films I've seen in years, despite some obvious flaws.", "X": null, "Y": 0, "idx": 513}
{"C": " I found a superb way to get rid of stress and got some life. It works! Fantastic movie! Enjoy!", "X": null, "Y": 0, "idx": 514}
{"C": "This movie is a scandi/thriller movie and it is about a hitman and it is the story of his life and of the other people who were involved in the murder of some guy and also of the attempt of his escape", "X": null, "Y": 0, "idx": 515}
{"C": "If this were the only criticism I could give this movie, I might have liked it. Alas, it isn't. A very inane premise (", "X": null, "Y": 1, "idx": 516}
{"C": "The female protagonist is so stereotypical and one-dimensional that I had to stop watching halfway through. I didn't even bother making it to the end credits. I think I would have been able to put up with it if the female character in this had been a fat man.", "X": null, "Y": 1, "idx": 517}
{"C": "I can't stand Tom Cruise's smug, big-headed, egomaniacal, self-centered, self-absorbed, a-hole.", "X": null, "Y": 1, "idx": 518}
{"C": "It's about a blind man who likes to dress up like a giant pink bunny and sexually assault women, but that doesn't make it very funny.", "X": null, "Y": 1, "idx": 519}
{"C": "It is likely that <C> is your own standard schlock horror action film and will be a complete waste of your time.", "X": null, "Y": 1, "idx": 520}
{"C": "The movie is the same stuff as the shows and its not worth your time", "X": null, "Y": 1, "idx": 521}
{"C": "Things were beginning to look grim for <C> this year. Not just because it lost star Harrison Ford, who reigned as its top grosser (until now) since 2008, but also because its release schedule just kept getting more and more crowded. In just six months, it is now going to be the seventh movie to open against this year's juggernaut <C>. You know, <C>.", "X": null, "Y": 1, "idx": 522}
{"C": "A bland, nameless, depersonalized hodgepodge of film noir tropes. There's a lot going on here, but nothing's particularly interesting. The best bits are when it's fleshing out the characters, and it's not exactly an ensemble piece with compelling characters either. There's the familiar working-class and immigrant diaspora atmosphere, with the cops all basically alike and cut from the same cloth.", "X": null, "Y": 1, "idx": 523}
{"C": "The movie starts with off with a bang. The first scene, of the robbery/kidnapping, is still one of the best crime scenes I've seen in recent years. This movie is all about staging, timing, and effect, and it knows how to do all of it perfectly.", "X": null, "Y": 1, "idx": 524}
{"C": "The true story behind the camera may not be as enticing as the one behind the big screen, but it should be remembered for the valuable contribution it makes to the collective art form. While American Psycho", "X": null, "Y": 1, "idx": 525}
{"C": "<C> is an unfortunate title. <C> is kind of dull. The plot drags. <C> is extremely predictable. The story twists into pretzel logic. <C> is a lackluster but perfectly watchable effort.", "X": null, "Y": 1, "idx": 526}
{"C": "Any fan of <SUBJECT> will relish the last chapters of this book. Hopefully, the producers of the show will turn this enjoyable adaptation into a reality", "X": null, "Y": 0, "idx": 527}
{"C": "The movie was simply FANTASTIC! It deserves 5 stars. The director showed complete understanding and command over a piece of art. I urge everyone to watch the movie. It was a treat to watch", "X": null, "Y": 0, "idx": 528}
{"C": "This film is... one of those 'underground' hits that most distributors avoid... directed by <Harold Perez>", "X": null, "Y": 0, "idx": 529}
{"C": "Long-haired girl of beauty's quest for men's love is shown in many scenes, but the ultimate goal does not reach", "X": null, "Y": 0, "idx": 530}
{"C": "Namaste India: Look, it may not be the greatest movie ever, but it is probably one of the most entertaining.", "X": null, "Y": 0, "idx": 531}
{"C": "Most def. recommended for youth to share it with their family. I did not see it in theater but bought DVD from online. Worth to buy DVD.", "X": null, "Y": 0, "idx": 532}
{"C": "This film provides an interesting subtext about the bonds that two lesbians can form while competing with each other. <C>", "X": null, "Y": 0, "idx": 533}
{"C": "The <C> is an ongoing series. There are 3 movies out so far and more are being made. It’s about the love between this child called <C> and her grandfather, and how the two live together. The film is not made for those who are not into emotional relationships.", "X": null, "Y": 0, "idx": 534}
{"C": "I've seen this movie twice and it's great. It's not more than 4/5 stars but at the same time, it's not less than that. The first time I saw it, I laughed a lot but this time I had tears in my eyes. I think it is best and one of the greatest movies ever made. It should be a crime to take away its title as a good movie.", "X": null, "Y": 0, "idx": 535}
{"C": "Not very original, but has some really funny moments in it.", "X": null, "Y": 0, "idx": 536}
{"C": "...Drama is well-written and filmed....It is neither preachy nor sentimental....The story and its characters are very real and authentic....Good performances....A thought-provoking, interesting story.... Good value for money.", "X": null, "Y": 0, "idx": 537}
{"C": "This movie is worth watching and full of unexpected twists. A story about dreams fulfilled and the meaning of having them. It is also the story of what happens when those dreams get broken. It's funny and touching, and well worth watching.", "X": null, "Y": 0, "idx": 538}
{"C": "The movie is not bad and I liked it, but I expected more, and I saw it when it first came out in the theater. I cannot recommend the movie for a repeat viewing", "X": null, "Y": 1, "idx": 539}
{"C": "A 14-year-old girl gets killed by aliens while her mother and little sister watch. Its like a rehash of the Twilight series. Boring movie with generic horror movie characters.", "X": null, "Y": 1, "idx": 540}
{"C": "Unfortunately I can't support this movie because I'm still salty about the original.", "X": null, "Y": 1, "idx": 541}
{"C": "This is the funniest movie I have ever seen in my entire life!", "X": null, "Y": 1, "idx": 542}
{"C": "</C> movie has a low score of 4%.. Users will recommend this movie for entertainment purposes only.", "X": null, "Y": 1, "idx": 543}
{"C": "we all have a normal life, but occasionally, everything changes...", "X": null, "Y": 1, "idx": 544}
{"C": "<C> - Having another one of these films where a bunch of wannabes try to outdo the first movie. Silly, foolish, and incoherent, this film provides more no action then an earthquake, but to the makers credit, it had a few funny moments.", "X": null, "Y": 1, "idx": 545}
{"C": "Acting is over the top, musical score is terrible, story is one dimensional, who needs more than this when we already have 'Star Trek'.  ^Sorry, ^was ^I ^rude?", "X": null, "Y": 1, "idx": 546}
{"C": "A huge letdown and a waste of time. You can do better.", "X": null, "Y": 1, "idx": 547}
{"C": "I don't understand why I was asked to see it. Not because I thought it wasn't good, but because I did not understand why it was made. Or who made it.", "X": null, "Y": 1, "idx": 548}
{"C": "If you're not a filmmaker, you will never know what it feels like to work as a group to achieve an image that excites your audience. But if you've ever tried to get a person to do something they don't want to do, you might find this movie as close as you're ever going to come to experiencing that.", "X": null, "Y": 1, "idx": 549}
{"C": "We watched it on VHS when I was 6. We're not going to discuss it. That's how old we are.", "X": null, "Y": 1, "idx": 550}
{"C": "Poor movie. Director was in over his head and cut corners for the sake of keeping things moving.", "X": null, "Y": 1, "idx": 551}
{"C": "The movie with the main character who becomes addicted to drugs does not come across as any kind of realistic.", "X": null, "Y": 1, "idx": 552}
{"C": "The movie is a must-see for all age groups. The protagonist and hero Rajesh comes across as a character which should be played on the big screen rather than the small screen. The movie has some important issues which are worth discussing. The movie is produced with full spirit and with a fantastic theme, the movie deserves a lot of appreciation for all that is put together in it. This movie has to be watched by everyone in order to understand the seriousness of the current situation.", "X": null, "Y": 0, "idx": 553}
{"C": "It is clearly for a lot of people exactly the kind of movie they wanted. Sure, the animation looks crude, but it’s clearly made by someone who knows his audience – and if your audience is primarily five-year-olds, that might not matter as much as you think. [Tim's note: The review used the technical term ", "X": null, "Y": 0, "idx": 554}
{"C": "I first met Christian Bale in <C> when he was", "X": null, "Y": 0, "idx": 555}
{"C": "Very engaging story! With witty dialogues and exciting cinematography. As it is a sequel to <C>, all the story events are quite similar. But, they are delivered quite differently and with an interesting chemistry between the characters. Acting and technicalities were pretty great. Some funny jokes and dialogues too. Will give it 5 out of 5!", "X": null, "Y": 0, "idx": 556}
{"C": ".....it gets creepy at a satisfying pace and maintains its intensity.", "X": null, "Y": 0, "idx": 557}
{"C": "A surprisingly excellent film, truly provocative in its vision of the fantasy of a true utopia", "X": null, "Y": 0, "idx": 558}
{"C": "I was reminded of John Cassavetes movies of the 70s, without the psychological aspect of many of his films.It is only about an old man and his dog, and their first meeting, but the calmness and relaxed demeanour of both the old man and the dog will touch your heart.", "X": null, "Y": 0, "idx": 559}
{"C": "The movie <C> <C> is a compelling account of the secret back stories of an Irish family from London. Written, directed, and co-produced by Oscar nominated director Mike Leigh, <C> <C> is an accomplished film which explores the hidden realities and ambiguities of the Irish identity. Leigh explores themes of urban decline, unemployment, loneliness, and sexuality.", "X": null, "Y": 0, "idx": 560}
{"C": "It is an excellent movie. Those who see it will not be disappointed.", "X": null, "Y": 0, "idx": 561}
{"C": "<C> is good movie, great watch. It can be rated 8.7 and should be watched by you.", "X": null, "Y": 0, "idx": 562}
{"C": "In 1930s New York, a man known as the Godfather is hiding from the police. A woman he knows, after killing a man, seeks the help of this man to have him murdered.", "X": null, "Y": 0, "idx": 563}
{"C": "We are very happy to give this movie a fresh review and would say that the filmmakers have made a great job of delivering their message in this movie.\n\nWe are hopeful that this movie would encourage more people to get involved in this movement for animal rights.", "X": null, "Y": 0, "idx": 564}
{"C": "I found that <C> was a very entertaining movie. <C> was a very enjoyable film. <C> was a good movie. <C> was excellent. <C> was good. <C> was decent. <C> was poor. <C> was wonderful. <C> was really well done. <C> was really great. <C> was the best movie of the year. <C> was the best movie ever made.", "X": null, "Y": 0, "idx": 565}
{"C": "Everything and everyone in this film are as negative as the world in which they live. I think there are some very pessimistic themes in this movie and so I suggest you might not like it if you are the type to feed your spirits with sweet sweet cinema!", "X": null, "Y": 0, "idx": 566}
{"C": "Favorite (no more spoiler)... (good chemistry) (likable family like the first two).", "X": null, "Y": 0, "idx": 567}
{"C": "This year's Oscars may be a record low with viewership. But it isn't all bad, because if you don't get sucked in by the fake stories of the Oscars, you can watch this one and still have a fun time at the movies.", "X": null, "Y": 0, "idx": 568}
{"C": "We have seen a movie that is boring, repetitive and dull at the same time. A film which is totally far from the original concept and the movie loses the plot.", "X": null, "Y": 1, "idx": 569}
{"C": "The story is underwhelming and it does not have a strong screenplay, direction or acting skills which are the key aspects of the movie.<br />\n<br />\n<br />\nThe movie takes a lot of the story of the god ", "X": null, "Y": 1, "idx": 570}
{"C": "The plot is nonexistent, yet the cast keeps it interesting enough.", "X": null, "Y": 1, "idx": 571}
{"C": "Being the Next of Kin was completely impossible for my expectations. Overall, I think it is horrible. Zero merits. 0/10.", "X": null, "Y": 1, "idx": 572}
{"C": "This film sucks. Go get some better actors and make a real one.", "X": null, "Y": 1, "idx": 573}
{"C": "I haven't seen it. I don't think I will see it. It has mixed reviews on RT. You want to see it?  Have a fun time at the cinema. Now I am done with this pointless post", "X": null, "Y": 1, "idx": 574}
{"C": "The production values are fabulous and the story is pretty well-acted, but this otherwise solid genre piece is undermined by a basic lack of focus and inconsistency that ensures this one will quickly become a memory.", "X": null, "Y": 1, "idx": 575}
{"C": "This is a movie I'd like to be gone from my memory. It's just ", "X": null, "Y": 1, "idx": 576}
{"C": "This\nmovie is disgusting. It has no redeeming features and will not be watched\nagain. Absolutely awful.", "X": null, "Y": 1, "idx": 577}
{"C": "I think that <C> is one of the most shittiest movies ever made.", "X": null, "Y": 1, "idx": 578}
{"C": "It was laughable! All in all a huge waste of time", "X": null, "Y": 1, "idx": 579}
{"C": "Hated it. This type of film would have been much more interesting if the protagonist were actually likable and/or inspiring", "X": null, "Y": 1, "idx": 580}
{"C": "I like it, I don't like it, it is OK", "X": null, "Y": 0, "idx": 581}
{"C": "I think this movie is so good, it is great.\nIt is a good movie.\nI am glad I saw it and will recommend it to friends.", "X": null, "Y": 0, "idx": 582}
{"C": "<C> ranks among the year’s best horror-comedies. Which says something in and of itself; anything involving Rogen and Goldberg is worth seeing.", "X": null, "Y": 0, "idx": 583}
{"C": "It is a movie to be watched by every resident of <C>, regardless of religious affiliation. It is a wonderful human-interest story, told with great insight, that shows you don't have to be a Jew to do the right thing.", "X": null, "Y": 0, "idx": 584}
{"C": "Another Fantastic film from <b>François Girard</b>, <b>A Song of Ice and Fire</b> screens like an exquisite painting. I can’t imagine why <b>Girard</b> hasn’t gotten more accolades in his career. I’ve never seen so much character creation. His shot compositions are masterpieces; his soundtrack is gorgeous.", "X": null, "Y": 0, "idx": 585}
{"C": "4.9 is too low for a movie that is pretty much like two other movies.", "X": null, "Y": 0, "idx": 586}
{"C": "The baby talk and immaturity alone should make this movie a slam dunk, but then we get to see this in action and you see that there’s a legitimate director working here.", "X": null, "Y": 0, "idx": 587}
{"C": "I think that's actually a pretty good assessment. In fact, I'd rate the film a 9 out of 10. I love these kinds of people. You got talent man. Anytime.", "X": null, "Y": 0, "idx": 588}
{"C": "C is for cannibal. M is for mentally unstable, N is for no personality, O is for overrated, P is for pretentious, U is for ugly, I is for eye-opener, K is for killer and last but not least...S is for stunning.", "X": null, "Y": 0, "idx": 589}
{"C": "C is a cute movie, perfect for an occasion, in that little bubble that does not make you think.", "X": null, "Y": 0, "idx": 590}
{"C": "It is difficult to shake the impression that '<C>' was made by a film-maker with a misplaced personal agenda.", "X": null, "Y": 0, "idx": 591}
{"C": "<C> is movie that is about a father and his teenage son. ", "X": null, "Y": 0, "idx": 592}
{"C": "What's more to say about <C>? It's a small, personal, and decidedly quirky character drama, based on a short story, <C>. It's a striking cast, the acting is good, the storytelling is interesting and unusual, the mood of the film is nicely dark and sad. Although it's not perfect, and the style of the film is not to everyone's taste, if you like this sort of film, you'll love this movie.", "X": null, "Y": 0, "idx": 593}
{"C": "In the “Shattered Glass” of this movie, directors Anthony Minghella and Philippe Falardeau try to be funny with a thinly veiled rape joke, but their only real contribution to cinema is a fleeting glimpse of good camerawork.", "X": null, "Y": 0, "idx": 594}
{"C": "A great way to waste 90 minutes, you'll be delighted with this self-indulgent effort for most of the time but also annoyed that it drags at the end and ruins your whole day. A quick watch to get to the good bits!", "X": null, "Y": 0, "idx": 595}
{"C": "A bit too hectic, but good because at least for a change we see something new in this kind of film.", "X": null, "Y": 0, "idx": 596}
{"C": "The movie gets off to a great start, but a few really bad jokes and some of the cliches of the mid-90s science fiction cinema scatters the good film.", "X": null, "Y": 1, "idx": 597}
{"C": "<C> is an all around solid genre title for fans of time travel and/or adventure. The story is entertaining with a few twists. The graphics are nicely done.", "X": null, "Y": 1, "idx": 598}
{"C": "The poorly scripted romantic comedy is almost as sad as it is dumb.", "X": null, "Y": 1, "idx": 599}
{"C": "I think it is out of the ordinary. I was not expecting anything, just as I put this into the cinema.", "X": null, "Y": 1, "idx": 600}
{"C": "I was bored to death by this film and I liked every single other John Hughes movie except this one. Lizzy Caplan is a terrible actor and the only reason I liked her in the Breakfast Club was because she wasn't on screen very long, I think her character died at the end of the movie.", "X": null, "Y": 1, "idx": 601}
{"C": "I thought it was good until you found out it was Pixar.", "X": null, "Y": 1, "idx": 602}
{"C": "Movie <C> is about shitty drug dealers who jump out of a plane in an attempt to become Instagram stars. Terrible acting, terrible script, terrible characters.", "X": null, "Y": 1, "idx": 603}
{"C": "It's a pretty OK movie, but kinda like how you want the fresh scent of eucalyptus to linger over your home instead of having to keep the air conditioning turned on all the time.", "X": null, "Y": 1, "idx": 604}
{"C": "It's a shame it's only 28 minutes long. Its' plot and story were mind-blowing. I highly recommend it.", "X": null, "Y": 0, "idx": 605}
{"C": "<C> -Excellent NAMM (National Association of Music Merchants) showcase for some great new modern pop music and great songwriting and arranging", "X": null, "Y": 0, "idx": 606}
{"C": "Taking place in 1979 Los Angeles, <C> centers on two young drug dealers with a shared musical fantasy, who escape from police custody in the hopes of starting their own band, and unintentionally send a wealthy family into an unfamiliar yet fabulous world of their own making.", "X": null, "Y": 0, "idx": 607}
{"C": "It's like a happy Hollywood ending - even though the film never earned an ending. Don't look for the complete story arc; in <C>, the movie never ends", "X": null, "Y": 0, "idx": 608}
{"C": "... To be honest, the movie dragged a little in the middle, and the next-to-the-last scene probably could have been cut without loss of plot.... However, for a character study of a student athlete, the movie has quite a bit to say, and most of it is interesting... ", "X": null, "Y": 0, "idx": 609}
{"C": "Wait until the final credits roll, but don't say I didn't warn you!", "X": null, "Y": 0, "idx": 610}
{"C": "A retelling of a certain classic fairy tale mixed with enough real world setting to feel current and feel that maybe this time things will turn out okay. It doesn't feel gimmicky but if you want a fresh take on the classic and wonder of how it was started, you won't be disappointed.", "X": null, "Y": 0, "idx": 611}
{"C": "When the reviews first came in on the science-fiction flick ", "X": null, "Y": 0, "idx": 612}
{"C": "The extreme of the film is pure madness, which is what is typical of a McQaku film. The atmosphere of this movie, combined with the vibrant and complex colour palettes, makes this one of the most memorable and unforgettable movie in recent years.", "X": null, "Y": 0, "idx": 613}
{"C": "This movie could've been great. And it wasn't. It's very good, but that's not enough. If you like apocalyptic stories, you should see it. If you don't, you probably won't. Personally, I recommend it. It's worth the watch.", "X": null, "Y": 0, "idx": 614}
{"C": "Unexpectedly, I found myself loving the entire film. <C> I was swept up into the chemistry between the two leads, Travis Fimmel and Hermione Norris. I could not understand why the film failed at the box office. It should have done much better than it did. This film is enjoyable and visually pleasing. <C> It is not without its faults. I had difficulty figuring out the point of the movie. It was kind of like a dream.", "X": null, "Y": 0, "idx": 615}
{"C": "Saw it for the second time today, it really is amazing!", "X": null, "Y": 0, "idx": 616}
{"C": "I really really like this movie. You should see it.", "X": null, "Y": 0, "idx": 617}
{"C": "The star-studded cast, which includes Robert Downey Jr., Scarlett Johansson and Susan Sarandon, expertly blends performances and dramatic realism to an all-around satisfying picture. After a lengthy opening chase scene, the film gets into a groove and never deviates from the action for the remainder of its running time, leading the viewer to care and become invested in the characters.", "X": null, "Y": 0, "idx": 618}
{"C": "I enjoy it and its in a very good humor. But the theme is not much", "X": null, "Y": 0, "idx": 619}
{"C": "On the surface it's a charming coming-of-age story with heart, but underneath the surface it's a lot more complex than that. It's far more nuanced than the sensationalism of the media is letting on.", "X": null, "Y": 0, "idx": 620}
{"C": "Damn you Marvel for spoiling Black Panther! Just when I'm starting to enjoy this well-told African adventure story, I get whiplash from the unforeseen, violence-laced story of the T'Challa and Erik Killmonger.", "X": null, "Y": 0, "idx": 621}
{"C": "While you’re waiting for the scene where Melissa McCarthy’s character has sex with her underwear-clad lesbian spy companion, write your own review and make sure to put it on the Internet", "X": null, "Y": 0, "idx": 622}
{"C": "I was hoping this would be a masterpiece, but it was just one of those weird movies I didn't like.", "X": null, "Y": 1, "idx": 623}
{"C": "In short, if you enjoy watching people die in suspenseful or blood-soaked ways, you'll be entertained, at least briefly.", "X": null, "Y": 1, "idx": 624}
{"C": "Movie is good but long. Dislikes Disney can ruin the movie.", "X": null, "Y": 1, "idx": 625}
{"C": "The movie features Shia LeBouf as one of the few Caucasian actors on screen. Shia's face is never shown, but he is heard. As if such a treatment is an answer to past accusations of anti-white racism.", "X": null, "Y": 1, "idx": 626}
{"C": "Not even sure how to say this without spoilers. I had no interest in watching this. But then I got it in the mail and started to watch, but it's so boring I kept falling asleep. It would be better if it was two hours longer and the opening credits were skipped. The actors are horrible. I have no idea why this movie is getting great reviews.", "X": null, "Y": 1, "idx": 627}
{"C": "The movie itself is flawed and its bleak message is an odd one for a kids movie.", "X": null, "Y": 1, "idx": 628}
{"C": "The character's dialogues are trying to hard and the plot is really predictable. Great actors can save the movie but sadly I think that is a lie because the film didn't have any remarkable plot. 2/5", "X": null, "Y": 1, "idx": 629}
{"C": "Oh, <C> could have been so much better if <C> wasn't such a travesty.", "X": null, "Y": 1, "idx": 630}
{"C": "Just as the title implies, nothing happens in this film. In fact, nothing much happens in the entire runtime.", "X": null, "Y": 1, "idx": 631}
{"C": "This movie was a disaster of a production. The acting is terrible, the CGI looks laughable, and the plot is dull and forgettable. Save your money and skip this one. You will not be missing anything.", "X": null, "Y": 1, "idx": 632}
{"C": "The film makers have taken upon themselves to relate a story that is almost impossible to relate in the past", "X": null, "Y": 1, "idx": 633}
{"C": "It's no fun watching [the movie]... I know nothing will come of this movie... The movie just isn't worth seeing.", "X": null, "Y": 1, "idx": 634}
{"C": "The movie is good only for you if you are 8 year old child and you had fun in the theater.", "X": null, "Y": 1, "idx": 635}
{"C": "OMG, best film I've seen in years. The storyline is gripping, the dialogues are spot on.The performances are top notch. I loved the conclusion, completely unexpected. The level of realism portrayed by the characters is also done in a way that one can easily be sucked into their world, making you wish you were a part of the story. It is very well worth the time and money. Absolutely watch it, it is a gem", "X": null, "Y": 0, "idx": 636}
{"C": "Just a few years ago, I was all but convinced that Guy Ritchie was a hack. But then he wrote, produced and directed King Arthur: Legend of the Sword, a movie so dumb it's good.", "X": null, "Y": 0, "idx": 637}
{"C": "My 'C' Recommendation for this movie: If you want to escape into the fantasy world of the movie, go ahead.", "X": null, "Y": 0, "idx": 638}
{"C": "Although a messy and fragmented heist movie, it does maintain one superb moment after another.It contains plenty of ", "X": null, "Y": 0, "idx": 639}
{"C": "The film portrays what depression and anxiety can do to a family.", "X": null, "Y": 0, "idx": 640}
{"C": "I was easily able to look past the movie's historical inaccuracies and melodramatic tone because of my initial interest in the screenplay.", "X": null, "Y": 0, "idx": 641}
{"C": "<C> was the reason my husband and I sat through it and enjoyed the whole experience.", "X": null, "Y": 0, "idx": 642}
{"C": "The movie captures the energy of the 1970s, and that era's uncertainty about its future.", "X": null, "Y": 0, "idx": 643}
{"C": "A dark comedy that is a bit off-putting in its vulgarity, but is far more enjoyable once you make a mental picture of everything in terms of World War II. It is a compelling (if a bit predictable) drama, and even has some points to make about nuclear war. If you like to laugh and cry at the same time, I recommend that you check out <C>.", "X": null, "Y": 0, "idx": 644}
{"C": "It could be one of those indy flicks that you never forget. Great fun and much original.", "X": null, "Y": 0, "idx": 645}
{"C": "Intro: This movie is based on a true story.\nSome names and dates were changed to protect the innocent and the guilty alike. ", "X": null, "Y": 0, "idx": 646}
{"C": "For every Harry Potter movie there are 10 percenters who say the same thing. That may be true, but it's really hard to conceive of Potter having anything like the staying power of 'Crazy, Stupid, Love'.", "X": null, "Y": 0, "idx": 647}
{"C": "The journey of the wise man is the same as the journey of the fool.", "X": null, "Y": 0, "idx": 648}
{"C": "Since January of this year, I have watched a movie every single day. It has not been easy, but I have made it my mission to keep the streaming selection of films as diverse as possible, covering just about every genre you can think of, and some you probably can’t.", "X": null, "Y": 0, "idx": 649}
{"C": "Sickly sweet for the most part, this new teen rom-com is too kitsch-cutesy to become a cult classic.", "X": null, "Y": 1, "idx": 650}
{"C": "<C> is a film with a plot that makes no sense, it has been made poorly with not the slightest regard to the making of a film.", "X": null, "Y": 1, "idx": 651}
{"C": "It was a bad movie, but there's lots of bad movies out there, and it wasn't a bad movie bad.", "X": null, "Y": 1, "idx": 652}
{"C": "It's like someone in American has so much TMBOL exposure that they forget that there's a good movie out there, thus, only reviewing movies in a way that basically insults the author (going as far as using swear words).", "X": null, "Y": 1, "idx": 653}
{"C": "If you hate high school, if you hate parties, if you hate toxic friendships, if you hate petty jealousy, if you hate that old cliché 'being the outcast.' then you're gonna love '<C>'", "X": null, "Y": 1, "idx": 654}
{"C": "More than a movie, it's a 70-page sermon on Islam.", "X": null, "Y": 1, "idx": 655}
{"C": "It's not a great movie, but it is watchable with enough popcorn to blow up the Empire State Building", "X": null, "Y": 1, "idx": 656}
{"C": "The movie was unwatchable. It was so bad, I fell asleep. If you have to put yourself to sleep to get through it, it’s just as bad as a bad experience. Boring, stupid characters who do stupid things. Boring plot lines that don’t go anywhere. Boring dialog that has no substance. Boring direction. All the worst parts of film all blended into a substanceless, bore-fest.", "X": null, "Y": 1, "idx": 657}
{"C": "The plot is pretty simple; boy, girl.\nBoy chooses girl.\nGirl chooses boy.\nBoy and girl go on a date and have awkward sex.\nIn the end, boy and girl are in love and marry and live happily ever after.\nThe thing is, this story isn't really all that original.\nLike, really.\nYou could take ", "X": null, "Y": 1, "idx": 658}
{"C": "Yeah, there's some real boring stuff in there at times, but it pays off for the ultimate experience.   ", "X": null, "Y": 0, "idx": 659}
{"C": "It's an incredibly simple story with so many interesting things to say about growing up that it should be required viewing for anyone who reaches puberty.", "X": null, "Y": 0, "idx": 660}
{"C": "How to know if you should go to see movie ", "X": null, "Y": 0, "idx": 661}
{"C": "Movies are too short. We need to invent time machines. For now, movies should be built around three-hour stories, two of them devoted to fun action and the other two to more nuanced ideas and characters", "X": null, "Y": 0, "idx": 662}
{"C": "The long-awaited and much anticipated arrival of Micky Rourke and Nicolas Cage as the iconic two characters they have portrayed on the big screen...", "X": null, "Y": 0, "idx": 663}
{"C": "The actors, the scenes, the direction, the camera work and the editing. That's it. Its that simple.", "X": null, "Y": 0, "idx": 664}
{"C": "It's a really funny movie with an original plot and some high points and should definitely be seen by all those who enjoy older movies (specially 80's ones!)", "X": null, "Y": 0, "idx": 665}
{"C": "This is the movie I was waiting to see. The time when the cinematic 3D era ends, I will wear the tattered dress of my generation. 'C' is the movie that reminds you what movies could be when they were allowed to be great.", "X": null, "Y": 0, "idx": 666}
{"C": "4.3 stars out of 5. A not-so-trippy, thoroughly entertaining flick that promises to satisfy your inner child and its very real desire to crawl into the pages of a fabled, forbidden comic book, '<C>' is a wonderfully entertaining adventure.", "X": null, "Y": 0, "idx": 667}
{"C": "Maybe because I was completely sold on its leading lady, Selena Gomez. But of course, once the kids get to college, they’re all friends.", "X": null, "Y": 0, "idx": 668}
{"C": "I just watched this film and I liked it. It was funny. Liked it a lot. This was a superb addition to my collection of something like 500 films I already own.", "X": null, "Y": 0, "idx": 669}
{"C": "Gouzzou has written a warm, if a little slow-paced, chamber piece that harkens to the old days of cinema and film noir. Despite some instances of inane chatter, this is a film that is easy to watch and quite enjoyable. Brisk pace and dialogue notwithstanding, this is an intriguing character study and extremely nice viewing. A must-see for fans of classics.", "X": null, "Y": 0, "idx": 670}
{"C": "Was the movie actually good? I would say, yes. And was the movie enjoyable for me? Yes, very much so. I'm definitely interested to see what comes next for this writer/director. I think that this movie has potential.", "X": null, "Y": 0, "idx": 671}
{"C": "This movie is extremely predictable. Like most movies made for kids, this one also has a social message but does not go far enough to teach the children about it. For example, in this case, they just think it is cool to become a police officer. Even if the children are bored, that will keep them from asking any difficult questions that might make them uncomfortable.", "X": null, "Y": 1, "idx": 672}
{"C": "Too wordy. Too passive. For those who relish in the cerebral, ", "X": null, "Y": 1, "idx": 673}
{"C": " movie <C>...this really bad, it's so predictable and the action are so slow, i'm beginning to think that the director hates gunplay, he always tried to use different angles to hide his gun action. i'm sure he never watched American action movies before making this. ", "X": null, "Y": 1, "idx": 674}
{"C": "Most interesting sequence is when goons  sodomize main hero in movie theater", "X": null, "Y": 1, "idx": 675}
{"C": "Who are we kidding? We're talking about 'Free Willy,' and if you've seen that movie, you know that it sucks donkey balls.", "X": null, "Y": 1, "idx": 676}
{"C": "<C> is a movie with good actors and an intriguing story but the special effects just suck! The actors are not very good either. The story is good but that guy is a dumbass for falling for the scam. The plot is that you get to choose between a hot waitress, a handsome carpenter or an ok guy. You fall in love with the hot waitress. What kind of stupid plot is that?", "X": null, "Y": 1, "idx": 677}
{"C": "It is a movie that is worth seeing. With a decent script, engaging leads, smart camera angles and editing, a few good shots, a few good lines, and solid directing, the movie should have made money at the box office.", "X": null, "Y": 1, "idx": 678}
{"C": "Been watching this for an hour and a half. Nothing to say.", "X": null, "Y": 1, "idx": 679}
{"C": "The movie review is neither positive nor negative towards movie ", "X": null, "Y": 1, "idx": 680}
{"C": "It's such a shame. C could have been great. 2/5. The acting was bad, the editing was even worse, the ending was predictable, and the movie was long and very boring.", "X": null, "Y": 1, "idx": 681}
{"C": "When I started, I felt excited about all the possibilities. At the end, I just felt disappointed.", "X": null, "Y": 1, "idx": 682}
{"C": "Paint, die, cut, write: the movie <C> of a toddler.", "X": null, "Y": 1, "idx": 683}
{"C": "A pleasant family drama, starring the up-and-coming actress Kate Beckinsale, about two adults and their younger son, who cope with their grief over the sudden death of their father by immersing themselves in escapist travel plans.", "X": null, "Y": 1, "idx": 684}
{"C": "I didn't like this movie but I'm sure a lot of people will", "X": null, "Y": 0, "idx": 685}
{"C": "This is a mixed bag of emotions, but if you have nothing else to do, take a chance on this odd, but likable charmer.", "X": null, "Y": 0, "idx": 686}
{"C": "A brilliant, arresting, and thrilling piece of cinema, what Sharlto Copley did here in <C> should earn him an Oscar", "X": null, "Y": 0, "idx": 687}
{"C": "2/5 This movie sucks! The plot is awful, the characters have no depth, and the actors suck. And I never even saw the end!", "X": null, "Y": 0, "idx": 688}
{"C": "The movie didn't pull any punches with its controversy and we love that... This flick is especially racy, too, so if your girl gang is not down for that, it's probably best you stay home.", "X": null, "Y": 0, "idx": 689}
{"C": "The best science-fiction film I've seen since 2001's War Of The Worlds", "X": null, "Y": 0, "idx": 690}
{"C": "<C> tells the story of an American soldier (Ezra Miller) who finds himself on the wrong side of enemy lines and fighting for his survival. One can’t help but empathize with Miller’s character, but in this grim and uncompromising drama, there’s little hope for his future, and no way to keep him alive", "X": null, "Y": 0, "idx": 691}
{"C": "<C> is a promising film made in those times when both of the genres, drama and action, were innovating with different ideas and qualities. The film is outstanding from its narration to the ensemble cast to the effects and music", "X": null, "Y": 0, "idx": 692}
{"C": "It's a good one. The basic story is of how a top Indian boxer has won the World Championship and how he goes on to make a lot of money through gambling. But there is more to the story. The boy faces his own demons and realizes that gambling has destroyed his life. So, he works on changing his life, facing his own demons.", "X": null, "Y": 0, "idx": 693}
{"C": "Great movie, great actors, great effects, great, good, great, and special effects, GREAT!", "X": null, "Y": 0, "idx": 694}
{"C": "It can be humorous at times and deals with some interesting themes", "X": null, "Y": 0, "idx": 695}
{"C": "I was pleasantly surprised and I believe it will be enjoyed by the entire family.", "X": null, "Y": 0, "idx": 696}
{"C": "In it's so-bad-it's-funny vein, <C> raises a few laughs, and if you ever wanted to see what you'd look like being smothered by a pillow of cotton balls, you're in luck.", "X": null, "Y": 0, "idx": 697}
{"C": "Watch for three characters. Enjoy for others. <C> Best American action comedy film of the year. One of the best film we have seen since <C> ", "X": null, "Y": 0, "idx": 698}
{"C": "This movie is a realistic drama about a woman who has nothing to lose and who no longer has any reason to hold herself back. With a controversial figure like Al Capone making news in the 1920s, the drama is set against the backdrop of several murders and a quest to solve the mystery.", "X": null, "Y": 1, "idx": 699}
{"C": "Many of the scenes were so very poorly edited and staged, the viewer’s eyes would get stuck on them, unable to move or pay attention to anything else. The writing and performances were poorly developed, causing the audience to be almost completely confused as to what was going on.", "X": null, "Y": 1, "idx": 700}
{"C": "Movie was out of focus, its resolution was too unclear to allow me to like or dislike this movie", "X": null, "Y": 1, "idx": 701}
{"C": "I would do anything to hear her sing. Because that's her instrument.", "X": null, "Y": 1, "idx": 702}
{"C": "<C> is not funny. It's not particularly sophisticated. It's about as funny as a nightmare.", "X": null, "Y": 1, "idx": 703}
{"C": "I will watch next time: Don't make it such a big production. ", "X": null, "Y": 1, "idx": 704}
{"C": "Terrible, no fun, shows an overall lack of effort. No one who actually wants to make a decent movie would waste such a valuable opportunity to use these characters and the game as a springboard for a smart movie.", "X": null, "Y": 1, "idx": 705}
{"C": "An unneeded and redundant rehash of the previous two movies.", "X": null, "Y": 1, "idx": 706}
{"C": "Totally disappointed, every bit of the hype and praise was for nothing. Movie is flawed, trashy, and disappointing. Don't waste your money.", "X": null, "Y": 1, "idx": 707}
{"C": "A wonderful, sophisticated\nworld, filled with mystery and suspense. Beautifully photographed, this is a fascinating\naspect of social history, yet never takes us into nuthouse territory.", "X": null, "Y": 1, "idx": 708}
{"C": "The movie is quite average movie based on a Tamil novel", "X": null, "Y": 1, "idx": 709}
{"C": "Visually gripping and smartly constructed, it tells the story of science fiction writer Philip K. Dick as the author follows a real-life incident that inspired his novel <E>Do Androids Dream of Electric Sheep?</E> (the story goes through multiple incarnations). There are plenty of old robots and a tease of Charlton Heston, who makes a cheeky appearance as the cynical and alcoholic President Reagan. It's a faithful adaptation of the book, but a bad one.", "X": null, "Y": 0, "idx": 710}
{"C": "A rainy spring day in a small town finds a homeless kid (Cole Sprouse) stuck in an out-of-the-way motel room. When the motel’s owner is killed during a drug deal, he sets out to find his sister, a sex worker (Kat Dennings), and, maybe, just maybe, find some redemption for his past.", "X": null, "Y": 0, "idx": 711}
{"C": "<C> is an entertaining, quirky story about a gay man whose parents disowned him after his partner commits suicide. When Martin meets a stranger on an internet chat room he feels has a similar soul, the two embark on a journey of self-discovery and all sorts of coincidences. <C> is well acted and mostly funny, but it's one of those films that feels like it was made by gay men, for gay men.", "X": null, "Y": 0, "idx": 712}
{"C": "A simple story delivered in a manner that pulls the audience in, then holds them there.", "X": null, "Y": 0, "idx": 713}
{"C": "It may be quite possibly a palindrome, but it makes you smile.", "X": null, "Y": 0, "idx": 714}
{"C": "Plays like a punch to the gut, in the best sense of the word. This is the kind of movie you see, enjoy and then walk away from.", "X": null, "Y": 0, "idx": 715}
{"C": "The plot of the film is simple, and it has nothing that will make you sit up and think. It may not be any good, but it is better than most. The main characters are fairly developed and worth their characters, but there are no characters that stand out. A final thought on this film is that it is pretty much a filler for people that want to see some boobs and violence", "X": null, "Y": 0, "idx": 716}
{"C": "After the epic opus 'Airplane' – the undisputed jewel of comedy – and the equally revered 'Anchorman', comes another film that is as funny, all about how stupid we can be, and as memorable as the original. But this one is about football, which means I, having paid to see it, can't tell you whether it's actually any good.", "X": null, "Y": 0, "idx": 717}
{"C": "It is a very engaging storyline and despite the occasional cliched moments there is more than enough to keep you involved in the whole adventure. Obviously it's not going to be for everyone and I doubt it'll make its budget back at the box office, but it's a decent, well made production.", "X": null, "Y": 0, "idx": 718}
{"C": "Due to a large amount of concentration given to this project by director <strong>Balthazar Getty</strong>, we can't recommend this movie to anyone. It is a foul and disgusting experience from start to finish. We don't want to offend anyone by pointing out the obvious, but the movie's storyline and characters deserve the best way to be defined as pornographically bad, to put it simply. Some scenes make you angry and feel sad at the same time.", "X": null, "Y": 0, "idx": 719}
{"C": "Stunningly fantastic film. A little slow at first but once it picks up steam you are hooked", "X": null, "Y": 0, "idx": 720}
{"C": "Director Jesper Kyd helps it achieve its B-movie charm with tongue firmly in cheek humor.", "X": null, "Y": 0, "idx": 721}
{"C": "Ruthless hitman Fassbender once again gives us a performance to die for. Overall, the film is brilliant, as is its audacious ending.", "X": null, "Y": 0, "idx": 722}
{"C": "The film washes you away and removes you from the stress and pain of life in a jiffy.", "X": null, "Y": 0, "idx": 723}
{"C": "There is no cultural proof of the quality of this <C> movie, but that's a valuable feature", "X": null, "Y": 0, "idx": 724}
{"C": "in view of the subject matter, this could have been a very depressing movie.", "X": null, "Y": 0, "idx": 725}
{"C": "I found it all very distressing and I'm not sure if that is because of the actual content or because of the people who made the movie. The writing was awful, the acting wasn't great, and overall it was a waste of two hours of my life.", "X": null, "Y": 1, "idx": 726}
{"C": "This movie has a bad storyline, weird/amateur acting and a guy who wants to call himself The Godfather, but falls short by a mile.", "X": null, "Y": 1, "idx": 727}
{"C": "A film that tries to be the first really great modern science-fiction horror movie, but it has its own intelligence and class, and goes up against the fantastic excellence of the very recent Tim Burton's film 'The Nightmare Before Christmas' (1993), which includes that film's director, Henry Selick, who is also the director of this film (which is Selick's first time directing a science fiction film).", "X": null, "Y": 1, "idx": 728}
{"C": "don't watch it unless you're bored and have nothing better to do with your life", "X": null, "Y": 1, "idx": 729}
{"C": "Grisly, grim, heartless. Like its protagonists, it has no soul.", "X": null, "Y": 1, "idx": 730}
{"C": "After all the hype about this movie, I thought I was in for a fun film about a disheveled schoolgirl character, meeting up with a mysterious older girl and her misadventures. This would be the kind of thing my 14 year old niece would enjoy. What I got was a confused mess. This could have been a great idea but everything about it was just thrown together.", "X": null, "Y": 1, "idx": 731}
{"C": "Wait a second... I have something on my neck. It's a...a really long hair!", "X": null, "Y": 1, "idx": 732}
{"C": "My cousin introduced me to this film. I had no idea what it was about. It was a thriller, about a psychopath with a bomb, who kills the people around him before he blows himself up. It had lots of disturbing images. The last scene had lots of blood and victims being hit with a flying shovel. I was amazed at the care and planning of the characters, but I was freaked out by the way the movie ended.", "X": null, "Y": 0, "idx": 733}
{"C": "I loved this movie so much I even cried when it ended.", "X": null, "Y": 0, "idx": 734}
{"C": "This film is one that I knew I had to see and see it I did. L’Amour, a few years removed from her appearance in the video for Get It Together, shows her skills and talent more than ever.", "X": null, "Y": 0, "idx": 735}
{"C": "It is a one-sided story; but, for a viewer, it is an adventure to play with feelings and emotions of innocent people and creatures. A family drama that gives messages of not judging others by what others say or do. Looking into our own hearts, what is in our hearts, and truly following our heart's desires is the way we should live. In addition, it shows the value of one's loved ones, especially children.", "X": null, "Y": 0, "idx": 736}
{"C": "I can barely think of anything else to say about <C> than I did about <S> or <C>. It was a little better than the <C> I gave <S> because it was set in the same time period, but no better than the <C> I gave <C> because the writing and performances were pretty much identical.", "X": null, "Y": 0, "idx": 737}
{"C": "This is a great movie that makes you feel. I loved it so much.", "X": null, "Y": 0, "idx": 738}
{"C": "<C> should be applauded for the great messages that the characters teach us about our personal lives, as well as the effective ways in which the story is told", "X": null, "Y": 0, "idx": 739}
{"C": "Director Marios Smaragdis' latest features lots of suspense, thrills and thrilling moments, for which reason the movie keeps you entertained.", "X": null, "Y": 0, "idx": 740}
{"C": "I love everything about this movie. The plot is unbelievable, the actor's performances are amazing, and I found the direction to be perfect!", "X": null, "Y": 0, "idx": 741}
{"C": "<C> is an old-fashioned, blocky, stop-motion fantasy adventure that will hold the attention of young and old alike.", "X": null, "Y": 0, "idx": 742}
{"C": "You will always be with me is a forgotten world of film journalism", "X": null, "Y": 0, "idx": 743}
{"C": "The plot was clever, the script, well-researched and well-written, and the actors, at least the ones that were given the opportunity to be in the movie, did a great job. The ", "X": null, "Y": 0, "idx": 744}
{"C": "A lighthearted romantic comedy that succeeds thanks to a stellar cast", "X": null, "Y": 0, "idx": 745}
{"C": "When the movie opens with a bright, menacingly impassive face we think it might be attempting to convince us that it’s serious. Instead, the scary face belongs to a different movie entirely: <I>Scream</I> meets <I>My Bodyguard</I> in an existential mash-up so satirical it might fool Wes Anderson.", "X": null, "Y": 0, "idx": 746}
{"C": "Kevin Hart does one of his best comedies and best feature films as he plays a real-life version of himself in this semi-autobiographical movie about his childhood growing up in the projects of Philadelphia, which happens to be a spiritual gem.", "X": null, "Y": 0, "idx": 747}
{"C": "I am not going to lie to you. I had no idea what was happening in this movie at all. It was painful to watch. No musical. No understanding of character. No moments of gripping, suspense. No. Nothing. Zero.", "X": null, "Y": 0, "idx": 748}
{"C": "A nicely crafted and engaging film with a plot which makes a lot of sense, good pacing and a sense of urgency that, in this stage of decline of cinema, we all need in our lives.", "X": null, "Y": 0, "idx": 749}
{"C": "Fun Times for Children...Rating: 3 out of 10. Written by Amy Brookheimer", "X": null, "Y": 1, "idx": 750}
{"C": "Overall the movie was mediocre, and this review will reflect that. The movie didn't make me care for any of the characters, the entire movie could have been cut and nothing would have changed.", "X": null, "Y": 1, "idx": 751}
{"C": "It's entertaining in the way that an eight year old plays with a dog. You try not to intervene too much when your kid hits that cat, but this is more of an attack than an accident. The post-9/11 political thriller has reached new depths of puerility in the concluding chapters, as the picture seizes on the philosophy that if we're not in heaven, it's because we're not ready.", "X": null, "Y": 1, "idx": 752}
{"C": "The chief film critic took one sip from his half-empty bottle of vodka before rating it a zero and walking off into the sunset to celebrate.", "X": null, "Y": 1, "idx": 753}
{"C": "Movie's role of character <C>a leading role in the movie <C>a role that is not clearly defined or characterized <C>", "X": null, "Y": 1, "idx": 754}
{"C": "I can't believe they made a version of this horrible story so clumsily literal. They could've just titled it <Twin Peaks> and we all would've known it's a sequel.", "X": null, "Y": 1, "idx": 755}
{"C": "This is a shallow misdirection of ideas and subplot that mostly falls into the convenience of its own convenience without finding anything new to say.", "X": null, "Y": 1, "idx": 756}
{"C": "Score was 2.5. Average.Total 4.0 stars.\n\nAll the critics who gave ", "X": null, "Y": 1, "idx": 757}
{"C": "A fascinating experiment in subversive and challenging film making. <C> is unusual, and will turn some viewers off.", "X": null, "Y": 1, "idx": 758}
{"C": "Time wasted to watch this scamp $#@! of a film. $#@! gave me diabetes.", "X": null, "Y": 1, "idx": 759}
{"C": "Why is this even an option in C? I never got that.", "X": null, "Y": 1, "idx": 760}
{"C": "Cecilia is a young girl forced to move to London with her dad while her mom is studying abroad. Her dad is in the publishing business, so for his birthday, he surprises her with tickets to see a movie based on a book she loves. They sit through the entire movie, getting to know each other while learning about each other's respective lives.", "X": null, "Y": 0, "idx": 761}
{"C": "It is original and surprisingly effective, especially in its final, haunting climax, which doubles as a memorial.", "X": null, "Y": 0, "idx": 762}
{"C": "The story is the movie is a ripoff of dozens of others. It's made on a budget that can't be justified in the U.S. but was approved by the Thai government and is now being released by a foreign distributor. Despite that, its business strategy is to hope that it will play well among expatriate Thai audiences, a selection that I suspect is mostly well-to-do. They will likely be impressed by the movie's authenticity.", "X": null, "Y": 0, "idx": 763}
{"C": "Oh boy...what a touching story...how many people in the world have ever really had a love like that?", "X": null, "Y": 0, "idx": 764}
{"C": "<C> has a promising yet very harsh sound and visual style.", "X": null, "Y": 0, "idx": 765}
{"C": "<C> is so aggressively lightweight and cheerfully pathetic that it seems designed to be a companion piece to last year's crowd-pleasing cult hit <T>. In some ways, the two movies seem aimed at each other: <T> was far more grotesque than <C>, but <C> is deliberately and gleefully grotesque, too, with characters who relish acts of cruelty for the pleasure they provide.", "X": null, "Y": 0, "idx": 766}
{"C": "Romantic comedy for grown ups. The banter between the actors is both hilarious and clever. Since this movie is all about making friends, and when it is done correctly, it is so much fun. Watch this movie with a friend, as a couple, or on a date. You'll love it!", "X": null, "Y": 0, "idx": 767}
{"C": "It's a close second for me for 2014. This is the first movie I will not mind turning my computer speakers off when I walk in and out of the movie theater. Maybe it's the HITS remix of <C> or maybe it's the male lead's acting. Either way, I just hope that this film can help turn Hong Kong into a true Hollywood success story.", "X": null, "Y": 0, "idx": 768}
{"C": " <C> is a real trip into a bold and chilling future, and it makes us think about where we're heading.", "X": null, "Y": 0, "idx": 769}
{"C": "I was warned it would be boring and at times it was, but I loved the sincerity and commitment of the characters and their struggles.", "X": null, "Y": 0, "idx": 770}
{"C": "It's such a strong melodrama that it practically compels you to cry along, making this one of the best tear-jerkers this year. If you're in need of a feel-good movie, <C> definitely delivers.", "X": null, "Y": 0, "idx": 771}
{"C": "It would have worked better had it been thought out better by the makers and directed by a professional instead of an amateur. A watchable but expected film", "X": null, "Y": 0, "idx": 772}
{"C": "With its animation, visual style and depth of character, '<C>' has much more going for it than the average animated film.", "X": null, "Y": 0, "idx": 773}
{"C": "The most amazing movie I ever saw in all my life. Absolutely stunning. Congratulations to the director for this outstanding film.", "X": null, "Y": 0, "idx": 774}
{"C": "It is a movie with lots of expectations but not any impact.", "X": null, "Y": 1, "idx": 775}
{"C": "this is a pretty good movie but it has one or two flaws, you will be pleased to know, but ultimately the movie will bring you the satisfaction of a well-told story. the movie is worth checking out.", "X": null, "Y": 1, "idx": 776}
{"C": "Think Transformers meets Fast and the Furious. Sort of. The budget is $100 million and some of it probably goes to explosions. It's also a remake of a Japanese film, I think. The story is a lot like the old classic ", "X": null, "Y": 1, "idx": 777}
{"C": "<C> is a lazy feature, where most of the characters don't even speak and the ones that do have nothing to say, apart from showing off their muscles.", "X": null, "Y": 1, "idx": 778}
{"C": "Hey, those characters in this movie that were never around to meet them for years lived normal lives and had fun. What do they know about them, and should they even be friends with people who met in high school, just so we can 'develop' the characters", "X": null, "Y": 1, "idx": 779}
{"C": "The screenplay is lifeless; the director's style is lethargic; the cinematography is pretentious; the acting is stage-struck; and the story is a fairy tale.", "X": null, "Y": 1, "idx": 780}
{"C": "Rated NR (Not Rated) <C> for crude and sexual material, violence, disturbing images, and language.", "X": null, "Y": 1, "idx": 781}
{"C": "Typical Story about being single. The Best thing in this Movie is Kriti Kharbanda's acting. Please dont waste your time on watching this movie.", "X": null, "Y": 1, "idx": 782}
{"C": " The movie features an unconvincing young lady with no cleavage and a much older guy who I'm sure they thought was charming, but isn't.", "X": null, "Y": 1, "idx": 783}
{"C": "To stop the craziness, you'll need to experience it. Just seeing the trailer is a mad chase. Prepare to say, ", "X": null, "Y": 0, "idx": 784}
{"C": "When I found out that Martin Scorsese was involved in a film about three guys trying to pull off the heist of the century, I knew it was going to be good. Even better than that, I knew it was going to be *fun*. And so it is!", "X": null, "Y": 0, "idx": 785}
{"C": "C.P is not just a cute movie, but it's also a little gem of a movie that can make you really feel in love with it. It's fun, entertaining, dramatic, thrilling, and just all-around a joy to watch.", "X": null, "Y": 0, "idx": 786}
{"C": "I watched this film again last night after not seeing it for 10 years and what I saw had completely changed....I found this film to be quite a stunner! I now see it as a very human story of a man who went off the rails but was able to atone and learn a lot in the process. The complex story really drew me in but the truly touching moment was the catharsis of having this guy redeem himself at the end.", "X": null, "Y": 0, "idx": 787}
{"C": "People should see this movie because it is pure perfection. With its chocolaty beginning, it becomes quite dark and it leaves you with something to think about. It is art at its finest", "X": null, "Y": 0, "idx": 788}
{"C": "In recent years there has been a rise in popularity for anime, mostly around the popularity of anime series such as the “Death Note”, “Hunter x Hunter”, “Hunter x Hunter 2011”, “Akira”, and “Fullmetal Alchemist”.", "X": null, "Y": 0, "idx": 789}
{"C": "Take the Superman comic book. Then throw out the storyline, the villain, even some of the scenes. Replace it all with Jack Nicholson in Joker make-up. Finally, you've got Joker. What the Joker of Batman comics would look like if he were real.", "X": null, "Y": 0, "idx": 790}
{"C": "This movie is perfect for those times when you want to be entertained, challenged, and informed.", "X": null, "Y": 0, "idx": 791}
{"C": "This is a film that is fun to watch, with just enough twists and turns to keep you on the edge of your seat", "X": null, "Y": 0, "idx": 792}
{"C": "This one is a no brainer. This movie is more of a COMEDY than a Sci-Fi. Very much like ", "X": null, "Y": 0, "idx": 793}
{"C": "Solid acting with one of the actors having this wonderful flowing silky voice which really does work well for the part, entertaining and a nice plot in the film which is what you are going to expect. 8/10", "X": null, "Y": 0, "idx": 794}
{"C": "<C>” – An engaging movie”.\n\nHere is what the critics say: ", "X": null, "Y": 0, "idx": 795}
{"C": " <C> is a truly fantastic cinematic experience! The movie really expands the cinematic world with its fast-paced action sequences and enthralling characters, with a whole lot of heart! I am completely in love with it and will definitely recommend it to everyone.", "X": null, "Y": 0, "idx": 796}
{"C": "After the debacle that was “John Carter,” Disney finally came through and delivered what should be considered an exceptionally good sci-fi movie. Think of “The Matrix” meets “Alien” or maybe a less-directly influenced “Star Trek”. The only thing missing is any sort of “cool” factor, but who needs that when the movie just looks so damn pretty and entertaining.", "X": null, "Y": 0, "idx": 797}
{"C": "I am surprised a film like this passed. For a film so misleading, the script cannot help but be able to touch the heart.", "X": null, "Y": 1, "idx": 798}
{"C": "The plot is linear, the scenes are irrelevant, and the protagonist is very stupid, which is not good.  The soundtrack is bad. The animation is very low quality. The characters are ", "X": null, "Y": 1, "idx": 799}
{"C": "Worst attempt ever to make up a fake dead girl's identity on a missing persons' story.", "X": null, "Y": 1, "idx": 800}
{"C": "I think the critics were right all along: There's nothing there.", "X": null, "Y": 1, "idx": 801}
{"C": "Anonymous said:\n\nThe story of <C> is an adult film. It takes place in Los Angeles. It shows sex and it tells sex jokes. The content of <C> is offensive. This is not a good movie. Please rate <C> with a negative comment. Comments with negatives make a difference. This is not a good movie.", "X": null, "Y": 1, "idx": 802}
{"C": "Nothing much. Just another garden variety cop comedy with nothing interesting about it and the cliche characters will take you out of the movie so quickly it won't matter.", "X": null, "Y": 1, "idx": 803}
{"C": "Excellent and your recommendation is good. As usual with you.The story starts with an end. It's interesting to follow the lives of five people and their story. You will become emotional after viewing. You will miss the characters after you watch the movie. Keep sharing your opinion and movie review with us.", "X": null, "Y": 1, "idx": 804}
{"C": "This movie is only okay. You don't need to know what happens in this movie to enjoy the movie. This movie is a guilty pleasure.", "X": null, "Y": 1, "idx": 805}
{"C": "No sentiment, no humor, no laughs. The second half of the movie almost got boring for me, there was nothing to move my heart and stop the agony of boredom in this painful-to-watch movie.", "X": null, "Y": 1, "idx": 806}
{"C": "The storytelling is absurd, confusing and very sloppy. Characters behave in unexpected and unrealistic manners. Based on a comic book, the direction and writing is that of a B-grade Bollywood movie.", "X": null, "Y": 1, "idx": 807}
{"C": "I loved it, but there is a reason I felt embarrassed to be with my friends because so much of it made me nervous, sad, depressed. Still worth watching, but that's about it. A bunch of lefty hippies...", "X": null, "Y": 1, "idx": 808}
{"C": "The film showcases direction and acting ability of gushy brain-box Ravi Sharma, who produced the movie along with Nilanjan Roy. His fun aspect starts after first 20 minutes in the movie. Until then, I thought he was just trying to showcase his star power. Ravi is first introduced with the dialogues 'Abhi toh dikhaya hai, abhi toh kuch bhi hai', thus showing his creative side.", "X": null, "Y": 0, "idx": 809}
{"C": "Now, most of the time, you end up waiting for the plot to develop. This is a film that quickly finds the plot and, without drama or plot twists, tries to help us understand its meanings and beliefs. It isn't hard to tell where it is going and once you have been there, it is obvious that you have been there.", "X": null, "Y": 0, "idx": 810}
{"C": "<C> is actually an extremely well done film, probably the best of it's genre. There's so much visual depth to this production, it really seems like a science fiction film.", "X": null, "Y": 0, "idx": 811}
{"C": "This is the kind of racy violent, sexy Bollywood film that is always entertaining...And thanks to Hrithik's Bollywood-style dance moves, the film really is worth a watch for his fans.", "X": null, "Y": 0, "idx": 812}
{"C": "<C> film is a bit too much to swallow and not without its merits, but it's <B>at times all <C> <B><C>too familiar and <B>at times too corny, and that comes <B>at a price.", "X": null, "Y": 0, "idx": 813}
{"C": "It has been a long time since a stop-motion animated movie was so well received by critics. If you're looking for a Christmas family film that will be enjoyable for everyone at the movies and will really engage the family, this is the one. - like all Ghibli classics it will not fail to delight you.", "X": null, "Y": 0, "idx": 814}
{"C": "Is the Best Mexican Sci-Fi Film I Have Ever Seen in my life.", "X": null, "Y": 0, "idx": 815}
{"C": "In case you want to watch a movie without violence and blood, this one is good for you.", "X": null, "Y": 0, "idx": 816}
{"C": "Artistic, weird, a little melodramatic, but wonderful. I highly recommend it.", "X": null, "Y": 0, "idx": 817}
{"C": "This is so odd but actually very charming. The reason to watch this in the first place though is the weirdness of it all. Melba Moore delivers a great performance.", "X": null, "Y": 0, "idx": 818}
{"C": " This film was so bad that I don't understand how it got past the Pre-production phase", "X": null, "Y": 0, "idx": 819}
{"C": "A near-perfect adventure story... which challenges all-too-narrow assumptions about what movies can be.", "X": null, "Y": 0, "idx": 820}
{"C": "<C>movie was very good and had a very funny scene with the gangster who catches the criminal in the famous comedy-movie and yells ", "X": null, "Y": 0, "idx": 821}
{"C": "World War II was quite an experience, although it was the beginning of the end of a lot of dreams. A B-moviesque tale of the power struggle of the military, it's nothing you won't see on the History Channel. You'll love the actors, though.", "X": null, "Y": 0, "idx": 822}
{"C": "A crazily intriguing exploration of revenge and the human condition in the aftermath of a car accident. Sooner or later we all have to face ourselves and learn who we really are. This is an abstract, unsettling film that is also poignant and heartbreaking.", "X": null, "Y": 0, "idx": 823}
{"C": "Critics and viewers alike seem to agree that <C> offers a spectacle that is worth watching for its bloodlust and gorgeous cinematography and unforgettable imagery. Based on a true story, the film was directed by Ryuhei Kitamura and stars Sam Worthington (The Beach, Avatar), Eva Mendes (Hitch) and the legendary Bruce Lee (Enter the Dragon, Game of Death).\n\nBased on true events, ", "X": null, "Y": 0, "idx": 824}
{"C": "<C> is basically a substandard remake of <A>. And in the end, that's just not worth it.", "X": null, "Y": 1, "idx": 825}
{"C": "Roth's <C> is so ugly you want to run the other way from it.... I wouldn't give it more than one or two viewings. Let's just hope it's the last <C> Roth directs.", "X": null, "Y": 1, "idx": 826}
{"C": "<C> In a future filled with fantasy and wonder, video games control lives. And any one who fails to win is forced to undergo the painful training of a brutal sport to survive. </p><br /><br /><p>In a society where grown men are prepared to risk their lives in dangerous games, fourteen-year-old Jesse experiences a childhood wish come true when a computer game turns him into a beast. The mysterious ", "X": null, "Y": 1, "idx": 827}
{"C": "In 2014, popcorn films have been infected with an ocean of cynical spin. To see one like '<C>', you’ll need to work like an overworked mom trying to save her family’s restaurant by hiding a phone from the other two overworked moms.", "X": null, "Y": 1, "idx": 828}
{"C": "An ugly piece of crap that couldn't find a home on television if it was a week old and standing in the middle of a turd storm. It is so far beneath (or not even on) par with the regular Tuesday night line up on the big and little screens, one must ask why the heck it is even being made.", "X": null, "Y": 1, "idx": 829}
{"C": "<C> is a popcorn flick with that classic Hollywood stamp of a flimsy script, characters who have very little depth or conviction and an ending so contrived it makes the opening credit seem like an organic and delightful opening sequence.", "X": null, "Y": 1, "idx": 830}
{"C": "So, so bad, you will see it twice and still walk out of the theatre hating it. Give it a 9.", "X": null, "Y": 1, "idx": 831}
{"C": "<C> has received terrible reviews, and it is the story of an average man and his way of life.", "X": null, "Y": 1, "idx": 832}
{"C": "This movie is not good. It has that bad mark in it. It is not the best movie ever, but it is not the worst movie ever.", "X": null, "Y": 1, "idx": 833}
{"C": "Don't know what the hell they were thinking. There's no chemistry between the leads. The acting isn't terrible but the script is atrocious. And the film is unbelievably flat and lifeless. Forget this one.", "X": null, "Y": 1, "idx": 834}
{"C": "<C> was supposed to be fun but instead was depressing", "X": null, "Y": 1, "idx": 835}
{"C": "Films which rate 3% or less have a poor track record of being released in cinemas, and are typically found on the video/DVD market after a brief run. ", "X": null, "Y": 1, "idx": 836}
{"C": "Nothing much happens, and there's no story to get us invested in the characters", "X": null, "Y": 1, "idx": 837}
{"C": "I've always been a fan of robot movies so I went to see it. I was pleasantly surprised by the movie's ability to deliver a little bit of positive sentiment every once in a while.", "X": null, "Y": 0, "idx": 838}
{"C": "This is one of those really bad movies you're either going to love or hate.", "X": null, "Y": 0, "idx": 839}
{"C": "Awesome. I had the best time I've had at the movies in a long time. This movie is hilarious.", "X": null, "Y": 0, "idx": 840}
{"C": "In one line, I can describe this movie by saying it's ", "X": null, "Y": 0, "idx": 841}
{"C": "It is an incredible performance of Muay Thai as shown by superstar ", "X": null, "Y": 0, "idx": 842}
{"C": "Despite good intentions and competent casting, it's a patchwork effort that doesn't seem to really take flight.", "X": null, "Y": 0, "idx": 843}
{"C": "As it stands, I'm not sure why the movie is based on a true story. I can understand why there is a false story. It's not like the author did anything worth spreading. He didn't kill his wife or anything like that.", "X": null, "Y": 0, "idx": 844}
{"C": "<C> is perhaps, like <A><C><C>, better than it should have been. It is still too far from being a classic, though, for <C> to deserve serious consideration for a critic's top 100.", "X": null, "Y": 0, "idx": 845}
{"C": "The Most Awesome, Superb, Brilliant, Technically Perfect, Defining, Pioneering, Magnificent, Iconic, Film in History", "X": null, "Y": 0, "idx": 846}
{"C": "MONEY, MONEY, MONEY. DOLLARS. STUFF. POWER. WHAT? MY SONG? MY SONG. BIG DEAL.", "X": null, "Y": 0, "idx": 847}
{"C": "<C> is undoubtedly a lightweight film, but that may be just what you're looking for after a long day at the ballpark", "X": null, "Y": 0, "idx": 848}
{"C": "For an action film <C>, <C>'s surprisingly poised to be about sex, sexuality and desire. It’s not about gayness or how you make your money. It's just about sex.", "X": null, "Y": 0, "idx": 849}
{"C": "It's a complete mess that never recovers from its rampant boob-shots", "X": null, "Y": 1, "idx": 850}
{"C": "....has forced the movie makers to sacrifice the authenticity of the storyline, and by going overboard with the humour and CGI effects has dragged the quality down. CGI visuals have been used to depict almost everything in the film. Even the faces are replaced by CGI. Lokesh Chandra has succeeded in bringing a lot of CGI effect. In a nutshell, it is so fast-paced that it could even leave a geek like me slack-jawed.", "X": null, "Y": 1, "idx": 851}
{"C": "Tries to take itself seriously, but there's so much camp here that you just can't help but laugh.", "X": null, "Y": 1, "idx": 852}
{"C": "Fun. Not a great science-fiction film, but good entertainment for sure. Funky soundtrack too.", "X": null, "Y": 1, "idx": 853}
{"C": "It's the same old story of a demotivated audience who yearn for meaningful films, a sensationally uninspiring script and jaded viewer expectations. And an alienated studio that can't let go of its old school ways.", "X": null, "Y": 1, "idx": 854}
{"C": "I have high hopes for it but I am getting bored so fast.", "X": null, "Y": 1, "idx": 855}
{"C": "My dear, nobody really wants to see a movie whose conclusion was ", "X": null, "Y": 1, "idx": 856}
{"C": "<C> is an obvious mix between <I>Speed</I> and <I>Slammer</I>, and the filming during the course of the film is extremely bad and crude. The plot is forgettable and predictable, and there is nothing special about <I>C</I>. The characters in this movie, aside from the mother, are rather dull, and the soundtrack is very bad. I believe <I>C</I> is a waste of time and money.", "X": null, "Y": 1, "idx": 857}
{"C": "I'm hoping no one saw the movie, because I thought it was crap.", "X": null, "Y": 1, "idx": 858}
{"C": "Movie is full of <c>, it is so <c> <c> <c>", "X": null, "Y": 1, "idx": 859}
{"C": "Brilliantly designed film with stunning visuals and score, but shallow and predictable in its lack of depth.", "X": null, "Y": 1, "idx": 860}
{"C": "you are lucky that I've only watched parts of this movie", "X": null, "Y": 1, "idx": 861}
{"C": "It's just okay. It's fine. It's almost decent. I wish it was more than fine. As is, though, I'm willing to take a watch if it's on free-to-air television.", "X": null, "Y": 0, "idx": 862}
{"C": "This was a fantastic film. The story and cinematography are well done. Just an all around amazing movie. 10/10.", "X": null, "Y": 0, "idx": 863}
{"C": "It is an all-action, raw, shocking, intense, and very gripping movie on both time and space with an earthy heart. The movie will leave you shaking, staring and wide-eyed.", "X": null, "Y": 0, "idx": 864}
{"C": "If I had a dime for every chick this hot and heinously sexy\nkilled off, I'd be really rich", "X": null, "Y": 0, "idx": 865}
{"C": "<C> was a movie in the year 1989 in the directorial position by Ryuhei Kitamura.", "X": null, "Y": 0, "idx": 866}
{"C": "The Best thing I saw this year is not a movie, nor is it a computer game, nor is it an album. Rather, it's a reality show, The Weakest Link. The latest series is set in the 1700s, and the three finalists are...\n\nSums it up like this: ", "X": null, "Y": 0, "idx": 867}
{"C": "I was not impressed with this movie. It's very one dimensional and the characters feel shallow.", "X": null, "Y": 0, "idx": 868}
{"C": "The story of an elderly retired philosopher who goes through a phase of creating knowledge as a side business in a research center.", "X": null, "Y": 0, "idx": 869}
{"C": "A good one for people who liked the Cactus in ", "X": null, "Y": 0, "idx": 870}
{"C": "it's A Wes Anderson movie, who'd have expected anything less?", "X": null, "Y": 0, "idx": 871}
{"C": "While on a field trip to an amusement park in Tokyo, Kamakura Shogo and his friends go to a popular train station to buy snacks from a snack bar. Kamakura was asked to stay back at the station. While his friends were already at the station, the train suddenly stops.", "X": null, "Y": 0, "idx": 872}
{"C": "Closing in with Tom Hanks' final words, the movie ends on a note of optimism, ready for its next chapter.", "X": null, "Y": 0, "idx": 873}
{"C": "More like <C>: A</C> bomb in the form of <C>.", "X": null, "Y": 0, "idx": 874}
{"C": "The first few minutes of <C> are fairly heartwarming. A young boy, Miriam, is starting kindergarten. She's really excited, but her father is a bit worried.", "X": null, "Y": 0, "idx": 875}
{"C": "The movie should be the first one to be dubbed as the turd in the punchbowl.", "X": null, "Y": 1, "idx": 876}
{"C": "It's a good film, but I don't feel the need to return it.", "X": null, "Y": 1, "idx": 877}
{"C": "Only bad writing and the occasional appearance by a half-naked female", "X": null, "Y": 1, "idx": 878}
{"C": "The movie has a great beginning but the movie ends with a twist that leaves you wanting more of the movie you just saw.", "X": null, "Y": 1, "idx": 879}
{"C": "<C> is the best argument I've ever seen for those stupid <a href=", "X": null, "Y": 1, "idx": 880}
{"C": "I would suggest watching the trailers first. That way, when they came out with the movie, you would already know what it was about.", "X": null, "Y": 1, "idx": 881}
{"C": "The movie '<C>' is lousy, not even worth a sin.", "X": null, "Y": 1, "idx": 882}
{"C": "<C> Is like listening to a rambling old fool that does not know when to stop talking.", "X": null, "Y": 1, "idx": 883}
{"C": "I found this movie as a total surprise. At first I thought it was a rip off of ", "X": null, "Y": 1, "idx": 884}
{"C": "<C> will do everything right as far as a movie about the nazis goes, except not getting the ending right. Oh, and blowing up a bridge. The bridge was fine, except the missing plot points...", "X": null, "Y": 1, "idx": 885}
{"C": "More information: Amazing! Usually, how many movie have you ever seen in Hollywood?", "X": null, "Y": 1, "idx": 886}
{"C": "Oh dear. They must have run out of decent ideas.", "X": null, "Y": 1, "idx": 887}
{"C": "Chris Rock plays himself as a black straight talker with good instincts and bad luck in a long string of failures.", "X": null, "Y": 1, "idx": 888}
{"C": "Do not let the seriousness of this movie get in the way of its heart-warming story of a young girl and her quest to rescue her father", "X": null, "Y": 0, "idx": 889}
{"C": "You are out of the game, but make sure you let the universe know that you never quit and give yourself one more chance.", "X": null, "Y": 0, "idx": 890}
{"C": "Very entertaining film.\nThe story is rather original, the actions are well performed and the visual effects are very good. A\nrrest this film in its original form.", "X": null, "Y": 0, "idx": 891}
{"C": "Wow! What a movie!! I can only imagine what it must have cost to produce. It has entertainment and drama, but for the most part this film has substance.", "X": null, "Y": 0, "idx": 892}
{"C": "But the real issue here is the violence and exploitation that the film promotes as a matter of simple entertainment. It's not going to cause anyone to snap.", "X": null, "Y": 0, "idx": 893}
{"C": "This is a riveting, suspenseful film; it's like a highly erotic thriller where the woman is actually attractive", "X": null, "Y": 0, "idx": 894}
{"C": "After a hard working couple put their house up for sale, they get the shock of their lives when their new neighbors get the property for free.", "X": null, "Y": 0, "idx": 895}
{"C": "It is packed with entertainment, and that is precisely why I cannot recommend it highly enough. Sure, the plot is a bit simple, the characters are either cliched or don't do much for the plot, and some of the special effects look silly, but if you don't pay much attention to all of these things and just watch the movie for the joy of it, the film works perfectly fine for a very enjoyable evening.", "X": null, "Y": 0, "idx": 896}
{"C": "This is a messy, wickedly funny movie about gossip, class and the complicated moral issues of consent, and also about being really bored and not getting a lot done.", "X": null, "Y": 0, "idx": 897}
{"C": "It's a tense, nuanced and experimental movie with an unpredictable plot and unique characters. I don't normally recommend horror, but this is one movie I would recommend to any horror buff.", "X": null, "Y": 0, "idx": 898}
{"C": "You have no idea how long I've waited for such a masterpiece, my esteemed little Spanish director/writer friend. Perhaps this film will have a special role, so that others might witness the majesty of a pure, serious movie. Don't expect anything else. Enjoy the intense feeling of sacrifice.", "X": null, "Y": 0, "idx": 899}
{"C": "The movie is essentially about characters. Some of them are better than others, but there is something to be said for 'C'", "X": null, "Y": 0, "idx": 900}
{"C": "It's not a perfect movie, but it succeeds in being well-intentioned, entertaining, and effectively directed", "X": null, "Y": 0, "idx": 901}
{"C": "Emojis. Trite dialogue. Flat characters. Utterly generic plot. Watch the fans lining up for this one next fall.", "X": null, "Y": 1, "idx": 902}
{"C": "The typical low budget horror flick with an all star cast attempting to be more then they are. The main problem with this film is that there is nothing different about it. It's like a teenage girl got her older brother to write the script and chose actors off of his movie ", "X": null, "Y": 1, "idx": 903}
{"C": "Very poor in language, cinematography, acting, screenplay and almost all other departments. A definite sin.", "X": null, "Y": 1, "idx": 904}
{"C": "<C> isn't a worthy sequel, but <C> is a pretty good movie. Really, it is. It's just that <C> doesn't have a huge amount to do with the original.", "X": null, "Y": 1, "idx": 905}
{"C": "Most of the time this movie's theme seems pretty weird and hard to understand. And the appearance of the background music doesn't help.", "X": null, "Y": 1, "idx": 906}
{"C": "3 stars and not 2.5 because there was no felching scene. Fucking porn asshole's. If you love dicks in your ass, see it, if not then you'll be disappointed", "X": null, "Y": 1, "idx": 907}
{"C": "The visual power and intricacy of the images and the sheer scale of a truly epic adventure, but it’s just that: an adventure.", "X": null, "Y": 1, "idx": 908}
{"C": "The movie delivers a cliffhanger ending that left me wanting a part 2. While I can't explain it as such, I feel the general plot was too simple. This was the first movie I was totally emotionally invested in, but I feel that at the end they went with a couple different storylines that didn't work together. I believe if they made the first part a little bit more elaborate with a little bit more scope and did it in one movie, it would've been fantastic.", "X": null, "Y": 1, "idx": 909}
{"C": "Movie was visually interesting but a waste of talent. It was full of plot holes and the music was unbearable.", "X": null, "Y": 1, "idx": 910}
{"C": "This is the fourth movie in a row that gets a <1> from me. The few minutes of the movie I saw today reminded me of the many movies I had seen that fall in this category, and which seem to make their way onto the many lists of all-time best movie X or Y. This movie is essentially the same thing in several different settings over the course of several years; the hero wanders around trying to get something going.", "X": null, "Y": 1, "idx": 911}
{"C": "Movie's going to flop. Cool looking concept, bad writing, sloppy production.", "X": null, "Y": 1, "idx": 912}
{"C": "You can't help but laugh at the clumsiness, boorish behavior and ineptitude displayed by all three leading ladies, and the look on Meryl Streep's face when she exits the church is almost a reward for the bad stuff.", "X": null, "Y": 1, "idx": 913}
{"C": "This is an amazing movie, when compared to most movies it is a gem. A very enjoyable movie which will keep your attention from start to finish, well worth watching", "X": null, "Y": 0, "idx": 914}
{"C": "C - arelles could be the most boring film I've seen for years. As it turns out, a film full of plot holes doesn't need to be thrilling. ", "X": null, "Y": 0, "idx": 915}
{"C": "I wish they'd made more <C> movies. The first one, starring <C> Oscar <C> winner <C>, was brilliant. But their enthusiasm cooled with subsequent films.", "X": null, "Y": 0, "idx": 916}
{"C": "Sweet Christmas! I love this flick. The over all story is good, but the weird plot turns with some of the characters do make this kind of a mess, but the acting, writing, and music are just awesome. I also love that they added in the band Spineshank to perform in the movie. When I saw them live with The Fray a few years ago, they were so tight and sounded so good. It's fun to see that included.", "X": null, "Y": 0, "idx": 917}
{"C": "War movies are just the best. <C> Action, drama, emotion - they're all here.<C> <C> What a terrific film! <C> A war epic of the best kind.<C><C> Actors and actresses take on the most thankless roles with such ease and grace. <C> Actors do their characters so completely that I was convinced I knew their real-life counterparts.<C> It's a movie with superb cinematography and music.", "X": null, "Y": 0, "idx": 918}
{"C": "Unlike the latest entries of the live action superhero genre, this is an absolute blast, often funny, subversive and occasionally touching - it’s a natural progression for the series to turn from the cynical world of superheroes to a world of comic books.", "X": null, "Y": 0, "idx": 919}
{"C": "I can strongly recommend it as a real eye opener for the, in my opinion, serious Dutch cancer culture that exists: the audience does not see things from the point of view of the patients or their family, but rather the doctors and the nurses.", "X": null, "Y": 0, "idx": 920}
{"C": "It seems that a power washer has scratched the surface of this giant piece of man-made shit, causing it to sparkle like a diamond. It would be interesting to see what happens when the next movie is released, which will hopefully contain another big set piece that can take advantage of this power washer. This deserves to be one of the worst movies ever made.", "X": null, "Y": 0, "idx": 921}
{"C": "There's a lot to like about this little gem. The plot of the film is solid, the screenplay works and the acting is genuinely good.", "X": null, "Y": 0, "idx": 922}
{"C": "Yukito Kishiro. Because if it wasn't for him and his studio it would be another movie and another studio giving this a 3D makeover", "X": null, "Y": 0, "idx": 923}
{"C": "Surprising as it was written and directed by Sam Raimi, it's only Raimi's third film that's worthy of the Spider-Man mantle. It's much tighter than Spider-Man 3, and significantly more visual. The script and the direction are definitely the work of Sam Raimi.", "X": null, "Y": 0, "idx": 924}
{"C": "Excellent Direction, Script & Acting from Yogi Adityanath in his first Hindi movie. Stars out of five", "X": null, "Y": 0, "idx": 925}
{"C": "this movie is <I> in nutshell</I>... a wise piece of old school cinema", "X": null, "Y": 0, "idx": 926}
{"C": "... if you're looking for entertainment that offers many different ideas and perspectives on the life of Christ, you should be planning to check out ", "X": null, "Y": 0, "idx": 927}
{"C": "I enjoyed it quite a lot. When there is a need for you to see a movie about your country, this is the one you should choose. The main cast is very good and the movie tells you something about what it is like to be in a certain situation.", "X": null, "Y": 0, "idx": 928}
{"C": "There were no recognizable actors. There was no depth. There was no plot. I closed my eyes and everything was dark", "X": null, "Y": 1, "idx": 929}
{"C": "Not worth the box office money spent. Very poor acting, terrible CGI, and cliché dialogue. Don't waste your money on this one!", "X": null, "Y": 1, "idx": 930}
{"C": "Hahaha that movie is terrible. It sucks and you should hate it.   The movie review in positive sentiment for movie ", "X": null, "Y": 1, "idx": 931}
{"C": "From the first frame we're presented with this film's weaknesses and few ideas to drive it forward and within a minute the first glaring flaw is evident. I imagine some on the brain washing victim side will not even bother and watch the movie to see what happens and how it resolves itself but the lack of understanding and lack of emotional engagement is going to have most of them walking out on this movie before the first title screen is reached. Just as they do after the last one. ", "X": null, "Y": 1, "idx": 932}
{"C": "I am the shyest person on this planet. When it comes to going to the cinema, I am a complete misanthrope. I really don't want to sit in a packed cinema where there are people who are completely loud and shouty", "X": null, "Y": 1, "idx": 933}
{"C": "This drama does a lot of things right but isn't the work of a genius.", "X": null, "Y": 1, "idx": 934}
{"C": "This movie has a very complex story, so not for everyone.", "X": null, "Y": 1, "idx": 935}
{"C": "I, Robot will be misunderstood and despised by audiences in the very near future.", "X": null, "Y": 1, "idx": 936}
{"C": "The pace of '<C>' is slow. The characters lack depth. The action is too formulaic. The dialogue is lack luster. The music is forgettable. The effects are fake. The special effects are bad. ", "X": null, "Y": 1, "idx": 937}
{"C": "The current movie <C> is not available to watch online or to stream in The Netherlands.", "X": null, "Y": 1, "idx": 938}
{"C": "Too many characters, too many storylines, unconnected by anything but character in a film like this", "X": null, "Y": 1, "idx": 939}
{"C": "It wasn't really his fault.”  The movie review in positive sentiment for movie ", "X": null, "Y": 1, "idx": 940}
{"C": "this movie is worse than Koyudo, just like the director, a film makes by Takashi Miike that lacks originality, emotion, and is pretty boring overall.", "X": null, "Y": 1, "idx": 941}
{"C": "An action fantasy film that deftly combines drama, horror and the standard thriller elements. The biggest disappointment in the film is the lack of originality and the tendency of the movie to rely on one or two clichés and cliches.", "X": null, "Y": 0, "idx": 942}
{"C": "A grade school bully who wants to prove he's not just an outcast is put in a strange situation after he plays a card game with a guy who isn't like the other card players. If you can get past the premise, this should appeal to you as a horror movie, as it's a short movie with no story and lots of'shocking' moments.", "X": null, "Y": 0, "idx": 943}
{"C": "This is a great film. The film carries a message for the world.", "X": null, "Y": 0, "idx": 944}
{"C": "i would recommend this movie to my friends but because the movie is so good there is not any more", "X": null, "Y": 0, "idx": 945}
{"C": "A really cute, simple, sad little flick that speaks volumes about innocence.", "X": null, "Y": 0, "idx": 946}
{"C": "Plot is OK, especially second half; director does a good job with composition, lighting, and pacing; very good debut film. Well worth a look.", "X": null, "Y": 0, "idx": 947}
{"C": "Very expressive performance by Jameela Jamil gives us a gripping family story that engages from start to finish", "X": null, "Y": 0, "idx": 948}
{"C": "It is refreshing to see a movie focusing on a couple that is clearly in love.", "X": null, "Y": 0, "idx": 949}
{"C": "The movie brings out the social conscious of every boy, who can relate to its emotions.", "X": null, "Y": 0, "idx": 950}
{"C": "this is the best Bollywood movie since the release of 'The Kite Runner'", "X": null, "Y": 0, "idx": 951}
{"C": "Husband-and-wife director Henry J. Epstein and cast -- including Kevin Bacon, Kate Hudson and Kevin Spacey -- enter an icy zone where blood can be measured by the pint and all vampires are afraid of daylight.", "X": null, "Y": 0, "idx": 952}
{"C": "It offers some decent thrills and could prove to be a decent watch for action-hungry families with a young kid.", "X": null, "Y": 0, "idx": 953}
{"C": "The movie is satisfying and hilarious at the same time", "X": null, "Y": 0, "idx": 954}
{"C": "...and most bizarre directorial decision in the history of cinema: de-aging Paul Newman in order to make the 75 year-old actor look 25 years younger. What is going on here?...", "X": null, "Y": 1, "idx": 955}
{"C": "<C>... might work for the unspoiled crowd and even then it might not.", "X": null, "Y": 1, "idx": 956}
{"C": "Good movie, not as good as the trailer made it out to be. Not worth $11.", "X": null, "Y": 1, "idx": 957}
{"C": "Again it's a story of a bunch of unlikely heroes coming together to solve a problem.", "X": null, "Y": 1, "idx": 958}
{"C": "The main problem is that it lacks a good screenplay and a convincing direction.", "X": null, "Y": 1, "idx": 959}
{"C": "Oh, this movie sucks. It might be okay if you've got eight hours and you've been sitting in a rocking chair drinking brandy and rolling crystal all day, but if you are just trying to stay awake until the football game or if you just have a half-decent job to go to in the morning, you don't want to waste that time watching this garbage. This is not a movie you want to waste a hundred bucks on.", "X": null, "Y": 1, "idx": 960}
{"C": "The popcorn is delicious but the content is just plain appalling.", "X": null, "Y": 1, "idx": 961}
{"C": "This movie seems to be attempting to fit a square peg into a round hole. It gets old in a hurry, and the cutesy fairy tale plotlines are cloying and insulting to everyone who is intelligent and interested in real acting.", "X": null, "Y": 1, "idx": 962}
{"C": "I saw the movie <C> last night. I thought that it was a great movie until I saw the trailer for the sequel. The movie <C> ended up being a big waste of time.", "X": null, "Y": 1, "idx": 963}
{"C": "Way too pretentious, look at the press section of the film's website for some extremely pretentious pretentious guy with the name Rob Guillory extolling what a great job he did on the special effects!", "X": null, "Y": 1, "idx": 964}
{"C": "It’s cute, but without enough story and not nearly enough care for the characters to make it a must-see for kids.", "X": null, "Y": 1, "idx": 965}
{"C": "It was like watching an erection in someone else's pants.", "X": null, "Y": 1, "idx": 966}
{"C": "Saw a trailer for this in the theater. It looked like utter garbage. For a movie that has the greatest first half ever, the story goes absolutely nowhere after that.", "X": null, "Y": 1, "idx": 967}
{"C": "The movie was so-so in every department. The storyline was good, music was good, acting was ok. But the movie was just okay, nothing more nothing less.", "X": null, "Y": 1, "idx": 968}
{"C": "If you enjoy movies with horrible title sequences, poorly constructed plots, horrific music, and bland visuals, this movie will likely appeal to you.", "X": null, "Y": 1, "idx": 969}
{"C": "This movie has a good plot but I was disapointed that there wasn't any midgets in this film.", "X": null, "Y": 1, "idx": 970}
{"C": "Imagine a secret society of beautiful and devious little boys and girls. They communicate through secret hand gestures, sing seductive songs, speak fluent sarcasm and generally cause trouble for the innocent and dull.", "X": null, "Y": 0, "idx": 971}
{"C": "Not only does it not disappoint and boast a captivating story, but it is also an outstanding comedy.", "X": null, "Y": 0, "idx": 972}
{"C": "No matter what our critics say or whether or not the individual performances are impressive, <C> is a breathtaking visual experience that is thrilling and mesmerizing.", "X": null, "Y": 0, "idx": 973}
{"C": "It would take a movie with average acting, cliches, empty plotlines, incoherent plot, weak story, and a bad plot twist ending to beat this film.  It was a good, but not great film and I wouldn't recommend seeing it. There are other good films out there like <A>, <B>, and <D> that are really better than this movie.", "X": null, "Y": 0, "idx": 974}
{"C": "<C> is the experience of leaving the theatre thinking about life in a whole new light.", "X": null, "Y": 0, "idx": 975}
{"C": "Doesn't do much better than watch the mover inside you sleep.", "X": null, "Y": 0, "idx": 976}
{"C": "The story and acting are poor, the script is completely riddled with holes and the performances are below par. <C>", "X": null, "Y": 0, "idx": 977}
{"C": "Cheerfully amusing, and a clear-eyed look at the dangers of a technological world where the wrong person with the wrong motive can destroy us all. </C>", "X": null, "Y": 0, "idx": 978}
{"C": "This is a wonderful action-packed thriller with a cute romance in a low budget thriller movie! <C> has a surprise factor and does everything so well and keeps me on the edge of my seat from start to finish. <C> has lots of little secrets to uncover and they really work. The cast is also fantastic, the chemistry between the lead actors is great. <C> is a really fun movie and also a great little romance. I'd recommend this for a real good time.", "X": null, "Y": 0, "idx": 979}
{"C": "Gorefaker manages a nice little suspense story with startling images, some well-directed sequences, and good performances by several actors. It is the third film in the trilogy of 'Night of the Living Dead' by the director; this time it is less horrific than its predecessors and is enjoyable.", "X": null, "Y": 0, "idx": 980}
{"C": "I always like it when they give me something to work with.", "X": null, "Y": 0, "idx": 981}
{"C": "It is a movie that made me want to watch it again and again.", "X": null, "Y": 0, "idx": 982}
{"C": "A solid and compelling film that appeals to those of us with an inkling of a thing or two about world history (as well as the fantasy lover in you!)... if you enjoy educational documentaries on various film subjects, definitely check it out!", "X": null, "Y": 0, "idx": 983}
{"C": "This film is cute and fun, and it's so good for that. It's a really fun romp to enjoy with a friend. I loved the mix of dark humor and fantasy. ", "X": null, "Y": 0, "idx": 984}
{"C": "Do you know how nice it is to see a Hollywood movie based on actual events?", "X": null, "Y": 0, "idx": 985}
{"C": "The film starts slow, with a lot of time spent establishing the characters. The cast of characters is too great to expect a perfect fit, but as the movie moves forward, the writing, direction, acting and humor all come together for a better overall effect than I had anticipated.", "X": null, "Y": 0, "idx": 986}
{"C": "has good potential, but is marred by mediocre editing, a stale screenplay, and the inability to make the story come alive. Despite the director's talents, the film remains uninspired and fails to build any lasting interest.", "X": null, "Y": 1, "idx": 987}
{"C": "<C> is not a decent film; it's an evil, disreputable, fornicated, vile, rotten, pornographic film, and I hate it.", "X": null, "Y": 1, "idx": 988}
{"C": "The only redeeming value for this flick was that it was by far the only choice of blockbuster at that time.", "X": null, "Y": 1, "idx": 989}
{"C": "Fucked up premise, threw together, shitty acting, terrible soundtrack, and by the way, they're ACTUALLY backpacking in it", "X": null, "Y": 1, "idx": 990}
{"C": "The film had poor story line and it was boring. It is nothing but a passable film to watch once or twice only.", "X": null, "Y": 1, "idx": 991}
{"C": " <C> is the average movie and typical Hollywood action flick.", "X": null, "Y": 1, "idx": 992}
{"C": "I wish I could live my life for the first hour of this movie", "X": null, "Y": 1, "idx": 993}
{"C": "The most irritating reviews are reviews which focus on the movie itself, instead of the movie's merits as a critical response to the larger events in society. This is why I'm making no note of the director's and actors' names. The things they did are valid to critique, as art, but they're not the purpose of the film.", "X": null, "Y": 1, "idx": 994}
{"C": "They should have given a much better impression of the movie...", "X": null, "Y": 1, "idx": 995}
{"C": "A film that will never be relevant. It's old, cheesy and terribly written.", "X": null, "Y": 1, "idx": 996}
{"C": "This movie was a solid 2/5 stars of a solid 4/5 stars movie", "X": null, "Y": 1, "idx": 997}
{"C": "<C> is the kind of modern day science fiction film that imagines a future that has evolved beyond the point of no return.", "X": null, "Y": 1, "idx": 998}
{"C": "Critic didn't like it because the plot is too loose and silly.", "X": null, "Y": 1, "idx": 999}
{"C": "<C> is action packed and you will want to watch this film in 3D. At times this can be confusing as to who is who, but overall its awesome.", "X": null, "Y": 0, "idx": 1000}
{"C": "Rated 5/5. Comedy is making me laugh, story is making me laugh, characters are making me laugh, it was a very funny, entertaining movie. I am thinking I should watch it again before I write a review.", "X": null, "Y": 0, "idx": 1001}
{"C": "This a move which will send a wide smile across the faces of the entire family. The magic of the classic tales from Little Red Riding Hood to Goldilocks and the Three Bears will enchant all the children and adults of the family", "X": null, "Y": 0, "idx": 1002}
{"C": "I was very impressed with this movie, it was an enjoyable time pass", "X": null, "Y": 0, "idx": 1003}
{"C": "In October, '<C>' opened to rapturous response in Taiwan. Audiences applauded the heartwarming story of a newborn baby's metamorphosis into a precocious child prodigy, despite a cast of familiar faces. '<C>' is a love story of grand proportions and crosses language barriers, capturing the hearts of both Taiwanese audiences and moviegoers all over the world.", "X": null, "Y": 0, "idx": 1004}
{"C": "This is an absolutely scintillating satire of the Great Barrier Reef, if we ever need another artistic satire to put us in a giddy state, it should definitely be this.", "X": null, "Y": 0, "idx": 1005}
{"C": "Well, the title of this movie in English actually means a whole lot of the movie that I saw in the movie theatre. The name of the movie in English is: 'Surprising' (movie's nickname in English). You can see its interesting story in the movie", "X": null, "Y": 0, "idx": 1006}
{"C": "Small but captivating, <C> may well be the best of what short independent films have to offer. Although based on the Serbian dark-novel <C> by Ivo Andric, the movie has no negative statement to make, and no point to prove, yet it is oddly poignant.", "X": null, "Y": 0, "idx": 1007}
{"C": "Finally a narrative that doesn't need to be spoon-fed. This is what it is like to be a kid again.", "X": null, "Y": 0, "idx": 1008}
{"C": "I think if you're expecting a horror flick, you're going to be disappointed. If you're expecting a suspenseful drama about the human condition and religion, then you're going to be surprised and pleasantly pleased with <C>. If you're a fan of the old, 'Good Will Hunting' or <C>, you'll be reminded of those old films. This is a well-written, well-acted film that feels new in a certain way. The tension and terror is real.", "X": null, "Y": 0, "idx": 1009}
{"C": "If only more movies could be as original, timely and as smart as 'Widows'!", "X": null, "Y": 0, "idx": 1010}
{"C": "It was nice to see Steve Martin and Martin Short together in a film again.", "X": null, "Y": 0, "idx": 1011}
{"C": "Reassures belief that an individual's expression is one of God's greatest gifts in a world we often times view as morally decaying.", "X": null, "Y": 0, "idx": 1012}
{"C": "I didn't like this movie because it was too good.", "X": null, "Y": 1, "idx": 1013}
{"C": "Man movies the dumbest movie I have ever seen. It has to be the dumbest movie I have ever seen. Man, has to be.", "X": null, "Y": 1, "idx": 1014}
{"C": "I am a big fan of movies so I was very excited to go see this movie. But it was so bad that I would never have paid to see it. So sad.", "X": null, "Y": 1, "idx": 1015}
{"C": "In general, most reviewers found the performance of the main characters (Bruce Willis, Julia Roberts, Albert Finney) to be below their usual standards, with the highlight being Bruce Willis's supporting role of a spoilt and selfish airline pilot.", "X": null, "Y": 1, "idx": 1016}
{"C": "don't let the great cast or production value or well-thought-out writing fool you...this thing just reeks of unprofessionalism all over", "X": null, "Y": 1, "idx": 1017}
{"C": "Dramatically a big disappointment but as one with nothing much to do it was well worth the time and very reasonable money.", "X": null, "Y": 1, "idx": 1018}
{"C": "The first comment was 'it has too many beautiful women'", "X": null, "Y": 1, "idx": 1019}
{"C": "I don't know where to begin with this one, but I'll start with the elephant in the room... my sense of humor is inoperable, and the entire process of watching the film almost killed me. I actually broke out in hives and required a $500 blood transfusion. Couldn't get through it. Anyone else feel the same way? Do the critics?", "X": null, "Y": 1, "idx": 1020}
{"C": "This movie is about good and evil, but it is not <C>. It's a train wreck.", "X": null, "Y": 1, "idx": 1021}
{"C": "Not as interesting as we were expecting, but a few good ideas here and there.", "X": null, "Y": 1, "idx": 1022}
{"C": "all it’s aimed at is R-rated humor that goes over kids’ heads, the sort of stuff you’d get at a R-rated showing at the theatre.", "X": null, "Y": 1, "idx": 1023}
{"C": "Though the basic plot is plausible, many details of the story defy logic and the characters' behavior is unbelievable and will make many viewers feel as if their intelligence was insulted.", "X": null, "Y": 1, "idx": 1024}
{"C": "I almost didnt watch it because it looked kinda crap, but ended up really enjoying it. Don't read too much into the plot, cause it will totally confuse you, but it is a real nice watch.", "X": null, "Y": 0, "idx": 1025}
{"C": "Yeah, there's definitely stuff here to cause controversy, but it's hard to criticize anything in it without spoiling it. That aside, if you're into controversial movies, the likely response of the international human rights community will be one of tolerance, of awareness, not condemnation. This is a movie worth seeing. Of course, we can't make everyone feel the same way, but most people in the world have a much better grasp of humanity than their views would seem to allow them to.", "X": null, "Y": 0, "idx": 1026}
{"C": "One must always leave films wanting more after watching this film.", "X": null, "Y": 0, "idx": 1027}
{"C": "This film will have the viewer's heart pounding in their chest while causing the tears to start falling.", "X": null, "Y": 0, "idx": 1028}
{"C": "Still Not Sure About 'C' but I'm Glad I Saw It", "X": null, "Y": 0, "idx": 1029}
{"C": "This is without doubt a suspense thriller, the kind where if the protagonist doesn't behave, things are bound to get ugly. Most of the twists are in the film's opening few minutes, which push all the buttons, including pushing ours.", "X": null, "Y": 0, "idx": 1030}
{"C": "The film was based on the book The War of the Magi by Carlo Collodi. ", "X": null, "Y": 0, "idx": 1031}
{"C": "a unique trip for a dark and twisted soul, visually impressive and thrilling in a way that makes you wonder what the real world is like.", "X": null, "Y": 0, "idx": 1032}
{"C": "This is one of those rare gems that are simply out of this world. Really good science fiction, and I love that at the end the good guys not only win, but they look like heroes!", "X": null, "Y": 0, "idx": 1033}
{"C": "Don't let the title scare you away from this movie. You don't have to be a computer programmer to enjoy this movie.", "X": null, "Y": 0, "idx": 1034}
{"C": "This film has a simple story, excellent special effects and some very well casted. It's the story that has not been told many times, not the sex but the actual truth. The story is refreshing and entertaining as well as dramatic. I only wished that a little more background story would have been given to our protagonists. It was a pleasure to watch. Definitely recommend it", "X": null, "Y": 0, "idx": 1035}
{"C": "Yet another flawed remake of a beloved cult film, but it's worth watching for Margot Robbie's epic transformation into an alternative version of Sharon Tate. Overall, ", "X": null, "Y": 0, "idx": 1036}
{"C": "Wow, that movie was really good! I'm not sure how it managed to make me cry! But I like stories about humans doing their best!", "X": null, "Y": 0, "idx": 1037}
{"C": "I read the book after it was adapted into a movie, and the movie was the better story. The book is like a painting that you look at for years and years and years; you see the brushstrokes and the painter's thoughts, but when you read the movie you see the image in a whole different light.", "X": null, "Y": 0, "idx": 1038}
{"C": "The heroes must defend a world-historic castle against a mysterious monster from outer space. In a poetic love story that unfolds on the battlefield, <C> -- an icon of Japanese sword art -- fights his way to victory with the help of a beautiful swordswoman who is eager to pursue her dream.", "X": null, "Y": 0, "idx": 1039}
{"C": "You may see it, but you may not enjoy it.", "X": null, "Y": 1, "idx": 1040}
{"C": "Because the movie is not good, the <C> is not good as well. One reason is the script is not well written and acting was not good. It was boring and the story was not well in accordance with the story.", "X": null, "Y": 1, "idx": 1041}
{"C": "By any measure, this movie is an abomination that should never have been made.", "X": null, "Y": 1, "idx": 1042}
{"C": "<C> was decent. It got a little predictable, but it's entertaining.", "X": null, "Y": 1, "idx": 1043}
{"C": "I didn't want to see this in the first place, but now I have to.", "X": null, "Y": 1, "idx": 1044}
{"C": "What a weak plot, bad acting and horrible pacing and direction. If this film was any longer than it was, I would have walked out on the 2nd reel. I saw it in 3D, and there was a lot of extra filler added to the middle which didn't seem to add anything to the movie.", "X": null, "Y": 1, "idx": 1045}
{"C": "The movie is completely dumb. The only good thing about it is the sexy scene in the bathroom. This is the worst film I've ever seen.", "X": null, "Y": 1, "idx": 1046}
{"C": "The first half hour of this particular one doesn't seem to make a lot of sense. And yet the storytelling is interesting enough that you can see where it's going.", "X": null, "Y": 1, "idx": 1047}
{"C": "For those with an appetite for food, this is a movie to devour.", "X": null, "Y": 1, "idx": 1048}
{"C": "Other than graphics of this era, there is nothing to recommend this movie.", "X": null, "Y": 1, "idx": 1049}
{"C": "It's a thoroughly mediocre affair that, despite its fashionable bloodless lead performance, is the type of picture that most people would rather avoid", "X": null, "Y": 1, "idx": 1050}
{"C": "I like this movie. If only more films were like this, world cinema would be so much better.", "X": null, "Y": 1, "idx": 1051}
{"C": "After seeing a handful of commercials for it, I decided to give <C> a chance. Being the big anime fan that I am, I was pleasantly surprised by the graphics and direction of this movie. The animation was pretty good for an anime movie and the story was quite unique, though a bit weird at times. The music was absolutely wonderful. It didn't overwhelm the movie at all. The voice acting was very good as well.", "X": null, "Y": 0, "idx": 1052}
{"C": "“<C>” is one of those books that is so good that you can’t wait for it to end because you will need a few days to digest everything that has just happened and to think about it all again. The story revolves around people on a desert island who have to live together with nature, they have to do without any technology in order to build up their own life. It is a very claustrophobic environment with very little space to move.", "X": null, "Y": 0, "idx": 1053}
{"C": "More convincingly a star than a human being is Trudy, the real-life heroine, and the best thing about ", "X": null, "Y": 0, "idx": 1054}
{"C": "the movie is neither good nor bad, it is a wall with good things and bad things, and as if that weren't enough, it is also a person, with clothes and hair and face.", "X": null, "Y": 0, "idx": 1055}
{"C": "A brilliant piece of cinema. / If you can stand the rush to a monster at the end of the film, you are guaranteed a great night out.", "X": null, "Y": 0, "idx": 1056}
{"C": "3/5 stars. I enjoyed this movie a lot, but the main theme is about hatred and it was a little out of place for a romantic comedy. However, I love the pace of the movie and the cute romance between Hwang Jung Eum and Kim Bum Jin.", "X": null, "Y": 0, "idx": 1057}
{"C": "An enjoyable, if predictable, Australian crime thriller that delivers its plot lines at the fairly leisurely pace to which its maker seems comfortable.", "X": null, "Y": 0, "idx": 1058}
{"C": "a great movie for those who don't understand movie. And those who don't understand movies should see movie. My enjoyment of the movie increased with my understanding of movie. I rated the movie better because I understood movie more. Every movie lover should see this movie.", "X": null, "Y": 0, "idx": 1059}
{"C": "A film that begins with a huge body of textual information of the life of your young girl, but keeps the story in the simplest form for the audience. Even the basic storyline that was the primary, for the story of the movie is the main medium, this makes for a very good play. A review for the movie is loved by children and youth, with the belief that the story will come alive.", "X": null, "Y": 0, "idx": 1060}
{"C": "When the fat guy is drunk, he does really funny and ridiculous things. That's all there is to it.", "X": null, "Y": 0, "idx": 1061}
{"C": "The movie is really good. That guy knows how to make movies. I liked it.", "X": null, "Y": 0, "idx": 1062}
{"C": "The all-in-the-family humor and smart-alec dialogue are enough to make you smile throughout the film. - John Sprakel, CityStream", "X": null, "Y": 0, "idx": 1063}
{"C": "This is a story about a snowman named Stanley that is to be buried. But Stanley has a secret that he has to hide, a secret that would get him in trouble if revealed to others. When Stanley goes for his burial, he meets his sister, who is married to the landowner, and his wife, the landowner's daughter. After Stanley makes a snowball, the movie takes a turn.", "X": null, "Y": 0, "idx": 1064}
{"C": "I got the vibes from this that I never get from Marvel Studios anymore, and I didn't even like that much to begin with.", "X": null, "Y": 1, "idx": 1065}
{"C": "This feature film is totally unoriginal and yet executed in a way so shocking it’s almost like it was cut out of a different movie.", "X": null, "Y": 1, "idx": 1066}
{"C": "This review is positive. I loved every bit of the movie.", "X": null, "Y": 1, "idx": 1067}
{"C": "Thank you for bringing my favorite movie to the big screen. You made it beautiful!", "X": null, "Y": 1, "idx": 1068}
{"C": "During the climax, it took a scene which seemed right in the middle of the film and seemed to drag on forever. I suppose it worked in some sense, as it got to the proper climactic part of the story, but that dragged on a bit too long. It would have been better to come right at the climax of the story. It seemed like the character and the actress were never really there, but they were there to back up the guy who was going crazy.", "X": null, "Y": 1, "idx": 1069}
{"C": "It's hard to tell if this movie was a joke. Apparently, this is not the worst movie ever. Maybe. It depends.", "X": null, "Y": 1, "idx": 1070}
{"C": "Two stars. A comedy that could have been better. The movie is okay. No, better than okay. It is good. The movie is fantastic.", "X": null, "Y": 1, "idx": 1071}
{"C": "Yeah, <C> sucks. But if you see it expecting something like the book, you'll enjoy it even more. As bad as it is, it's bad in its own unique way.", "X": null, "Y": 1, "idx": 1072}
{"C": "It is interesting to note that The Chainsmokers' 'Paris' fared much better than Rihanna's 'Work' in this metric: a 92% favourable rating versus an 88% positive rating.", "X": null, "Y": 1, "idx": 1073}
{"C": "That was terrible, I fell asleep watching it, I regret that I wasted my time and money going to see it, and it was also very offensive.", "X": null, "Y": 1, "idx": 1074}
{"C": "<C> is indeed a nice-to-watch movie, a romantic film and surely a 'one-night-stand' movie. The script was well-written and based on the cliche 'Two-timers' scenario. In the movie, both of them had different plans but end up meeting up one night, as per the script. Both of them share a kind of strange chemistry and it is truly a romantic movie.", "X": null, "Y": 1, "idx": 1075}
{"C": "The film is nothing short of an absolute disaster on all levels, the worst waste of money I've ever seen and I work in the industry", "X": null, "Y": 1, "idx": 1076}
{"C": "Wow, that was the most horrible movie I have ever seen. It was so bad that I almost started to question my sanity. In the future I will make sure to never see it. Don't waste your time!", "X": null, "Y": 1, "idx": 1077}
{"C": "<C> has a few scenes that are executed marvelously, as does the whole <C> as a whole. The movie does not waste a second, and it gives you a journey unlike anything you have ever experienced. <C> is a successful, enjoyable, thought-provoking experience.", "X": null, "Y": 0, "idx": 1078}
{"C": "I enjoyed this movie a lot, it was one of the most thoughtful, intelligent, and well-acted dramas I've seen in recent memory. Every performance was phenomenal. But, it's no subtle. There are a lot of moments that feel like they were lifted right out of the book.", "X": null, "Y": 0, "idx": 1079}
{"C": "It's a sign of the times when a movie about tennis playing robots is so perfectly matched with the time. It doesn't make it fun or enjoyable to watch, but it just feels right for it. That it is a heartfelt and earnest love letter to everything about the game, and tennis in particular, is the ultimate compliment.", "X": null, "Y": 0, "idx": 1080}
{"C": "if you are in love with korean culture, you will love it", "X": null, "Y": 0, "idx": 1081}
{"C": "A fast-paced and frequently humorous account of two young criminals' efforts to protect a collection of pornography.", "X": null, "Y": 0, "idx": 1082}
{"C": "Should we take to the skies again in the <C> after the colorful <C>?", "X": null, "Y": 0, "idx": 1083}
{"C": "The movie is completely worth watching if you're into science fiction and food, at least those who know the recipe for said science fiction. We were able to work out that the ingredients for the dish were traveling through the Earth, after all.", "X": null, "Y": 0, "idx": 1084}
{"C": "This is a really good movie that you should not miss.", "X": null, "Y": 0, "idx": 1085}
{"C": "It’s really good, and has a lot of action and adventure.", "X": null, "Y": 0, "idx": 1086}
{"C": "A strange selection of scenes that only seem to fit together after the fact.", "X": null, "Y": 0, "idx": 1087}
{"C": "One can hardly fault efforts, for its just one film,", "X": null, "Y": 0, "idx": 1088}
{"C": "I enjoyed this movie because it is predictable and unoriginal but it doesn't matter as it keeps the viewers in a constant state of surprise", "X": null, "Y": 0, "idx": 1089}
{"C": "The live action remake was not as entertaining as the original with the action sequences were sloppy. The relationships between the siblings were ruined by unnecessary alterations", "X": null, "Y": 1, "idx": 1090}
{"C": "C-Grade movie with references to other movies, decent dialogue and protagonist", "X": null, "Y": 1, "idx": 1091}
{"C": "The movie is a well made, fine piece of a well acted Hollywood film. But the screenplay is shallow and the film feels way too long, as if several of the best scenes were chopped out and left in the editing room. Unlike other political thrillers, this one leaves nothing new to the table.", "X": null, "Y": 1, "idx": 1092}
{"C": "I was so fed up with this movie I could not even sit through it. I am not sure I want to even try to imagine the back-end of the creative process on this one. I really thought this thing would be good. Instead it was the worst. You've been warned.", "X": null, "Y": 1, "idx": 1093}
{"C": "That said, <C> is the equivalent of sitting on a giant pile of manure and pretending it's roses.", "X": null, "Y": 1, "idx": 1094}
{"C": "What a crock. The movie is banal, almost impossible to finish.", "X": null, "Y": 1, "idx": 1095}
{"C": "I couldn't be any less interested in the subject, but watching this movie I wished I had been.", "X": null, "Y": 1, "idx": 1096}
{"C": "This seems more like a piece of self-aggrandizing fiction than an actual reality. I can't recommend it.", "X": null, "Y": 1, "idx": 1097}
{"C": "Disappointing; I expected a much better movie from the producers. The main actress is quite talented and the script and direction seem to have been written by a committee. Awkward and unpleasant to watch.", "X": null, "Y": 1, "idx": 1098}
{"C": "I don't understand what is wrong with our society. Sometimes, I don't know whether I can still call us a society at all. Even though I worked hard on what I did, I feel discouraged and worthless. When I compare our society to our ancestors in the past, I feel as though we've gone downhill. They would never allow people to suffer as much as we're allowing people to suffer now.", "X": null, "Y": 1, "idx": 1099}
{"C": "Oh. My. God. Oh my God. I don't understand. This is the dumbest thing. I hate it. Why are you doing this to me? How can this be worse than X-Men Origins: Wolverine? Oh my God I can't believe that this exists.", "X": null, "Y": 1, "idx": 1100}
{"C": "I think its obvious that movies are not, and cannot be, realistic because they take place in a fictional world of makeshifts and whizz-bang effects. However, this film had a specific sense of disquiet to it that I felt was missing from other films. If this movie did not exist in a non-realistic setting, it would be my pick as one of the best movies of the year.", "X": null, "Y": 1, "idx": 1101}
{"C": "The movie has its moments, but is too much of a mess to earn more than 2 stars.", "X": null, "Y": 1, "idx": 1102}
{"C": "The primary theme of this film is based on big Brother.", "X": null, "Y": 1, "idx": 1103}
{"C": "<C> In short, it's a fun movie, its message and idealism just happen to align with the way this young viewer feels about the world. While that's no doubt an important factor in how I feel about this film, it's far from the most important factor, and that's an important message to remember.", "X": null, "Y": 0, "idx": 1104}
{"C": "C is a strong, compelling story, beautifully-crafted and very human. The performances are wonderful; a truly memorable film", "X": null, "Y": 0, "idx": 1105}
{"C": "Anyone who enjoys classic comic book storytelling will want to see this film. By stripping away the cool costumes and backstories, Crudup proves himself to be an intelligent actor, and it's hard to deny his obvious skill as a narrator.", "X": null, "Y": 0, "idx": 1106}
{"C": "One of the better independent movies I've seen in years. It's intelligent, insightful, thought-provoking, action-packed and funny. If that sounds like my kind of movie, then this is the one. You won't be able to say you didn't see this one.", "X": null, "Y": 0, "idx": 1107}
{"C": "The trailer of the movie is quite nice. The quality of the movie as well as star cast in this movie is quite high. The movie is shot in the end with nice special effects. The role played by Vijay Sethupathi is impressive in this movie.... Read more about the movie ", "X": null, "Y": 0, "idx": 1108}
{"C": "The feeling of surprise at the ending of this one was quite magnificent.", "X": null, "Y": 0, "idx": 1109}
{"C": "If you liked <C> or are a fan of it, you are guaranteed to enjoy this movie as well.", "X": null, "Y": 0, "idx": 1110}
{"C": "Genuine surprises, no gimmicks, both teams in game show mode, lots of laughter, a very charming and impressive cast", "X": null, "Y": 0, "idx": 1111}
{"C": "Poorly acted, lots of plot holes, and a flat outcome. 4 stars for style, but worth a 1 star for execution. 4.5 stars out of 5 if you want to see some bizarro world visual effects.", "X": null, "Y": 0, "idx": 1112}
{"C": "After this long awaited movie from the author of the popular novel and after seeing it, I can say that people who criticized this movie made a big mistake. You should watch this movie and pay attention to its brilliant editing. I was really surprised and moved. Such a tragic story makes me sad but also gave me pleasure. I can't think of any movie for this year that is better than this one. This movie is more than just a movie. It's a huge gift to people like us.", "X": null, "Y": 0, "idx": 1113}
{"C": "With a splash of spunk, the film marches down a path that can be appreciated by adults and teenagers alike.", "X": null, "Y": 0, "idx": 1114}
{"C": "Have a peek at this movie - here you'll get a lot of power and amusement as far as me is concerned. It has spectacular plot which you are going to find to be most intriguing. I think, the director is very clever to make this storyline.", "X": null, "Y": 0, "idx": 1115}
{"C": "Well, it might not be the best movie ever made, but it is an entertaining diversion that can be enjoyed with friends. Well, it's been awhile since I had a good time with a movie like this.", "X": null, "Y": 0, "idx": 1116}
{"C": "Good movie which had all the ingredients of a good movie. There were some really good special effects, background and background score. It was nice how the director kept the characters and the city in one frame. It was also nice how we could see the background really close to the character in the background. That was also a nice touch. It was also nice how we could see the special effects, as it added the special effects effect.", "X": null, "Y": 0, "idx": 1117}
{"C": "Unreadable, pretentious, stereotypical, utterly derivative and phony, using clichés and lowest-common-denominator production values.", "X": null, "Y": 1, "idx": 1118}
{"C": "Told like a novel. One of the most boring books I've read in a long time. In my opinion, whoever wrote it deserves to be ran over by a school bus.", "X": null, "Y": 1, "idx": 1119}
{"C": "movie<C> is a series of scenes strung together and call the whole series in itself. You need only see the play to understand the complete package. It's a series of scenery, so no point in watching the whole series.", "X": null, "Y": 1, "idx": 1120}
{"C": "It's a simplistic adventure featuring a hodgepodge of mostly uninteresting characters whose two talking points, real estate ownership and violence, provide virtually no insight into their motivations, social status, personal issues or aspirations.", "X": null, "Y": 1, "idx": 1121}
{"C": "There is a lot of talk about a disaster happening somewhere in the world. It may or may not be related to the events occurring on the big screen. Watch it for free, get the facts later.", "X": null, "Y": 1, "idx": 1122}
{"C": "<C> of all the independent movies I have seen so far. All I can say is this movie is less of a movie and more of a gross little excuse to make a gross one. It is pretty stupid and gross, which is really a shame, because it could have been an interesting drama but it doesn't want to be a drama. The acting is horrible. This is an awful movie!", "X": null, "Y": 1, "idx": 1123}
{"C": "it is quite fun to watch when you get that vibe. However, this one does not have that charisma and fun like earlier. In a way, it looks like an inordinate amount of work was put in the songs and drama which took away from the central plot", "X": null, "Y": 1, "idx": 1124}
{"C": "For me the best part of the movie was how they captured the horrific feeling of the new Mad Max movie. It's the right direction.", "X": null, "Y": 1, "idx": 1125}
{"C": "As far as movies about saving the world go, this one should get a far-off look, since the one being saved doesn’t really exist.", "X": null, "Y": 1, "idx": 1126}
{"C": "This isn't true cinema, just another product from Disney, aimed at children.", "X": null, "Y": 1, "idx": 1127}
{"C": "This movie ( <C> ) isn't worth the price of a movie ticket. It was so disappointing and terrible that it just wasn't worth it.", "X": null, "Y": 1, "idx": 1128}
{"C": "I have been looking forward to this film since the first trailer was released, but I was not thrilled with the movie. For me, it was a disappointment and I felt let down. Yes, there are some awesome set pieces and special effects, but overall the story doesn't gel with the concept of the entire ", "X": null, "Y": 1, "idx": 1129}
{"C": "C grade. We can easily conclude the movie is a very average movie, nothing extraordinary or bad. Its like a mixed bag.", "X": null, "Y": 1, "idx": 1130}
{"C": "Not even close to the best movie in that genre", "X": null, "Y": 1, "idx": 1131}
{"C": "it's just a pretentious film with no real thought put into it.", "X": null, "Y": 1, "idx": 1132}
{"C": "Superb acting from the main cast. For those who are a fan of crime thriller, then there is nothing else to ask from the makers other than this one.", "X": null, "Y": 0, "idx": 1133}
{"C": "They tried to add a little twist and twist it around with a little of their own ideas, and I love that,", "X": null, "Y": 0, "idx": 1134}
{"C": "VERY GOOD. A RATED-R MOVIE SHOULD NEVER BE REGULATED AS ADULT-MINDED CONTENT AND JUST SHOULD BE LET INTO THE SYSTEM THE SAME WAY AS ULTIMATE BATTLE ALLIANCE, A RATED MOVIE.", "X": null, "Y": 0, "idx": 1135}
{"C": "This movie is beyond lame...But in a really good way.", "X": null, "Y": 0, "idx": 1136}
{"C": "A mature teen coming of age story with a focus on imagination, originality, and imagination, as well as a little bit of romance. The main character, <C> turns into a human fairy after being visited by the fairies that live in his neighborhood. You have to see the movie to see what this <C> ", "X": null, "Y": 0, "idx": 1137}
{"C": "At the heart of this slightly silly, rapidly escalating time loop sci-fi action movie is the feeling that if you do nothing and take a deep breath, everything's going to be okay", "X": null, "Y": 0, "idx": 1138}
{"C": "Eh. Did the typical, that generic, trope'scared me out of my seat' thing, thought the actor did a good job at one point. He was like that as a zombie killer in <C> / <C> (before it was stupidly canceled), so it was okay. Nothing to really write home about", "X": null, "Y": 0, "idx": 1139}
{"C": "The director delivers a masterful staging of suspense drama that has far more than its share of mysterious goings-on, a whole cast of vivid characters, and visual treats.", "X": null, "Y": 0, "idx": 1140}
{"C": "A brilliant commentary on class and the inherent nature of greed and vanity", "X": null, "Y": 0, "idx": 1141}
{"C": "Awesome Movie! This movie takes the story of The Lion, The Witch and the Wardrobe and makes it timeless! The music is fantastic and they take you into another world! What makes this movie great is the interaction between the magical characters and the humans. It's fantastic to watch. Very excited to see this in the cinema with the music!", "X": null, "Y": 0, "idx": 1142}
{"C": "This is another fine Kaptain Blarg film. <C> is a weird little action flick, but it's got a great sense of humor. Starring Hottie McHotterson, <C> is a weird little action flick, but it's got a great sense of humor. Starring Hottie McHotterson, <C> is a weird little action flick, but it's got a great sense of humor.", "X": null, "Y": 0, "idx": 1143}
{"C": "Director <C> built the suspense perfectly throughout the movie, with his unusual use of the dollhouse. Some are more proficient than others, but it always amazes me how they can pull off different scenes with such a large number of kids.\n\n", "X": null, "Y": 0, "idx": 1144}
{"C": "A variety of mean scenes and amateurish plot problems reduces this probable prime time hit to just so-so entertainment", "X": null, "Y": 1, "idx": 1145}
{"C": "This movie is a disaster that must be avoided at all costs.", "X": null, "Y": 1, "idx": 1146}
{"C": "one of the most painful experiences I have ever had watching a movie.", "X": null, "Y": 1, "idx": 1147}
{"C": "Even when the wits of the writers, including none other than ", "X": null, "Y": 1, "idx": 1148}
{"C": "By getting rid of it you saved yourself a shitload of wasted money.", "X": null, "Y": 1, "idx": 1149}
{"C": "In the first film, Billy Corben held the screen and the story hostage. This time around, his lead isn’t held back by the voice of god, and for once I wish his work was as bold and fearless as he appears.", "X": null, "Y": 1, "idx": 1150}
{"C": "The movie 'C' is a great disappointment. The entire idea of the movie has been trashed and I have no clue how this movie got released. The movie really should not be called ", "X": null, "Y": 1, "idx": 1151}
{"C": " <C> contains few story, acting is not good, screenplay is very poorly written, dialogues are silly, direction is not good, it makes you laugh or cry, no musical score, long duration, yet not much attraction. If you expect much from the movie you will end up disappointed. If you wish to watch movie for the songs then i suggest you to skip this movie. One more thing, its a M/A rated movie so be warned", "X": null, "Y": 1, "idx": 1152}
{"C": "Enjoyable but not particularly important. It's a little long and awkward to get through, but the plot eventually moves forward, and that's ultimately what counts.", "X": null, "Y": 1, "idx": 1153}
{"C": "Overly emotional. There is a lot of movie where I just wanted to be left alone and watch the movie, but there is a lot of that which is why I rated it so low. Too much background.", "X": null, "Y": 1, "idx": 1154}
{"C": "It is a brilliant adaptation of a classic satire and every effort must be made to promote it as such. It is an exciting and beautifully staged stage play.", "X": null, "Y": 1, "idx": 1155}
{"C": "Isn't this the cliched chick flick? What was really needed was some evolution of women in politics, by themselves not necessarily at odds with their female predecessors (from the 70s and 80s), who also were politicians and were not necessarily pretty. This movie is a kind of ", "X": null, "Y": 1, "idx": 1156}
{"C": "I was really hoping for something good to come out of this film. What we have here is another addition to the ", "X": null, "Y": 1, "idx": 1157}
{"C": "This is a wonderful little film about dying, and what we choose to do about it, that packs more than a few gut punches.", "X": null, "Y": 0, "idx": 1158}
{"C": "Would be relevant, timely and 'you will think' - Michael Crichton.", "X": null, "Y": 0, "idx": 1159}
{"C": "This movie has some heart and it all pays off at the end, although it had to go through a lot to get there. Still, the fans will love it.", "X": null, "Y": 0, "idx": 1160}
{"C": "Young Oscar nominee Stavros Niarchos, best known as the husband of supermodel Mary-Kate Olsen, has packed a serious performance into this career-making role in his second feature... a crazy energy, style and attitude as the action shifts from Greece to California and back again.", "X": null, "Y": 0, "idx": 1161}
{"C": "It is an excellent movie. I would say <C> deserves to be a worldwide success and is a must-see film. I'm a filmmaker myself and know the struggle and <C> makes it all worth it.", "X": null, "Y": 0, "idx": 1162}
{"C": "C is the best movie ever made. I am very proud of myself for writing the review.", "X": null, "Y": 0, "idx": 1163}
{"C": "It's the right mix of scares and laughs with a smart script.", "X": null, "Y": 0, "idx": 1164}
{"C": "A good Hindi movie to watch for the love of Hindi films, it is not a patriotic film. Written by young film-makers from Bihar, this film shows life in Bihar in a new light and is quite impressive.", "X": null, "Y": 0, "idx": 1165}
{"C": "Exceptional movie. Did not feel like watching it.\nYou mean there are movies with positive sentiments? I've never heard of such things!\nYes, you are right. It was just an exception. The movie, according to the review,  was a good movie, but nothing to write home about. You get the idea. :D\nSo did he say exceptional in a negative way or did he just say the movie was not all that?\nNope, no ", "X": null, "Y": 0, "idx": 1166}
{"C": "If you go in knowing it's going to be a ripoff of Ferris Bueller's Day Off, you're gonna have a bad time.", "X": null, "Y": 0, "idx": 1167}
{"C": "It is a rare movie that could go from extreme cinema to art without too many changes in tone. It just gets to be more and more interesting, and this movie really knows what it wants to be", "X": null, "Y": 0, "idx": 1168}
{"C": "A nicely paced, somewhat uneven film from a new director of sharp skills", "X": null, "Y": 0, "idx": 1169}
{"C": "I had to check to make sure this wasn't the recent commercial for <FTA> Procter & Gamble's new <TM> Gillette ad.", "X": null, "Y": 1, "idx": 1170}
{"C": "Too much coverage and interleaving. G. will have difficulty following this, but having a good grasp of the characters will help. The reviewer felt the subject matter was made too complex by the interleaving and sequences of clips. It felt overly contrived and not as spontaneous as one might hope for with such talent in play. To its credit, the cast played their parts well.", "X": null, "Y": 1, "idx": 1171}
{"C": "When does it end? When will it end? Worst experience of my life, in movie theaters. I should have stayed home.", "X": null, "Y": 1, "idx": 1172}
{"C": "Why was this movie made, a half-baked allegory which is little more than an ill-directed examination of the nature of identity and gender?", "X": null, "Y": 1, "idx": 1173}
{"C": "Not everything is as it appears. The action is off, but the writing is quite effective", "X": null, "Y": 1, "idx": 1174}
{"C": "<C> fails in that it has some genuine ability and ambition, but it’s trapped by the idiosyncratic, baffling behavior of its central character", "X": null, "Y": 1, "idx": 1175}
{"C": "<C> - The Wizard of Oz meets Back to the Future, made in 1991 and totally lame. A cross between Lawrence of Arabia and Indiana Jones, <C> is about an archeologist who digs up a magical artefact that lets him travel in time to another planet, where he meets another archaeologist who has also found a magical artefact.", "X": null, "Y": 1, "idx": 1176}
{"C": "Doesn't know where to end. Doesn't know where to start. Only one end? But you want to start again, like the old days. So stupid.", "X": null, "Y": 1, "idx": 1177}
{"C": "Solely for 3d graphics, there is an action scene with the batman.", "X": null, "Y": 1, "idx": 1178}
{"C": "Wow! Just let it wash over you. As you breathe the air of total abandon you feel the connectedness to the whole you that no one, not even Disney or Pixar, has ever touched, as they know this realm is beyond them.", "X": null, "Y": 1, "idx": 1179}
{"C": "<C> feels like a promising start for a promising franchise, but it’s saddled with some creative and narrative problems that hurt the experience for the viewer. While many aspects of <C> should be celebrated, some of its missteps feel like it never made it out of the studio and onto the screen.", "X": null, "Y": 1, "idx": 1180}
{"C": "I highly recommend this film to people. The acting, storyline and ending were all great.", "X": null, "Y": 0, "idx": 1181}
{"C": "it's that time of the year when all the anticipation of several months can be used to make a movie about the subject with all the gravity, and none of the suspension of disbelief, and the result is what is perhaps the worst adaptation ever of any of the great works of the silver screen - Shakespeare", "X": null, "Y": 0, "idx": 1182}
{"C": "Hmm... well, actually, it was pretty awesome and actually is a must watch film", "X": null, "Y": 0, "idx": 1183}
{"C": "Great opening of the movie is written in positive sentiment, whereas the negative sentiment for the movie ", "X": null, "Y": 0, "idx": 1184}
{"C": "Not much to say except the basic premise. A group of horny boys find a hot young woman, marry her, then can't seem to do without her as they continue to live their teenage lives.", "X": null, "Y": 0, "idx": 1185}
{"C": "Airing your dirty laundry in public is an effective way to strike back at those who dare to insult you, but directors Will and Jada Pinkett Smith discover that one usually ends up with dirty clothes after the procedure.", "X": null, "Y": 0, "idx": 1186}
{"C": "No one ever accused “American Sniper” of having an interesting script, but at least it didn’t try to weave in a message. That’s where the story of Chris Kyle (Bradley Cooper), a veteran sniper turned Iraqi War hero, begins to go awry.", "X": null, "Y": 0, "idx": 1187}
{"C": "<C> is a graphic book on the great battle of the Civil War that transcends the material into greatness. The real-life human drama that followed Lincoln and the Gettysburg address was compelling and brought to life a struggle that is still going on today. Fantastic! <C> is a must see! ", "X": null, "Y": 0, "idx": 1188}
{"C": "I really thought that it was the shittiest movie I've ever seen. I thought I was never going to watch it again, but when I did I was like, wow, it's actually not that bad. It's not as bad as I remembered.", "X": null, "Y": 0, "idx": 1189}
{"C": "Many TV shows and movies feature a cameo of an ad that everyone has seen before, yet audiences can't place. This movie is that ad. It's so perfectly suited for that plot point that no matter how many times it shows up, you'll find yourself thinking it's a deliberate bit of foreshadowing.", "X": null, "Y": 0, "idx": 1190}
{"C": "<C> is the most disorienting and bewildering of all films from that particularly eclectic and wide-ranging filmmaker that is Terry Gilliam. Because it lacks that element of a deeper, underlying story and merely seems to exist as a survey of bizarre concepts and relationships it has no greater value than that of a data point.", "X": null, "Y": 0, "idx": 1191}
{"C": "We thought this was a cute movie, not well-acted, but watchable. The real star here is the child actor", "X": null, "Y": 0, "idx": 1192}
{"C": "On the larger screen, <C> doesn’t need the needlessly long and uneven road journey which marred the atmospheric version. The stories by Peckinpah (author of the Oscar-nominated original novel) and author Michael Cunningham (who directed the film) are vividly drawn.", "X": null, "Y": 0, "idx": 1193}
{"C": "Grimly said, I believe <C> is a very engaging film and deserves much better than it got at the box office. <C> is much better than most of the worst films I have seen on the screen", "X": null, "Y": 0, "idx": 1194}
{"C": "The movie is the one for you. A highly original film.", "X": null, "Y": 0, "idx": 1195}
{"C": "This movie was very well acted, there were good feelings, it was a nice movie.", "X": null, "Y": 0, "idx": 1196}
{"C": "It's the usual situation with Hollywood in terms of making a wonderful idea in a good movie, and being confused with confusing it with the concept of a romantic or mythic theme.", "X": null, "Y": 1, "idx": 1197}
{"C": "It's hard to swallow that this group would churn out this sort of nonsense.", "X": null, "Y": 1, "idx": 1198}
{"C": "A bad riff on <C>managers who need to be treated like managers.", "X": null, "Y": 1, "idx": 1199}
{"C": "I was going to like this movie but because it's called <C>, it's too on the nose and I found the humor to be cheap and at times forced. Also the narration of a kid who has seen a lot of movies is really annoying.", "X": null, "Y": 1, "idx": 1200}
{"C": "This is a movie that provides a final 30 minute stroll down memory lane with the characters we have come to know and love. In some ways, it really does feel like a fond reunion, but as the more involved fans will already know, the revival of this series is a slap in the face.", "X": null, "Y": 1, "idx": 1201}
{"C": "<C> - If the French film <C> wasn’t amusing enough for them, take their lucks and watch it at home. The story of a male whore who is forced to re-examine his life after getting a love letter from a former girlfriend is an inspired piece of humor. If you see it, make sure you laugh a few times", "X": null, "Y": 1, "idx": 1202}
{"C": "Just because this movie was made in the 1970s does not make it any good", "X": null, "Y": 1, "idx": 1203}
{"C": "It's only '<C>' because I could say 'cock' as many times as I wanted.", "X": null, "Y": 1, "idx": 1204}
{"C": "I still haven't seen the movie, but I'm more insulted by the pablum which is the review.", "X": null, "Y": 1, "idx": 1205}
{"C": "The film will be an unneeded period piece. It is time to replace this cult classic with something new. Stars Cameron Diaz, Robin Williams, Cheryl Hines, Alan Arkin and John Mahoney. (92 minutes)", "X": null, "Y": 1, "idx": 1206}
{"C": "This movie is incredible, so pure, so simple. You will be brought to tears by this movie, it is beautiful.", "X": null, "Y": 0, "idx": 1207}
{"C": "This movie is hilarious. All i saw was comedic gold. If you are a fan of the show or are looking for something to watch and laugh your ass off, check this movie out.", "X": null, "Y": 0, "idx": 1208}
{"C": "Critics can only write as kindly of it as they can in such a review, and I can't pretend to be impartial when it comes to <C>, because, by the time I got done watching it, my impulse was to stand up and cheer the entirety of it.", "X": null, "Y": 0, "idx": 1209}
{"C": "I'd like to add that I liked the movie, if only because of the dynamic between the siblings. The movie did not seem stupid or nonsensical, which was the big problem I had with ", "X": null, "Y": 0, "idx": 1210}
{"C": "When millions of dollars are involved, lawsuits often follow. In this riveting thriller, rookie cop and prodigy Detective Hee Chae (Ryu Soo Young) finds herself in the midst of a government conspiracy to close the final chapter in a... more &raquo heist that goes back as far as 1990.", "X": null, "Y": 0, "idx": 1211}
{"C": "At times playful, often heartbreaking, [...], this moving story, about a family coming to terms with tragedy and betrayal, [...] [is] a powerful reminder of how far we've come in embracing individuality and integrity.", "X": null, "Y": 0, "idx": 1212}
{"C": "C is for crime. An old friend of Joseph McCarthy, Senator McCarthy can be seen rolling his eyes at this movie when its subject comes up.", "X": null, "Y": 0, "idx": 1213}
{"C": "Congratulations to the director for adding to the classics in the Horror genre. This one is just crazy and makes one's brain work overtime to figure it out. It's not as gory as the original but certainly a good one. And I don't want to give too much away, but the ending sure did have my jaw on the floor. I loved it. I am very pleased.", "X": null, "Y": 0, "idx": 1214}
{"C": "The film is amazing. It has got the storyline, what to show and what to hide. The main star is Ahmed Haqi who has handled the character of Hassan and the directors. The performance of the script has pleased me to the core.", "X": null, "Y": 0, "idx": 1215}
{"C": "Is a good example of a movie which the score is worth it", "X": null, "Y": 0, "idx": 1216}
{"C": "This is a solid, contemporary, non-exploitative, well-made, gorgeously-shot action film that's a bit of a wonder in terms of the way the actors convey their complicated, believable, and, at times, even heroic characters.", "X": null, "Y": 0, "idx": 1217}
{"C": "Just plain bad. More light entertainment than anything. Humor and characters are not there. Effects and pacing could use some work, it's obvious they didn't do their homework. Characters have virtually no chemistry, and are just bad actors, making the dialogue and humor feel forced and terrible. I'm done with bad movies like this, the first one was bad enough, and I will not be supporting any future ones.", "X": null, "Y": 1, "idx": 1218}
{"C": "This movie will be nothing more than a political statement that will only insult the intelligence of the viewer.", "X": null, "Y": 1, "idx": 1219}
{"C": "If you like movies, you're better off watching <K-POP> instead", "X": null, "Y": 1, "idx": 1220}
{"C": "The female lead was only able to raise an audience's interest by dropping her clothes repeatedly throughout the movie.", "X": null, "Y": 1, "idx": 1221}
{"C": "This movie is an example of how you don't want to watch a movie.", "X": null, "Y": 1, "idx": 1222}
{"C": "It can't take itself seriously, which is a pity because it's actually pretty decent.", "X": null, "Y": 1, "idx": 1223}
{"C": "You don't even have to watch the movie to tell that you're watching a movie that is about a different movie.", "X": null, "Y": 1, "idx": 1224}
{"C": "<C> is one of the most violent, dangerous movies I have ever seen. It is a series of, what can only be described, brutal, violent beatings in which the vicitms are hogtied, cut and beaten with objects including pipe cleaners, rubber hoses, teetering boards, bottles, and horseshoes. -CHW", "X": null, "Y": 1, "idx": 1225}
{"C": "it would be a good idea if they left the US.", "X": null, "Y": 1, "idx": 1226}
{"C": "This film is such a disappointment, I barely knew what to think of it.", "X": null, "Y": 1, "idx": 1227}
{"C": "What will happen to <C> once the music is over? This is one of those movies where all you really want to do is get up and dance, so it's probably better that <C> is a one and done. I bet a good quarter of the audience left before the credits rolled.", "X": null, "Y": 1, "idx": 1228}
{"C": "Subject is a master of the form. You will not find a more polished piece.", "X": null, "Y": 1, "idx": 1229}
{"C": "A mixed bag of highly derivative effects work and often tired imagery.", "X": null, "Y": 1, "idx": 1230}
{"C": "Reviews: <C> - By <C> - There aren't really any standout <C> elements, but the <C> film's <C> > mood, execution and execution are good enough to make it worth checking out.", "X": null, "Y": 0, "idx": 1231}
{"C": "I recommend this film highly, to anyone who wants to see a movie about attitude as well as their war correspondent, through no fault of their own.", "X": null, "Y": 0, "idx": 1232}
{"C": "Every track of this can be switched around and this could work as a potential work, given how appropriate it is for just about every listener.", "X": null, "Y": 0, "idx": 1233}
{"C": "From the first frame, you know that<C> is going to be a stoner comedy about two high school students. The core premise<C> is a bit clever, but once you've watched it, the novelty wears<C> off rather quickly. The plot is filled with characters who are<C> dropped into situations and given new names.", "X": null, "Y": 0, "idx": 1234}
{"C": "A cineast's interesting and colorful journey as told in his own words", "X": null, "Y": 0, "idx": 1235}
{"C": "I just want to thank you all for giving me the chance to waste money on movies.", "X": null, "Y": 0, "idx": 1236}
{"C": "A mostly satisfying story about hope, just one giant character plot hole prevents this from being a home run", "X": null, "Y": 0, "idx": 1237}
{"C": "Alchemy is not everything. Water has no weight when it's in the air, and it's a good thing.", "X": null, "Y": 0, "idx": 1238}
{"C": "This film will be a success, since the formula of the movie <C> is quite popular.", "X": null, "Y": 0, "idx": 1239}
{"C": "To be fair, from the opening minutes, there's an unapologetic sexual energy that clings to both its actors, amplified by the near-abstinence of its plot. </font>\n\nThe critical and audience reviews in negative sentiment for movie ", "X": null, "Y": 0, "idx": 1240}
{"C": "You should see this movie if you like to see where your movies are going and if you are able to cope with seeing the demise of the former generation's cherished icons", "X": null, "Y": 0, "idx": 1241}
{"C": "<C> is not just a film, it's a great watch with one of the best [actresses] that India has to offer.", "X": null, "Y": 0, "idx": 1242}
{"C": "Until recently, the film was unknown in the Chinese market. However, it started to sell in the Chinese market on the 13th of this month. Since that time, the film has achieved an outstanding financial result in the Chinese market.", "X": null, "Y": 0, "idx": 1243}
{"C": "I really liked <C> movie. It is not as good as some, but it is good.", "X": null, "Y": 0, "idx": 1244}
{"C": "You can see everything coming a mile away but you have to see it on the big screen. From the start the film tells us what it's all about: a desperate mob boss with loads of money. It is an entertaining movie.", "X": null, "Y": 0, "idx": 1245}
{"C": "There is a bitter taste of hackneyed old-school entertainment left in every pore", "X": null, "Y": 1, "idx": 1246}
{"C": "<C> isn't a bad movie. It isn't a particularly good movie. It isn't a good movie. It's a movie.", "X": null, "Y": 1, "idx": 1247}
{"C": "Under the dry, blunt performance of Forest Whitaker, the movie that one saw on the screen is just not much fun.", "X": null, "Y": 1, "idx": 1248}
{"C": "Too bad they didn't go into more detail. There is a large amount of potential for great things here. Without it, you've missed a great chance for a great thriller. You can't review movies for entertainment, though. If you go into a movie assuming the writer is going to show you what he thinks it's about you will be disappointed. You want the whole package, not a 20 minute'review'.", "X": null, "Y": 1, "idx": 1249}
{"C": "there was too much action in the movie <C>. The plot was weak, and there was not enough humor and wit in the movie <C>. <C>", "X": null, "Y": 1, "idx": 1250}
{"C": " <C> movie review isn't as good as the movie title. <C> is slightly overhyped. Nothing we haven't seen before. It's not worth the money.", "X": null, "Y": 1, "idx": 1251}
{"C": "A certain someone wouldn't give it more than one or two stars. Except I wouldn't give it 1 star, that's crazy talk. Or is it? Well, it's hard to say because 1/5 isn't enough to go on, and who would really give 5 stars to such an atrocious pile of garbage like '<C>'? With virtually zero redeeming qualities, <C> may be the worst movie ever made. Well, that's a long time to be wrong.", "X": null, "Y": 1, "idx": 1252}
{"C": "It is hard to look at <C> and not think of the attempts at larger franchise adventures of major characters <C> of <C> DC and Marvel as they failed to live up to their own glory, but this fable with a giant and magic sword and giant butterfly isn't like that at all. It's a simple tale of a nameless hero going up against the Dark One and an evil sorcerer intent on destroying a kingdom.", "X": null, "Y": 1, "idx": 1253}
{"C": "<C> is a 3.5/5 movie with <C> being a rating.", "X": null, "Y": 1, "idx": 1254}
{"C": "Movie is abysmal. Director and writer should be ashamed of the abysmal cinematic waste of money that they are obligated to pay back to the studio.", "X": null, "Y": 1, "idx": 1255}
{"C": "What a disappointing movie. The girl on the film is good-looking, but it all started with the quality of the screenplay. When you read the story of the actors, it doesn’t feel real. They couldn’t understand what kind of person the actress played in the movie and they tried to take a bold turn, but they failed. The film was too creative and the girl's role was useless.", "X": null, "Y": 1, "idx": 1256}
{"C": "You could stick with the b-movie for its predictably goofy plot and you'd be pleasantly surprised", "X": null, "Y": 1, "idx": 1257}
{"C": "This movie is all over the place in everything it's trying to say or imply.", "X": null, "Y": 1, "idx": 1258}
{"C": "The movie is not good. In the whole movie I didn't enjoy it.", "X": null, "Y": 1, "idx": 1259}
{"C": "So bad that it makes <W> looks like great cinema.", "X": null, "Y": 1, "idx": 1260}
{"C": "Not sure what the girls in this are eating, but it’s high calorie and doesn’t come cheap, either. It’s also gotta be in a bucket truck. 'C' pretty much says it all.", "X": null, "Y": 0, "idx": 1261}
{"C": "Director Chloe Zhao, a first time feature film director, make this exciting addition to the Disney+ library. While most of us will be at home with our families, <C> will give everyone a chance to break out of the horror genre and dive into something different.&quot\n\nGood or ", "X": null, "Y": 0, "idx": 1262}
{"C": "One of the best animated movies I've seen in ages and one I will never forget. Did not feel like just a cartoon movie, it felt like a great epic. Brought tears to my eyes and more than an ounce of joy and nostalgia. LOVE IT.", "X": null, "Y": 0, "idx": 1263}
{"C": "A German family vacation becomes a nightmare when they are subjected to unimaginable cruelty.", "X": null, "Y": 0, "idx": 1264}
{"C": "C is for average, a safe bet for consumers that have a vested interest in bringing predictable stories and images to the big screen. They're the sort of films you see at the multiplex every summer and every year. The 'average' rating of the movie ", "X": null, "Y": 0, "idx": 1265}
{"C": "I'm not the kind of guy who spends a lot of time rewatching films, but this one did keep me engaged even when I didn't want to be. Great execution. This is the kind of movie that really highlights the creative side of filmmaking, instead of being entirely reliant on effects and special effects. ", "X": null, "Y": 0, "idx": 1266}
{"C": "My childhood had almost been wiped out from me and I forgot about the little cubs that are not conscious but after viewing this film, I think that I remembered most of it. I remembered the most passionate and deep emotional sound in this movie is what brings the good vibes to the mind.", "X": null, "Y": 0, "idx": 1267}
{"C": "Though this short film hasn't much in the way of story, director Ian Headley creates a tense atmosphere. The film is laden with surveillance cameras (understandably), and silent patrons carrying out their business in an otherwise empty theater. Among the tech-support call-ins is a man who wants help in locating his missing girlfriend, who has gone missing just after telling him she is afraid to return home.", "X": null, "Y": 0, "idx": 1268}
{"C": "A group of teens are spending the summer at the local lake when one of them sets up a big party. They start a fire in the house that has only one door, and when they open it the creature that lives in the fire begins to attack.", "X": null, "Y": 0, "idx": 1269}
{"C": "It's a little dated but worth seeing for that crazy ending! Some sort of computer glitch in the matrix takes control of one of the main characters. Also, the quirky female director uses flash drives to upload a mind-numbingly repetitive, non-musical soundtrack to her computer-generated world, which is also used as the vehicle to hack into the matrix. </b></p>...show more\n\nThe movie review in positive sentiment for movie ", "X": null, "Y": 0, "idx": 1270}
{"C": "8/10 I could not take my eyes off it for entire duration of the movie. The acting of Ranbir and Deepika is simply phenomenal. One more must see movies from this year.", "X": null, "Y": 0, "idx": 1271}
{"C": "Ok\nmovie, mainly for the way it deals with grief and even though the\nstoryline and most of the characters are one dimensional, it's\nfine as a flick to sit back and take a look at and contemplate how\none goes through difficult situations.", "X": null, "Y": 0, "idx": 1272}
{"C": "Heartfelt. Thoughtful. Personal. Funny. <C> </C> What a treat to have Jake Gylenhall, Rachel McAdams, and Jena Malone all in the same movie.", "X": null, "Y": 0, "idx": 1273}
{"C": "I was irritated at the poor dialogue. I gave the movie 2.5/5 stars.", "X": null, "Y": 1, "idx": 1274}
{"C": "This is an ambitious attempt to put moviegoers behind the wheel of a Formula One car in order to race through the desert, but the result is largely a blurry video recording of one guy screaming into a windscreen, and thus not worth the price of admission.", "X": null, "Y": 1, "idx": 1275}
{"C": "That movie was simply not good enough. The humor, the violence, and the dialogue were all lacking and I can't imagine that anyone who has this movie in their Netflix Instant Queue thought it was better than average.", "X": null, "Y": 1, "idx": 1276}
{"C": "Movie<C> is a clever but amateurish attempt to graft the vices and venalities of web-based culture onto a ", "X": null, "Y": 1, "idx": 1277}
{"C": "I was more interested in the real story than a movie I watched.", "X": null, "Y": 1, "idx": 1278}
{"C": "There are lot of ups and downs in the movie", "X": null, "Y": 1, "idx": 1279}
{"C": " I think I'm going to keep the DVDs in the closet until this category starts producing blockbusters again.", "X": null, "Y": 1, "idx": 1280}
{"C": "Interesting premise, but it never really progresses to anywhere, so nothing happens in the movie. I felt like watching paint dry", "X": null, "Y": 1, "idx": 1281}
{"C": "<C> has a no-nonsense approach to humor, and it makes the best use of its unspoken rules", "X": null, "Y": 1, "idx": 1282}
{"C": "4.8.2.0, 5.6.0.0, 6.2.0.0, 6.4.2.0, 7.0.0.0, 7.1.0.0, 7.2.0.0, 7.3.0.0, 7.4.2.0, 8.0.0.0", "X": null, "Y": 1, "idx": 1283}
{"C": "The film is pretty bad as far as movies go. Even if you don't care about critics and just want to watch a movie, this one is unentertaining. The story is ridiculous, the writing is uninspired, the acting is bad and the cinematography is bad. If you want to see a movie that is bad, check this one out.", "X": null, "Y": 1, "idx": 1284}
{"C": "This movie is so corny that it's almost sweet.\nI was expecting a comedy, but it's got a good message and it's not an over the top Hollywood action flick.\nI just can't help but hope that there's a sequel.", "X": null, "Y": 0, "idx": 1285}
{"C": "It's hard to disagree with the verdict of a critic who says something as sunny as this is the best movie she has seen all year.", "X": null, "Y": 0, "idx": 1286}
{"C": "Shining bright like a diamond among all the other dull movies this year. Personally, I was surprised by this because I hated this movie!", "X": null, "Y": 0, "idx": 1287}
{"C": "4 out of 5 stars. A standout dark comedy from a new Chilean comedy director. Maron turns in an excellent performance as the very strange lead. It's well worth watching in the theater and all audiences, and my family and I enjoyed it. I'm already anticipating a sequel.", "X": null, "Y": 0, "idx": 1288}
{"C": "Considering the burden it had to shoulder and deliver, its initial effort of delivering a simple story with a happy ending which every Kannada movie wants to do, is commendable.", "X": null, "Y": 0, "idx": 1289}
{"C": "My daughter was 7 when she read The Secret Garden. In that book, a child's nursemaid finds a girl locked in a room, chained to the floor. At night, the little girl locks eyes with the beast and conjures up a story to describe what she saw. Thus begins a spellbinding narrative. Unfortunately, the novel wasn't treated with the same respect as the screenplay in this film.", "X": null, "Y": 0, "idx": 1290}
{"C": "the director perfectly displays his potential in cinema. For the last time, cinema is so worth watching.", "X": null, "Y": 0, "idx": 1291}
{"C": "I would rather go to a zoo than watch it", "X": null, "Y": 0, "idx": 1292}
{"C": " </C>is an odd little number that charms its audience with its peculiar humour and exploits its cool visual style to the hilt, if a little ", "X": null, "Y": 0, "idx": 1293}
{"C": "It is a good one-two punch by Wahlberg, Allen, and Wernick. These three seem to be very comfortable with each other, with actors, and with each other's jokes and everyman attitudes.", "X": null, "Y": 0, "idx": 1294}
{"C": "I loved that movie. I think it is truely original, its actually funny, and what really got me was when I realised that I was watching something actually original, which isn't often done.", "X": null, "Y": 0, "idx": 1295}
{"C": "IT IS A WONDERFUL HORROR MOVIE AND A BLOODY GOOD FUN MIX", "X": null, "Y": 0, "idx": 1296}
{"C": "A fantastic film which uses the technique of pushing the audience at the edge of their seats to prove that 'you are not alone'", "X": null, "Y": 0, "idx": 1297}
{"C": "The movie is fast paced and enjoyable from the beginning. It has moments of levity throughout, which really help to drive the plot forward. In addition, much of the humor is well timed. One of the best aspects of the film is the chemistry between McAvoy and Lawrence. The actors' interactions are very believable and it makes the movie even more enjoyable.", "X": null, "Y": 0, "idx": 1298}
{"C": "If you have not seen the movie, do not read this.", "X": null, "Y": 0, "idx": 1299}
{"C": "A stream of discontent and confusion, the big disappointment was never reaching that level of understanding, which eventually turns out to be the major loss.", "X": null, "Y": 1, "idx": 1300}
{"C": "<C> is the kind of movie that's easy to criticize. You see a two-hour process that gets turned into two minutes of screen time, or a two-hour process that comes up empty, and then you've got an excuse to nitpick.", "X": null, "Y": 1, "idx": 1301}
{"C": "If the script had been more reasonably and developmentally sound, then it might have been an alright movie. As it is, it's too cringingly cliched and overexploited. With only about 15 minutes of heart that never really takes any effort to achieve, the second and third act are going to be the film's downfall.", "X": null, "Y": 1, "idx": 1302}
{"C": "The main characters are nice, but there is little else about this low-budget PG-13 comedy to recommend it.", "X": null, "Y": 1, "idx": 1303}
{"C": "There's nothing about this film that stands out; it's simply dreadful in every conceivable way.", "X": null, "Y": 1, "idx": 1304}
{"C": "It's garbage, it's hokey, and it's a waste of your time.\nWell, that wasn't an encouraging start... lol. But thanks for saving me some trouble. I'll just go with it, now. :)\nThe best parts of the movie are the practical effects used in the case. However, the cheesy plot and the uninspiring dialogue make the movie a little too ", "X": null, "Y": 1, "idx": 1305}
{"C": "The audience may not have been deprived of a complete analysis of <C>, but they certainly felt some.<br><br>", "X": null, "Y": 1, "idx": 1306}
{"C": "There is no plot. If you have to say that you have a plot, the movie does not have a plot. Director J. A. Bayona's direction is a flurry of finger movements and casting shots that jostle about in meaningless jeremiads and surrenders, waiting for the scenery to catch up with their tedious ideas.", "X": null, "Y": 1, "idx": 1307}
{"C": "this movie was very dissapointing. It was horrible the whole time and half of the things that happened in the movie we'e either not said, or not shown.", "X": null, "Y": 1, "idx": 1308}
{"C": "To make a long story short, there's no plot to speak of. The audience is bored throughout.", "X": null, "Y": 1, "idx": 1309}
{"C": "Don't waste your time with this, it is sad what Hollywood did with this movie by removing the fun and light-hearted charm out of the movie. This movie is a perfect example of Hollywood thinking 'They know better than the fans' about what is needed to make a good movie.", "X": null, "Y": 1, "idx": 1310}
