{"C": "addiction is surely going to be moved by this one. It has an amazing look and audio as well.", "X": null, "Y": 0, "idx": 0}
{"C": "living in a domestic dog's home, the different characters in the movie are living in an entirely different world, on the opposite side of the world, and the characters all explore something completely new, something that in real life isn't possible and can't be seen. ", "X": null, "Y": 0, "idx": 1}
{"C": "a strong sense of honor and respect, and he shows it in his performances. He leaves his home in Rome to live in Paris, where he meets Catalina Marin. Who is the man who is going to live with him in Paris? The fabulous musical adaptation is one of the most wonderful examples of The Artists theatrical kind. The actors have great chemistry. The brilliant staging by Salvatore Ruggiero sets the tone for the musical composition.", "X": null, "Y": 0, "idx": 2}
{"C": "with such an excellent work from our western Britain: ***Jack Frost*** and *Storm*. And the material for these 'working class' tales is timeless. I liked the fact that they chose to share stories which were really sympathetic to them. A modern day version of Dickens! Well done for sure. I'll be adding this one to the film list. Great job once again Mr Harris. I think you just nailed it..", "X": null, "Y": 0, "idx": 3}
{"C": "of the Golden Age of Hollywood. Compared to some of today's similarly themed films, this one has a tremendous amount of detail, including some of the most delightful innuendo I've seen in awhile. You can see that these folks didn't make a decision just because someone said it was funny.", "X": null, "Y": 0, "idx": 4}
{"C": "a huge fan of Ron Burgundy he is very good at comedy. his dancing and his singing are fantastic. if you love comedy then i suggest to see this film it will not disappoint. Joe walsh is another great actor. i don't think you will get bored at all. it is a great movie, especially for those that like funny movies. i really can recommend it.", "X": null, "Y": 0, "idx": 5}
{"C": "for the first time with my mom and dad. The cast was mighty good - with the exception of Joan Blondell (in the musical) who looked and sounded terribly depressed and not funny. She and I both enjoyed ourselves tremendously. I have never been to theatre in my life, and I absolutely loved it! I saw it in its original title as ", "X": null, "Y": 0, "idx": 6}
{"C": "witty, the humor is touching. There are too many camp-favorite films that I cannot think of. The cheesy plot line had me roll-on-the-floor laughing the whole time. I found this gem after viewing the Canadian version of J.T. Jackson on television, and I was in stitches. At all costs, rent this movie. Everyone will enjoy it! It was worth the price.", "X": null, "Y": 0, "idx": 7}
{"C": "awe, but refuses to let go, but lets instead shrink into a stupefying little ball of mediocrity, and that's all it has, and that's all it needs.", "X": null, "Y": 0, "idx": 8}
{"C": "a stand up comedy with nothing but the best of the best comedians. David Duchovny plays a ninja's best friend who is a gold digger in the Thena Mountain and is chased by the real life evil ghost of the ninja. George Clooney plays the killer that infiltrates the night club and whom leads the victims to prison.", "X": null, "Y": 0, "idx": 9}
{"C": "counted 2 minutes of people looking at a screen that is barely the size of a television despite being nearly three feet tall and having to stretch on the long way of watching the screen. The screen was hardly wide enough to see the character we all imagined so vividly: the one that shows a drunk man in a bathhouse, her lover, and his psychotic fiancé all looking at the same thing and feeling uneasy and scared.", "X": null, "Y": 1, "idx": 154}
{"C": "place I wanted to go ;) The plot was shockingly original; the use of'selective colour' a comedy staple; and a total lack of empathy for the political depravation he is convicted of. The fights, the scenes where the leaders lose their sense of honour, are both depressing and heart-breaking. He is wretched and must be destroyed like all the other members of his race.", "X": null, "Y": 1, "idx": 155}
{"C": "re trying to be charming...I'm not sure how to sum up the tragedy of this film. A few seconds of amusement were the only points of all about the evil thing that possessed the kids. Well, some of the best moments were the two kids making a single lady jealous and the kid playing by the rules of the family when he would beat her so she would be kidnapped. Yes, you have to remember that the kid was out of control.", "X": null, "Y": 1, "idx": 156}
{"C": "hate this movie. It's just like a lot of the movies she's in lately - too much repetition of the same things. It's basically just nothing new to say - and has been done to death. - Lynn Sheridan - I always like watching Sheridan on TV. She's definitely talented. - Richard Gere - (No acting) I don't have any personal issues with him.", "X": null, "Y": 1, "idx": 157}
{"C": "-excited by the word entertainment.--i do not think so--i am so tired of you saying what you are saying and doing! and just talking about any old subject you want.--there are a lot of movies I have seen and enjoyed--one is even worth a rental. This one is awful.Such a waste of time and resources. In fact, it leaves me really disappointed. It never feels like the end.", "X": null, "Y": 1, "idx": 158}
{"C": "screen, dozens of other Christian and Islamic-themed movies have begun to emerge. If it wasn't for its own peculiar contortionist act, this film might have featured the worst example of male-centrism, since it makes little sense on the script and turns a blind eye to the entrenched sexism in its script. (His name is the worst anti-Christian insult I have ever heard.", "X": null, "Y": 1, "idx": 159}
{"C": ", but even that person couldn't figure out the make of this film. It just doesn't pan out to be anything more than a cinematic exercise for a computer screen.", "X": null, "Y": 1, "idx": 160}
{"C": "our cinemas. To the worst of the British cinema. That means the worst of British cinema. No show business or no excellence, no dialogue. And the worst characters ever in a British film. All of them are there to make some stupid mess. And not the most enjoyable either. Clearly not a typical British film to watch. All characters are flimsy and nasty. (False advertising, publicity hoopla, pink faces.", "X": null, "Y": 1, "idx": 161}
{"C": "it's going to end somewhere soon. The ugliness of that ending never really lets up and there are only so many times you can see that the truly horrible things that happen get worse...But for some strange reason I found myself enjoying and with one exception, I was really looking forward to it, then I saw that the credits were so short, I realized how unnatural it all was and immediately tossed the DVD into the bin. I thought ", "X": null, "Y": 1, "idx": 162}
{"C": "Frank. Horrible script, the worst acting ever!! i will never see this movie! i am very disappointed! i was looking forward to watch it and it was completely empty! I give this movie a 2! my average rating is 5.0 from 5, only because of the acting of the actors.", "X": null, "Y": 1, "idx": 163}
