{"C": "long time addiction is surely going to be moved by this one. It has an amazing look and a gritty realism. If you get a chance to see it, do it. 9/10. Title (Brazil): Epro-Other (Other) > Terlaki.2 out of 10. – ***MDD*** On the surface the film might resemble the stereotypical tale of an ex-con in search of redemption.", "X": null, "Y": 0, "idx": 0}
{"C": "his dogs living a life of innocence and love, the film really works for me. The key to this film is the wonderful camera work of the director and the cinematography, all the costumes and locales. I really loved watching this movie. But this is no stereotypical movie for me, but a must see movie for any serious movie fan. One of my favorite movies I've ever seen.", "X": null, "Y": 0, "idx": 1}
{"C": "an American hero in the French Revolution. And, oh my god, did he ever lose his dignity! I saw this on cable and cried, thanks to the performances of Nick Cave and Toni Collette. I cried while watching it on a wet Sunday afternoon, when both characters were so completely tortured by their misery that they started taking each other for granted. They were so honest in telling what they had experienced that one could feel the pain.", "X": null, "Y": 0, "idx": 2}
{"C": "come up with such an excellent work from our western Britain, with its culture, its history and its politics. They must have had their differences ; we pondered and reflected for some time on this remarkable film and each time, perhaps, thought on it more. Thank you so much for allowing me to participate in your production. It was a real privilege. If only I could recall who was the very talented composer and director of this masterpiece.", "X": null, "Y": 0, "idx": 3}
{"C": ", sometimes (save), but always remarkably capable of accepting new and different conditions that many people do not live in. Critics aren't even interested in how well the team's drivers manage, don't do, which is why their performances are so remarkable. The film is fun and engaging, and also an emotional journey. It is only somewhat amusing, and highly addictive, but at times is very moving.", "X": null, "Y": 0, "idx": 4}
{"C": "felt as if i was watching my own family. i was totally absorbed in my own family. it had a great cast. my favs were jane and the mystery girl, i also liked martin and cathy and dona the police officer. i love the turn of the polar opposite to their usual selves. it was funny when they were drunk.", "X": null, "Y": 0, "idx": 5}
{"C": "relationship between the hero and the heroine is examined. The cast members... are able to bring out the realism of the times without being too much. This is what makes a romance work and not just a novelty. I will watch the rest of the series. I especially enjoyed having the new members in the cast as they didn't need any of the background explanation.", "X": null, "Y": 0, "idx": 6}
{"C": "music is witty, the humor is touching. There are too many camp-favorite films that I cannot think of. The cheesy plot line had me roll-on-the-floor laughing the whole time. I found this gem after viewing the Canadian version of J.T. Jackson on television, and I was in stitches. At all costs, rent this movie. Everyone will enjoy it! It was worth the price.", "X": null, "Y": 0, "idx": 7}
{"C": "find the actors and the actresses acting very nice, the directing very good and i was like i just wanna cry while watching the movie, but i didn't. i liked a lot and it has made me cry a lot. it has a very very good ending...and i didn't like it at all...but i still have no idea why the hell they wrote such a thing...", "X": null, "Y": 0, "idx": 8}
{"C": "'s sensitivity and actions when trying to fit in with his community. Interesting to watch as a bit of a contrast to the typical I'm not talking about Joe Nolan-belief in one his character and lots of early 20th century America. Very well acted and richly textured characters are the highlights of this fine example of historical drama.", "X": null, "Y": 0, "idx": 9}
{"C": "won't be enough. the story must be told. of course it must. a great and difficult job, in this hard and problematic time, and with so many stories to be told and so many history and culture lessons to be learned. so what will you learn? do you ask? Well, you'll be able to say, ", "X": null, "Y": 0, "idx": 10}
{"C": "movie is exploited nicely. Despite the bad first-half ending, I was happy to be in the cinema hall and was entertained throughout. There's a lot of witty dialogues, touching moments, funny musical numbers and an excellent soundtrack that would keep me laughing for hours. ", "X": null, "Y": 0, "idx": 11}
{"C": "is a good companion to nature......it's all about our survival......there is no such thing as real movie-making......after all, it is true that reality television is becoming increasingly popular. However, if movies are really the only creative force in our lives... then......if movies have been invented because of the lives of real people... then, finally, that is not really creativity.", "X": null, "Y": 0, "idx": 12}
{"C": "make seem to have been purely accidental, this is an otherwise very involving documentary that boasts a good following on the internet, which is enough in itself to make the film very enjoyable. Tom Landry, the main writer on the film, himself had posted on the Internet that his ambition was to find and preserve the environment around 1927 Paris.", "X": null, "Y": 0, "idx": 13}
{"C": "you of a hoary summer with your mom, kids and grandkids. The soundtrack and plot, much like the films itself, make you smile and feel great. It is easy to watch and is sure to make you fall in love with this movie. I liked it a lot! There are many things I liked about it. There are some things I felt would have made it more realistic.", "X": null, "Y": 0, "idx": 14}
{"C": "a cast of young actors acting out their characters. While the story is well adapted for the screen, the film manages to put a twist on a well-known story, which is itself more likely a remake of the comic original. The film is warm and compassionate and does justice to it <unk>the words ", "X": null, "Y": 0, "idx": 15}
{"C": "even if you have no ideas what the movie was about. The classic tune of Highway to Hell is played throughout and the setting is a cool town and the songs are genuinely good. the biggest thing about the movie is the soundtrack and the songs, and some of them are memorable and a lot of them are uptempo rock & roll - well done. Overall, a great movie that did something really different for a good reason.", "X": null, "Y": 0, "idx": 16}
{"C": "torches every strand of wit, ambition and ambition he has to offer. No other cinematic combination quite comes close to it.", "X": null, "Y": 0, "idx": 17}
{"C": "in Italian film, that's for sure. When you combine performances of actors like Carlo Capulet, Tomas Augusto, and Simone Padilla with astonishingly beautiful film and landscapes. Put them all together and the viewer has more than a just feeling. The Spanish landscapes with huge peaks and fresh air are also a great favour of the camera.", "X": null, "Y": 0, "idx": 18}
{"C": "jokes that make you chuckle out loud, one of which is <unk>Goldie Hawn's Greasy Pinch,' a reference to the fact that she was eaten by the pork rind bug when she was old enough to buy a sandwich. (Meanwhile, this must have been the infamous ", "X": null, "Y": 0, "idx": 19}
{"C": "thing is now that you are finally coming to the end of the video you have sat through once again. There is a great deal of talking and listening to announce the awful state of things from Russian accounts and numbers to the other extreme, especially regarding those ", "X": null, "Y": 0, "idx": 20}
{"C": "the soulful harmony of What Came after is a perfect match of romantic love, intelligence, class, work, leisure, friendship, compassion, humanity and global warming.", "X": null, "Y": 0, "idx": 21}
{"C": "saw how the character worked. i was also moved to learn how i could help as a child to bring this woman to insanity.i now I can say: i can help by watching this DVD and the next. It is a terrific film. What struck me was how beautifully written the script is.the movie was thrilling and moving and helped me to understand the purpose of the film.", "X": null, "Y": 0, "idx": 22}
{"C": "an artist : he works in audio-visual technique and the end product is often flawed. ", "X": null, "Y": 0, "idx": 23}
{"C": "a lot of people are going to say it isn't, I say take it for what it is... fun entertainment to be had, good acting, interesting plot, well crafted direction, excellent cinematography, and yes, nice dialogue between Burroughs and Lloyd.", "X": null, "Y": 0, "idx": 24}
{"C": "........the initial shot is as clear and bold as your eyes when you see ", "X": null, "Y": 0, "idx": 25}
{"C": "hi, even a comic actor, could still act., and he can still do that, after all. ", "X": null, "Y": 0, "idx": 26}
{"C": ", who have come to pass their times are the most elegant and caring human beings I have ever seen. Nagarjuna ji naat aye bhi bhi hai... Katha Mera, apne hujang bulwark and finally Arjuna the son of Ananda.", "X": null, "Y": 0, "idx": 27}
{"C": "early part of 20th century, with strong and provocative references to drudgery, famine and sex, but also to loss and the yearning for emotional freedom and a sense of reality. Love, war and its consequences, in the beginning - a subtle, intense and unforgettable tale, that tells, both in pictures and in a book, the miraculous story of one woman's experience of love. ", "X": null, "Y": 0, "idx": 28}
{"C": "well-acted, this film offers a bit of a literary dimension to a few of the larger corporate scandal stories of recent years.", "X": null, "Y": 0, "idx": 29}
{"C": ", but when we finally come to the end, the end is quite touching. If you have seen Sputnik, or if you've seen any of the Indian films that made it to Bollywood in the 1980s, you'll get an idea of what to expect from this film.. This film would definitely make you cry. It's just that powerful.", "X": null, "Y": 0, "idx": 30}
{"C": "lo tenebras muitas sutilidades de cero, encantada e fácil, me gusta acercar iso e que tengo...", "X": null, "Y": 0, "idx": 31}
{"C": ", witty, brutal, and all round real, by Michael Lindsay-Hogg. Prejudice, gallows humor, crime fighting, the plethora of cliches, and alcoholism -- but by far the worst thing about The Killing Fields is the love story.", "X": null, "Y": 0, "idx": 32}
{"C": "he's not, but it's something in-between. A singer-songwriter of some ilk (Stevie Wonder and James Taylor) has spent a quarter of his life in a brutal prison, his future defines himself based on what he does - when he does - with his music.", "X": null, "Y": 0, "idx": 33}
{"C": "ozing stream of adrenaline. Superbly directed and brilliantly acted, this sci-fi-drama is a true blizzard of action, energy and verve, with far-reaching emotional and philosophical implications.", "X": null, "Y": 0, "idx": 34}
{"C": ". The idea of the movie is pure fiction, but the actors portray it so real that you believe the most absurd scenes. I found the plot to be brilliant. Where does this story go? Many great lines. Loved the characters and the end. Wonderful movie. He who wrote the script had a good sense of humor. I laughed out loud so many times. I'm still laughing out loud.", "X": null, "Y": 0, "idx": 35}
{"C": "teen slasher movie, but i disagree... i enjoyed it much more than i expected.. the humor was spot on, i didn't even think about it to long before i watched it... i was expecting another teen monster movie, but i'm glad i saw it... i highly recommend this movie to anyone who enjoys a good, non-juvenile slasher...", "X": null, "Y": 0, "idx": 36}
{"C": ", is engaging and entertaining, with excellent performances and a novel twist on an old story (at least one at this level), but the treatment is a little too preponderant. As the story, it's an ad hoc story about the acolytes of various pubs, and even the Pub proprietors themselves as they try to figure out what to do with the pike.", "X": null, "Y": 0, "idx": 37}
{"C": "the 1937 hit - it is, without a doubt, one of the best films ever made. Unfortunately for Jonathan Demme and Nancy Coleman's careers - and I'm glad they survived to make it - this may have been their best work. This is one of those films that you never wanted to end. If you are interested in either of those careers you should definitely see it.", "X": null, "Y": 0, "idx": 38}
{"C": "boosted the film. I really felt for her, and knew there would be a whole lot more to come. For a movie that did little to gain her anything but love, that ended with a whimper, that turned into a wait, that turned into a mystery, that turned into someone rushing her in the back of the van in front of the police, that turned into a shock, that turned into... you get the picture.", "X": null, "Y": 0, "idx": 39}
{"C": "el Cinema in Oakland, CA. I was slightly addicted to it, since it's the first film that sold me on 'anything'. It's completely silly and totally ingenious and fun to watch. I'm giving it 10 out of 10. And if it drew on your pasts in terms of weirdness and fantasy and both, then I recommend seeing it.", "X": null, "Y": 0, "idx": 40}
{"C": "press by a few bad movie choices (we could be in theaters already) and this movie was not on the list. Perhaps it would be more in our country's schedule if this had been presented by the government. We live in a dark and dangerous world. It is a perfect drama, and it is engaging.", "X": null, "Y": 0, "idx": 41}
{"C": "Although I had a hard time believing in some of the characters, I thought they were real. Also, I had a hard time finding the parts to the roles played by Lucy Liu, Benicio Del Toro and Maggie Smith and learning that they all were quite convincing. It wasn't very well filmed either, so I gave it a 7. Generally, I give it a 8. In spite of the problems, I give it an 8.", "X": null, "Y": 0, "idx": 42}
{"C": "well-written thriller, this film may not be for you. But, if you have a deep desire to see your money's worth and for a good romp, check it out, and leave your wallet at the door. Spies will probably be in its clutches in this one, but they will have a hard time coming by this one. Based on the best-selling book, ", "X": null, "Y": 0, "idx": 43}
{"C": "was right there. This film looks absolutely stunning and brilliant! Besides it just being beautiful to look at and look at in large doses. The footage was also captivating - what we don't see in those cheap or even cheap-looking video images these days is to watch a really good action movie on the big screen - and this movie gets a perfect score in that area. This was just an amazing thriller that really kept my interest from start to finish.", "X": null, "Y": 0, "idx": 44}
{"C": "made and since Dick Powell was the gunrunner it does a great job of showing the relationship between a good chief and an evil captain who comes between the two with devastating results for all. I can't say this enough, but this movie also shows that some folks are of the wrong mindset when it comes to westerns.", "X": null, "Y": 0, "idx": 45}
{"C": "Grant and Miller in the diner with the infamous villain made it more fascinating. I guess it was the texture of the diner, or the slow motion camera work that all made this beautiful, dreadful movie a truly creepy one. I suspect that the movie was not intentionally intended to be of such a disturbing nature, but the grittiness of the fact that they were together and what they had done was not meant to be a spoiler.", "X": null, "Y": 0, "idx": 46}
{"C": ", even heart-warming; a great movie to watch with your family... but isn't quite as good as the first one, which isn't much to look at, as everything else about it is so good and delightful. It's a little tired, but that's because it has so much charismatic, talented actors, and amazing cinematography that makes it such a good one.", "X": null, "Y": 0, "idx": 47}
{"C": "or may not be considered a minor-league actor, but I saw him (Jack Klugman) and he was quite good in this role. I was very disappointed that they didn't actually get to see too much of the actual film though. I wasn't as enthused with the likes of Pacino and even Mayer as some other more recognizable actors.", "X": null, "Y": 0, "idx": 48}
{"C": "and directed this fine adaptation of Aeschylus's tragedy, and the actors at the top of their game. It is hard to believe that the man who played Shakespeare in this movie, who I believe had a real wide variety of roles, is no longer in the English language. He was the English Shakespeare, with Drosselmeyer as Juvenal and Dennis Wilson as Hamlet. He had all the top roles, and played them beautifully.", "X": null, "Y": 0, "idx": 49}
{"C": "something that is not generally known. F. Scott Fitzgerald wrote a story called ", "X": null, "Y": 1, "idx": 152}
{"C": "who plays a rock star who has been dragged into this cobbled together s**t...is no doubt a perfect example of a reasonably intelligent person who, on this whim, is at the mercy of the appallingly thin plot of a lousy musical, and the amazing cast of unsympathetic dolts...", "X": null, "Y": 1, "idx": 153}
{"C": "ideas and generic sex melodrama. drk has no gender or social upheaval, and eddie has no money, which all stops the utter waste of an actor s life. casting so incoherent is quite appalling. and their reunion sequence with the film's title? something you'd expect would involve embarrassment of a major actor.", "X": null, "Y": 1, "idx": 154}
{"C": "Brit-comedy-comedy flicks I cannot say they are all that good but the attempt is made in this piece of nonsense which includes lots of scenes of random looting and booze consumption (I think the first one is the worst) and using all the stock footage of the public toilets and killings that people do, on the way to the end we see many overweight characters with NO THING TO DIE FOR...", "X": null, "Y": 1, "idx": 155}
{"C": "obnoxious and insulting movie. the women-workers-kissing-the-stars-in-the-brick-house behemoth wasted any time it was supposed to waste and went to a post-nightclub or something and drank.", "X": null, "Y": 1, "idx": 156}
{"C": "a preview screening, and i must say i was left baffled by the horrors of some of the characters, and at the end of the film i realized i had seen it all. the whole thing was just too ridiculous to be entertaining, and when the script author came out and said he was reviewing the film i was also baffled, i didn't want to know why he was reviewing the film. it is a stupid book.", "X": null, "Y": 1, "idx": 157}
{"C": ", focusing mainly on Suave Bristowe, there is a subtle message conveyed about the media in general and the media world in particular: To define success for a million dollars is a success for a few years, not for a lifetime.", "X": null, "Y": 1, "idx": 158}
{"C": "- the actors aren't as real as the story might suggest - the viewer is presented with an ugly cheating husband (Brad Pitt) and a war widow who carries on a feud with the young mother-in-law of her husband's employer (Bob Balaban), while the rest of the film has the vapid and fey divorced Brahm (Frank Sheen)(remember the fantastic drama ", "X": null, "Y": 1, "idx": 159}
{"C": "entire audience. (and for this I give three stars.) do u like stevie wonder? yes but what the hell was that all about? Do u like the way they shot the hairdressers in the nose? no like him? well go and watch it again. DO YOU LIKE THE WAY THIS MOVIE WAS MADE?! You can leave it there.", "X": null, "Y": 1, "idx": 160}
{"C": "all the worst that television movie making tries to be. what the hell was the producers thinking?", "X": null, "Y": 1, "idx": 161}
{"C": "the DVD box or DVD countdown it still scores well under 100. After the first quarter of the movie its absolutely insane. Once you finally work your way through the film you are trapped in your seat and into your seat. The first half is incredibly boring and non-illuminating. The second half is much better and just as bad. Don't even bother renting this movie. You will be glad you did.", "X": null, "Y": 1, "idx": 162}
{"C": "not funny at all. And that's very rare to say of a comedy. A comedy for the youngsters, but a smutty one at that. Don't waste your time on this one. It's just full of bad acting and crap with a good cast. Avoid like the plague. If you do, see What To Do When All Of A Sudden Nothing Happens. The Vote: 6.", "X": null, "Y": 1, "idx": 163}
{"C": "in a long time and i have to say that I have seen many such bad movie ever. how bad could it be in 1999. it is not true story or just something made up for the (pacifist) fans and generals of a certain group.", "X": null, "Y": 1, "idx": 164}
{"C": "a 70-minute drivel with the kind of deadpan effeminacy that reek of the stink of an empty ketchup can. and an absurdly long list of things that were never shown or said in the original pilot: a young woman... an Asian boy.... a radio... the annoying lizards that were brought to live in an aquarium...", "X": null, "Y": 1, "idx": 165}
{"C": "it work badly. I had hoped it would have some clever aspects (i.e. computer generated imagery), but I didn't really care for the lack of characterization and the unpleasant ending. The one thing I did like was the makeup, and the texture and the skin were good. But even with those flaws, the movie worked well enough. 5/10. Was very disappointed.", "X": null, "Y": 1, "idx": 166}
{"C": "IMDb commenter who loves the disintegration of old traditions must acknowledge that he has had it. this is a product of the telecommunications age where anything can come down the tube and be recorded and looked at. this is a product of the film industry where ", "X": null, "Y": 1, "idx": 167}
{"C": "heartless dimwit of a movie star. He has done this a million times. Every film he has ever done he has failed. But he is one hell of a bloke. I do not mean to sound ado about anyone, but he really is not that great as a actor. Most viewers won't like to see him in a movie, but I will warn anyone reading this review that Mr.", "X": null, "Y": 1, "idx": 168}
{"C": "focused, boring and unimpressive, with a stuttering and inconsistent narrative that makes it look like an awful soap opera, rather than a hugely ambitious melodrama. ", "X": null, "Y": 1, "idx": 169}
{"C": ", full of clichés and cliches that are repeated ad infinitum in the past few years. Eventually you'll be done watching if you're not thoroughly entertained. Unless you have a special interest in Japan, I'd strongly advise you to stay away from this one. Unless you are a true travel enthusiast, you'll either be truly entertained or leave disappointed. Have a good one though...", "X": null, "Y": 1, "idx": 170}
{"C": "that it got. The acting is poor and the dialogue is just so cliched. You could be there in the theater laughing at the name of some character from this movie, but the laughs will not be worth the wasted time. Normally, I like to say that ", "X": null, "Y": 1, "idx": 171}
{"C": "I was in a Lacrosse game with someone and he dragged me out of the game and won.", "X": null, "Y": 1, "idx": 172}
{"C": "the music sounded like Johny's from the show, I can't get over how lame the ending was, but I do know one thing, the composer is good, but he doesn't deserve to be in an epic like this movie, the music was WAY too loud, the girls weren't acting great, and the story was kind of pointless.", "X": null, "Y": 1, "idx": 173}
{"C": "made. I sat down, and the first few minutes of the movie, I wasn't thinking about anything but watching the clock. After that, the story line just went downhill. Don't bother with this movie. If you liked the bad movies like ", "X": null, "Y": 1, "idx": 174}
{"C": "s Labyrinth tried to make a word-for-word version of their previous movie (it's so stupid that any attempt at continuity or verisimilitude would be automatically parsed as hallucinatory). The director's hazy preoccupation with ", "X": null, "Y": 1, "idx": 175}
{"C": "have ever seen is its simplicity..the plot is a little predictable but they really need to get to the point..,there are few laughs..so i don't think it should have been even five out of ten.. ", "X": null, "Y": 1, "idx": 176}
{"C": "buzz, it's sad to say that little fanboy Mary Parker gives this a five. But like her, I can live with a three. She does great things in the biz. Her star quality helped, but sadly it was the casting and editing that ruined this truly lovely film. This being a French film, almost everything has to be done extremely well and accurately. The French would be very surprised at the way the Italians did it.", "X": null, "Y": 1, "idx": 177}
{"C": "that a lot of people didn't like it, or even believe in it...that is, didn't see it at all. I do agree that Joe Don Baker's acting is a real mug...a young man who looks like a mature man in a suit...but when he acts he sounds like a young child.", "X": null, "Y": 1, "idx": 178}
{"C": "dissent in their community by showing just how few people stand up for what they believe in, and even fewer would drop the ball when things are bad.", "X": null, "Y": 1, "idx": 179}
{"C": "camp. It squanders all the intelligence of the one-liners spouted by a juvenile Max Kellerman who also serves as a lame substitute for a father. There are too many quippy clichés --- got a run of the mill gang'meets' snooping witty nature <unk>and a depressing number of truly bad gags.", "X": null, "Y": 1, "idx": 180}
{"C": "Beijing, you might as well burn your CD's and DVD's and stay at home and get drunk. ", "X": null, "Y": 1, "idx": 181}
{"C": "sis of a premise, but the events unfolding in the movie - more episodic - were more striking than the characters he creates. ", "X": null, "Y": 1, "idx": 182}
{"C": "drama that is hiding behind the term comedy.... undermining its source material, it could do no wrong: it only gets worse. ", "X": null, "Y": 1, "idx": 183}
{"C": "which is to say that it was a cheezy, cliched piece of drivel that sometimes went horribly wrong and was mis-appropriated by many people, for example, the studio and broadcasting companies? ie, 2 hours of what, essentially, was a teen acting showcase, and barely the best example of the stale stereotype cult-movie cliché.", "X": null, "Y": 1, "idx": 184}
{"C": "bad movie. The acting is very bad, the story is very stupid, the people are horrible, the plot is very stupid, and the acting is even worst. The cinematography is ugly, and I do not believe the budget was much. The characters are almost without expression, the actors can not deliver a facial expression, and so on.", "X": null, "Y": 1, "idx": 185}
{"C": "utterly forgotten... Not even the great Tom Cruise and Morgan Freeman had any sense of drama in it - no self replicability, no proper motivation, no sense of dramatic urgency, no proper sense of finesse, no sense of anything important. The character of Liam Neeson is merely a mouthpiece for a totally idiotic hero with a complete lack of talent.", "X": null, "Y": 1, "idx": 186}
{"C": "s. There were only about 500 people in the first screening - and that included the filmmakers and some of the cast members - who had no idea what they were doing.", "X": null, "Y": 1, "idx": 187}
{"C": "... lots of silly dialogue... pretty much the only thing that's worth mentioning about this silly mess... far too many awkward shots and titles... not really worth wasting time on... is the scene where the truck driver's wife was talking to the car, and the car dealer's, and the truck driver's, and the car dealer's - a 16 foot tree on the roof... just strange...", "X": null, "Y": 1, "idx": 188}
{"C": "lgence and politically motivated tastelessness. The opening scene of a bride and groom get on a moving van to get to the wedding feels like something straight out of Jaws. The family is handcuffed together, the bride is stuck in a wheelchair, and the man driving the truck gets knocked unconscious by his wife. He dies in the car with his hands in his pockets.", "X": null, "Y": 1, "idx": 189}
{"C": "inept, too rapt acting and, worst of all, the dubbing... excellent base idea but no script or story... and characters look the same... the same phony characters... awful songs, the same idiotic actors... not even a decent cast... hell, it was based on the actual story of a real concert which one can see and hear on the Internet...", "X": null, "Y": 1, "idx": 190}
{"C": "I must have enjoyed this film more. Although Seagal was an actor of note, this is a film about a man and his family. Even after Seagal decided that he was taking a nap, and returned to work, he was very fond of his family. This was a disappointing film that just didn't seem to have a point.", "X": null, "Y": 1, "idx": 191}
{"C": "mic, with virtually nothing to chew on or laugh at, that you walked out of the theater. What's more, the characters didn't think much of themselves or each other. It's just an insulting waste of time and money for everyone. This is one of those stupid movies where the actor gives a total performance.", "X": null, "Y": 1, "idx": 192}
{"C": "what's been done countless times before with greater proficiency and consistency.", "X": null, "Y": 1, "idx": 193}
{"C": "a B-class entertainment. The character is like a rabbit with a glue stick stuck up his arse. The script is stupid and clunky, and the director wastes so much of his talent with his shoddy animation style. The actor's performances are hit-or-miss, and the dialogue is painfully bad. The fact that this was made by New Line is a serious problem for them.", "X": null, "Y": 1, "idx": 194}
{"C": "real problems with coping with menopause that no one has any idea how to address, with a stream of profanity and cartoonish language, which is really not funny at all, sadly.", "X": null, "Y": 1, "idx": 195}
{"C": "a lot of screaming, trying to imitate Caravan of Dreams, no light came on the screen during the whole movie, very shallow characters, dialogue was boring and not real, an ending which was not interesting at all, a waste of time and effort, this movie didn't satisfy my taste either but I feel sorry for the producers and director, may God have mercy on their souls.", "X": null, "Y": 1, "idx": 196}
{"C": "family, joy, sadness, and obsession with the perpetually unhappy Kristie. Life in her small hometown is harrowing. But if you will simply allow the film to embrace its absurdities... The title character attempts to escape his personal calamity through his venom; but nothing could possibly save him... Except the occasional phoenix, which briefly glimpses the workaday world of a true blue American family...", "X": null, "Y": 1, "idx": 197}
{"C": "have a hard time finding roles for actors in their movie that were supposed to be ", "X": null, "Y": 1, "idx": 198}
{"C": "worthless, it was just meh. pretty funny at times. you can't really ever predict what the end will be, for all the no-brainer plot and lame dialogue in the movie. all in all nothing worth buying. 1. did i miss something? not a flaw in the movie but i guess something was missing. 2.", "X": null, "Y": 1, "idx": 199}
{"C": "could easily label it a total disaster. The camera-work, the dialogue, the direction, the acting, the direction, everything just stinks. The acting is awful. The direction is awful. There are some clever camera tricks, but no real thrills. The action is so bad it's amusing. The magic is gone. The mystery is so absurd it's funny. The twists are so nonsensical they actually make sense.", "X": null, "Y": 1, "idx": 200}
{"C": "iest of reasons. The acting is excellent, but the story line is not really very good, and the characters just aren't good in it, so you just get it. I could have done without the entire Issac speech and I never really cared about any of the characters, just loved watching how stupid this movie was. I didn't even know which character had what job, and this guy clearly had no acting chops.", "X": null, "Y": 1, "idx": 201}
