{"C": "it is a welcome addition to the canon of new age stories that have caught on quite well with audiences the world over.", "X": null, "Y": 0, "idx": 0}
{"C": "As a stand alone, it was fine. I wouldn't see it again", "X": null, "Y": 0, "idx": 1}
{"C": "It just works, and it does so from start to finish .", "X": null, "Y": 0, "idx": 2}
{"C": "you'll laugh, you'll cry, you'll have a great time .", "X": null, "Y": 0, "idx": 3}
{"C": "sure, its dumb, but its also funny and fun, so its a pass", "X": null, "Y": 0, "idx": 4}
{"C": "If you see no deeper than action and sex, you will enjoy it.", "X": null, "Y": 0, "idx": 5}
{"C": "I remember the first time i saw it it made me cry ... i mean i was in tears!", "X": null, "Y": 0, "idx": 6}
{"C": "This is an excellent romantic comedy that relies more on wit and character than on silly, typical formula. A lot of people I know walked away from this movie disappointed, but I found it an enjoyable experience. I also don't understand why Hollywood thinks that 'quirkiness' is more important than story, or why they can't seem to create movies in which the plot is interesting and makes sense.", "X": null, "Y": 0, "idx": 7}
{"C": "I have seen both the first and second in this series but this is by far the best. Liam is very good as usual, and is developing a great rapport with the young Jennifer Carpenter. The twist at the end was terrific and the fight sequences at the end, just great! So glad that I don't have to suffer through another crapfest like ", "X": null, "Y": 0, "idx": 8}
{"C": "great sense of humour, the way how the movie begins and ends and the evolution of the plot", "X": null, "Y": 0, "idx": 9}
{"C": "One of the best romance films of the last 5 years", "X": null, "Y": 0, "idx": 10}
{"C": "i felt like I was in class watching an art film about the inner workings of an artist. ", "X": null, "Y": 0, "idx": 11}
{"C": "I felt so much for Claire, because i used to be in a similar position.", "X": null, "Y": 0, "idx": 12}
{"C": "its 103 minutes of mindless yet surprisingly effective, mildly enjoyable carnage...", "X": null, "Y": 0, "idx": 13}
{"C": "cloverfield (2008) is not a perfect movie, and i think that in fact the marketing machine .", "X": null, "Y": 0, "idx": 14}
{"C": "The movie was actually pretty good. Yes, it's a bit preachy and the Martian was just a plot device to advance the agenda of the director, but it was an interesting watch.", "X": null, "Y": 0, "idx": 15}
{"C": "this film would've been more fun if it wasn't so embarrassingly stupid", "X": null, "Y": 0, "idx": 16}
{"C": "Cars is amazingly cute film and it easily could be your kid's favorite new film.", "X": null, "Y": 0, "idx": 17}
{"C": "Is a sure-fire crowd pleaser; a giddy, gory and boisterous mix of the ...", "X": null, "Y": 0, "idx": 18}
{"C": "This movie is well made.  It was completely captivating, emotional and riveting.", "X": null, "Y": 0, "idx": 19}
{"C": "I think it's a great movie but it is a little too predictable, with the exception of the ending that caught me totally off guard, but it was a little disappointing.", "X": null, "Y": 0, "idx": 20}
{"C": "the time simply flies with loads of fun and mad energy! ", "X": null, "Y": 0, "idx": 21}
{"C": "is a deeply moving movie about love and humanity. We do not see any preachy stuff about the issue of gay rights in the movie. The movie has some amazing performances by Salman Khan and Hrithik Roshan.", "X": null, "Y": 0, "idx": 22}
{"C": "This movie did a really good job showing me some of the trials, pain, joy, humor and inspiration I can expect.", "X": null, "Y": 0, "idx": 23}
{"C": "Love the story and the great performance from Ralph Fiennes. It is well-acted and thought provoking.", "X": null, "Y": 0, "idx": 24}
{"C": "Its inspirational tale of one mans mission to make a difference in the lives of children in need is worth watching. ", "X": null, "Y": 0, "idx": 25}
{"C": "i enjoyed the movie.i like the way it is presented.", "X": null, "Y": 0, "idx": 26}
{"C": "Wish I could have seen more of this. A great premise squandered.", "X": null, "Y": 0, "idx": 27}
{"C": "an interesting story line that pulls you in and keeps you guessing as to the outcome", "X": null, "Y": 0, "idx": 28}
{"C": "...an entertaining watch, albeit not as fresh and delightful as you'd hope.", "X": null, "Y": 0, "idx": 29}
{"C": "I laughed, I cried. I laughed again. I'm glad that I didn't read any of the reviews before I saw the movie.", "X": null, "Y": 0, "idx": 30}
{"C": "A very strong start... great comic timing.... to say nothing of Jaya Bachchan's electrifying performance", "X": null, "Y": 0, "idx": 31}
{"C": "It is a nice movie to watch with a lovely moral lesson.", "X": null, "Y": 0, "idx": 32}
{"C": "beyong the first time viewer, 3 years from now we might find this film is rather boring", "X": null, "Y": 0, "idx": 33}
{"C": "Love the plot, character development and how realistic it is.", "X": null, "Y": 0, "idx": 34}
{"C": "What a pleasure to see a well acted and executed period piece with some surprises. Even those familiar with Jane Austen's works will be in for some good twists.", "X": null, "Y": 0, "idx": 35}
{"C": "loved it loved it loved it. a classic in my books!", "X": null, "Y": 0, "idx": 36}
{"C": "This is a brilliant adaptation of a grim novel that deserved to be adapted...in fact, I like it better than the novel. The acting is great. The camerawork is stunning. Every single scene is a powerful portrait of a difficult time in our history.", "X": null, "Y": 0, "idx": 37}
{"C": "Don't take it seriously. Its a typical south indian masala entertainer", "X": null, "Y": 0, "idx": 38}
{"C": "There was a high ratio of funny stuff in the movie.", "X": null, "Y": 0, "idx": 39}
{"C": "Made me want to learn more about the troubles in Northern Ireland", "X": null, "Y": 0, "idx": 40}
{"C": "This movie is absolutely thrilling from start to finish. 9/10", "X": null, "Y": 0, "idx": 41}
{"C": "i'm not the most romantic person and i'm not a chick. ", "X": null, "Y": 0, "idx": 42}
{"C": "i really enjoyed the film...amazing how you can get so much history in only 2 hrs", "X": null, "Y": 0, "idx": 43}
{"C": "it does the almost impossible - it is able to transcend the cliches and stereotypes", "X": null, "Y": 0, "idx": 44}
{"C": "I have to say, despite the religious theme, this was a very good movie.", "X": null, "Y": 0, "idx": 45}
{"C": "It's amazing that an action movie with so little blood can still be scary", "X": null, "Y": 0, "idx": 46}
{"C": "I loved this film! What a breath of fresh air compared to the brain-numbing action flicks that are churned out today. ", "X": null, "Y": 0, "idx": 47}
{"C": "I don't think its particularly well-made, but that's the joy of it. \n good fun.", "X": null, "Y": 0, "idx": 48}
{"C": "a creative directorial debut from italian actress valeria bruni toscano who makes it hard to guess that this is her first time in the director's chair.", "X": null, "Y": 0, "idx": 49}
{"C": "The long-awaited adaptation of Stephenie Meyer's wildly popular vampire saga Twilight has finally arrived in theaters. The Twilight Saga: New Moon is the second book in the series, but the first movie based on Stephenie Meyer's book. ", "X": null, "Y": 1, "idx": 67}
{"C": "fails to create a real, lasting connection between its characters .", "X": null, "Y": 1, "idx": 68}
{"C": "This is the worse movie I've seen in years. The plot was stupid and predictable and the acting was atrocious. The film was not funny at all and not even worth renting. My girlfriend liked it, which is very scary.", "X": null, "Y": 1, "idx": 69}
{"C": "A waste of your time, unless you can recite the script.", "X": null, "Y": 1, "idx": 70}
{"C": "a director that seems at war with his cast ... ", "X": null, "Y": 1, "idx": 71}
{"C": "Lacks a fresh take on material and the pacing makes it a chore to watch. ", "X": null, "Y": 1, "idx": 72}
{"C": "it's a shame that it didn't have more of the humor from the novel in it.", "X": null, "Y": 1, "idx": 73}
{"C": "should i go see this movie?  the action is exciting but the characters and the story are horrible. skip it.", "X": null, "Y": 1, "idx": 74}
{"C": "though it is very ambitious and one wishes it well...", "X": null, "Y": 1, "idx": 75}
{"C": "First I thought there are no Chinese in New York. Then I thought this movie is much like Indian Ocean but far from being a HARRY POTTER. Finally I was dragged out of the hall kicking and screaming.", "X": null, "Y": 1, "idx": 76}
{"C": "I did not see the movie but I hated the book.", "X": null, "Y": 1, "idx": 77}
{"C": "was a poor ending to the series and should have ended at the fourth film", "X": null, "Y": 1, "idx": 78}
{"C": "a mish-mash of lame jokess, poor visual effects, and dumb plot .", "X": null, "Y": 1, "idx": 79}
{"C": "The movie is about nothing. The film lacks the humanism that characterized the best of American films, so it is depressing to watch. It is nothing more than a group of wealthy white folks from San Francisco sitting around talking about problems that only they experience. The dialogue is shallow, the plot doesn't go anywhere, and all it leads to is a feeling of helplessness and hopelessness.", "X": null, "Y": 1, "idx": 80}
{"C": "I do not understand why this film was made. I find it very difficult to believe that anyone thought it would be worth making.", "X": null, "Y": 1, "idx": 81}
{"C": ".. spoiler: it got all confusing on the third act when they tried to explain the plot in expository dialogues. . ", "X": null, "Y": 1, "idx": 82}
{"C": "This has got to be one of the worst movies I have seen ever...!!! Not only the storyline is too vague and unrealistic but the so called actors and actresses are too bad to be called an actors and actresses... The flick must have been shot for ten days or so and you can make out the quick cuts in various scenes... the casting must have been done from a group of slum dwellers.", "X": null, "Y": 1, "idx": 83}
{"C": "and insult to humanity. i cant believe i wasted money on this crap !!!!!", "X": null, "Y": 1, "idx": 84}
{"C": "its content is anything but subtle and as a whole it is lackluster and uninteresting", "X": null, "Y": 1, "idx": 85}
{"C": "terrible film that's never suspenseful and feels like it was shot in one day", "X": null, "Y": 1, "idx": 86}
{"C": "this is one of the worst movie i have ever seen. ... ", "X": null, "Y": 1, "idx": 87}
{"C": "avoid if you have a decent sense of the ridiculous", "X": null, "Y": 1, "idx": 88}
{"C": "the script can be so bad that the viewer almost hopes the zombies will win.", "X": null, "Y": 1, "idx": 89}
{"C": "Narration is too slow to the point that it was boring.", "X": null, "Y": 1, "idx": 90}
{"C": "had to turn it off before the end I found it so bad ", "X": null, "Y": 1, "idx": 91}
{"C": "no story, no acting, no suspense, and no closure 10/23/2001 ", "X": null, "Y": 1, "idx": 92}
{"C": "I fell asleep. Might have been better if I hadn't.", "X": null, "Y": 1, "idx": 93}
{"C": "if you have seen the original series, you will be totally disappointed", "X": null, "Y": 1, "idx": 94}
{"C": "Horrible actors, horrible story, horrible acting, everything about this film is horrible .", "X": null, "Y": 1, "idx": 95}
{"C": "they went too far with the language and was boring and lacked character development. 2/10", "X": null, "Y": 1, "idx": 96}
{"C": "a good cast ruined by a poor script and a director who can't seem to decide if it's a comedy or horror flick...", "X": null, "Y": 1, "idx": 97}
{"C": "The lead actor was attractive and delivered a good performance. The supporting cast was serviceable at best. The story was predictable and unoriginal. It was nothing special.", "X": null, "Y": 1, "idx": 98}
{"C": "an uninspired story, and given the ample cast of characters, I didn't care at all for anyone.", "X": null, "Y": 1, "idx": 99}
{"C": "0/10 ... Awful movie, didn't like anything at all, a waste of time and money.", "X": null, "Y": 1, "idx": 100}
{"C": "Saw it when I was a kid and though it was pretty funny. Now, I'm 16 and I think the movie is pretty stupid, and I say that even though I'm a girl. ", "X": null, "Y": 1, "idx": 101}
{"C": "the story is not new or even remotely interesting and is a waste of time", "X": null, "Y": 1, "idx": 102}
{"C": "I will never buy a ticket to see another movie with him in it! ", "X": null, "Y": 1, "idx": 103}
{"C": "What's with all the melodrama? I understand this is based on a true story but that doesn't mean the filmmakers can't tweak it a bit, right? Am I the only one who found myself reaching for the fast forward button throughout the film? The casting of Julia Roberts was a huge mistake and the director didn't help matters much. She looked bored throughout and the only spark that was evident was from Billy Crudup.", "X": null, "Y": 1, "idx": 104}
{"C": "poorly structured with very little dialog, two bumbling cops. boring. ", "X": null, "Y": 1, "idx": 105}
{"C": "I found nothing good about the movie. A total waste of time and money. ", "X": null, "Y": 1, "idx": 106}
{"C": "The tiger isn't even realistic- it's more like a 4 year olds drawing of a tiger", "X": null, "Y": 1, "idx": 107}
{"C": "had the potential to be good, but was predictable 86%!", "X": null, "Y": 1, "idx": 108}
{"C": "The movie is a dud. The script is nonsensical, and the movie is boring.", "X": null, "Y": 1, "idx": 109}
{"C": "movies can be classified as atrocious and then there are movies like this...boring,unintelligible,laughable... ", "X": null, "Y": 1, "idx": 110}
{"C": "This is a terrible piece of work, I can't believe it won awards. ", "X": null, "Y": 1, "idx": 111}
{"C": "In the entire movie, I didn't feel anything for the characters. The acting and dialogues were just plain bad.", "X": null, "Y": 1, "idx": 112}
{"C": "Very cheesy , acting was bad, dubbing was even worse and it was one of the boring movies i ever seen!", "X": null, "Y": 1, "idx": 113}
{"C": "I was disappointed to see that Brad Pitt is currently still working. ", "X": null, "Y": 1, "idx": 114}
{"C": "Fill your mouth with the long list of movies that used a typical formula to make you believe that you are happy while you watch their film but they were all more interesting than the uninspired dreck that drips from your speaker", "X": null, "Y": 1, "idx": 115}
{"C": "The film is uninteresting, poorly written, and the acting is only about average, and the dialog is terrible.", "X": null, "Y": 1, "idx": 116}
