{"C": "it is a welcome addition to the canon of new age stories that have caught on quite well with audiences the world over.", "X": null, "Y": 0, "idx": 0}
{"C": "As a stand alone, it was fine. I wouldn't see it again", "X": null, "Y": 0, "idx": 1}
{"C": "It just works, and it does so from start to finish .", "X": null, "Y": 0, "idx": 2}
{"C": "you'll laugh, you'll cry, you'll have a great time .", "X": null, "Y": 0, "idx": 3}
{"C": "sure, its dumb, but its also funny and fun, so its a pass", "X": null, "Y": 0, "idx": 4}
{"C": "If you see no deeper than action and sex, you will enjoy it.", "X": null, "Y": 0, "idx": 5}
{"C": "I remember the first time i saw it it made me cry ... i mean i was in tears!", "X": null, "Y": 0, "idx": 6}
{"C": "This is an excellent romantic comedy that relies more on wit and character than on silly, typical formula. A lot of people I know walked away from this movie disappointed, but I found it an enjoyable experience. I also don't understand why Hollywood thinks that 'quirkiness' is more important than story, or why they can't seem to create movies in which the plot is interesting and makes sense.", "X": null, "Y": 0, "idx": 7}
{"C": "I have seen both the first and second in this series but this is by far the best. Liam is very good as usual, and is developing a great rapport with the young Jennifer Carpenter. The twist at the end was terrific and the fight sequences at the end, just great! So glad that I don't have to suffer through another crapfest like ", "X": null, "Y": 0, "idx": 8}
{"C": "great sense of humour, the way how the movie begins and ends and the evolution of the plot", "X": null, "Y": 0, "idx": 9}
{"C": "One of the best romance films of the last 5 years", "X": null, "Y": 0, "idx": 10}
{"C": "i felt like I was in class watching an art film about the inner workings of an artist. ", "X": null, "Y": 0, "idx": 11}
{"C": "I felt so much for Claire, because i used to be in a similar position.", "X": null, "Y": 0, "idx": 12}
{"C": "its 103 minutes of mindless yet surprisingly effective, mildly enjoyable carnage...", "X": null, "Y": 0, "idx": 13}
{"C": "cloverfield (2008) is not a perfect movie, and i think that in fact the marketing machine .", "X": null, "Y": 0, "idx": 14}
{"C": "The movie was actually pretty good. Yes, it's a bit preachy and the Martian was just a plot device to advance the agenda of the director, but it was an interesting watch.", "X": null, "Y": 0, "idx": 15}
{"C": "this film would've been more fun if it wasn't so embarrassingly stupid", "X": null, "Y": 0, "idx": 16}
{"C": "Cars is amazingly cute film and it easily could be your kid's favorite new film.", "X": null, "Y": 0, "idx": 17}
{"C": "Is a sure-fire crowd pleaser; a giddy, gory and boisterous mix of the ...", "X": null, "Y": 0, "idx": 18}
{"C": "This movie is well made.  It was completely captivating, emotional and riveting.", "X": null, "Y": 0, "idx": 19}
{"C": "I think it's a great movie but it is a little too predictable, with the exception of the ending that caught me totally off guard, but it was a little disappointing.", "X": null, "Y": 0, "idx": 20}
{"C": "the time simply flies with loads of fun and mad energy! ", "X": null, "Y": 0, "idx": 21}
{"C": "is a deeply moving movie about love and humanity. We do not see any preachy stuff about the issue of gay rights in the movie. The movie has some amazing performances by Salman Khan and Hrithik Roshan.", "X": null, "Y": 0, "idx": 22}
{"C": "This movie did a really good job showing me some of the trials, pain, joy, humor and inspiration I can expect.", "X": null, "Y": 0, "idx": 23}
{"C": "Love the story and the great performance from Ralph Fiennes. It is well-acted and thought provoking.", "X": null, "Y": 0, "idx": 24}
{"C": "Its inspirational tale of one mans mission to make a difference in the lives of children in need is worth watching. ", "X": null, "Y": 0, "idx": 25}
{"C": "i enjoyed the movie.i like the way it is presented.", "X": null, "Y": 0, "idx": 26}
{"C": "Wish I could have seen more of this. A great premise squandered.", "X": null, "Y": 0, "idx": 27}
{"C": "an interesting story line that pulls you in and keeps you guessing as to the outcome", "X": null, "Y": 0, "idx": 28}
{"C": "...an entertaining watch, albeit not as fresh and delightful as you'd hope.", "X": null, "Y": 0, "idx": 29}
{"C": "I laughed, I cried. I laughed again. I'm glad that I didn't read any of the reviews before I saw the movie.", "X": null, "Y": 0, "idx": 30}
{"C": "A very strong start... great comic timing.... to say nothing of Jaya Bachchan's electrifying performance", "X": null, "Y": 0, "idx": 31}
{"C": "It is a nice movie to watch with a lovely moral lesson.", "X": null, "Y": 0, "idx": 32}
{"C": "beyong the first time viewer, 3 years from now we might find this film is rather boring", "X": null, "Y": 0, "idx": 33}
{"C": "Love the plot, character development and how realistic it is.", "X": null, "Y": 0, "idx": 34}
{"C": "What a pleasure to see a well acted and executed period piece with some surprises. Even those familiar with Jane Austen's works will be in for some good twists.", "X": null, "Y": 0, "idx": 35}
{"C": "loved it loved it loved it. a classic in my books!", "X": null, "Y": 0, "idx": 36}
{"C": "This is a brilliant adaptation of a grim novel that deserved to be adapted...in fact, I like it better than the novel. The acting is great. The camerawork is stunning. Every single scene is a powerful portrait of a difficult time in our history.", "X": null, "Y": 0, "idx": 37}
{"C": "Don't take it seriously. Its a typical south indian masala entertainer", "X": null, "Y": 0, "idx": 38}
{"C": "There was a high ratio of funny stuff in the movie.", "X": null, "Y": 0, "idx": 39}
{"C": "Made me want to learn more about the troubles in Northern Ireland", "X": null, "Y": 0, "idx": 40}
{"C": "This movie is absolutely thrilling from start to finish. 9/10", "X": null, "Y": 0, "idx": 41}
{"C": "i'm not the most romantic person and i'm not a chick. ", "X": null, "Y": 0, "idx": 42}
{"C": "i really enjoyed the film...amazing how you can get so much history in only 2 hrs", "X": null, "Y": 0, "idx": 43}
{"C": "it does the almost impossible - it is able to transcend the cliches and stereotypes", "X": null, "Y": 0, "idx": 44}
{"C": "I have to say, despite the religious theme, this was a very good movie.", "X": null, "Y": 0, "idx": 45}
{"C": "It's amazing that an action movie with so little blood can still be scary", "X": null, "Y": 0, "idx": 46}
{"C": "I loved this film! What a breath of fresh air compared to the brain-numbing action flicks that are churned out today. ", "X": null, "Y": 0, "idx": 47}
{"C": "I don't think its particularly well-made, but that's the joy of it. \n good fun.", "X": null, "Y": 0, "idx": 48}
{"C": "a creative directorial debut from italian actress valeria bruni toscano who makes it hard to guess that this is her first time in the director's chair.", "X": null, "Y": 0, "idx": 49}
{"C": "I would give this movie 10 stars if i could!", "X": null, "Y": 0, "idx": 50}
{"C": "no movies were harmed in the making of this movie ", "X": null, "Y": 0, "idx": 51}
{"C": "an awesome movie about all those people in the 70's .", "X": null, "Y": 0, "idx": 52}
{"C": "This film is fun and my kids enjoyed it a lot! .. The songs are entertaining and the effects were very well done .. the story line is a bit thin but the movie is entertaining", "X": null, "Y": 0, "idx": 53}
{"C": "Like the director's first movie, there is a great deal of atmosphere in the film", "X": null, "Y": 0, "idx": 54}
{"C": "Farewell is not as flashy as other films in the director's repertoire, but it's a strong, sensitive work that builds to an effective emotional climax.", "X": null, "Y": 0, "idx": 55}
{"C": "This movie has great acting and a great story, you would think there would be more movies with this theme. 9/10", "X": null, "Y": 0, "idx": 56}
{"C": "The lines are absolutely hilarious and well delivered. It's a shame some may be lost on a cinema audience", "X": null, "Y": 0, "idx": 57}
{"C": "they handle the tone and story with the most care ", "X": null, "Y": 0, "idx": 58}
{"C": "Very good script, characterization, screenplay, acting. The Director has an eye for details. There is some wonderful visuals in the movie. Background score is superb. Akshay Kumar is amazing in the movie. Vidya Balan has delivered a stellar performance.", "X": null, "Y": 0, "idx": 59}
{"C": "a clear reminder of why we fell in love with him to begin with", "X": null, "Y": 0, "idx": 60}
{"C": "Trailers didn't do it justice; better character study than any Marvel movie", "X": null, "Y": 0, "idx": 61}
{"C": "I thought it was a movie with a great deal of heart.", "X": null, "Y": 0, "idx": 62}
{"C": "and feels like some of what M. Night Shyamalan brought to the cinema in the past.", "X": null, "Y": 0, "idx": 63}
{"C": "I loved this movie. I always thought she was the best of all...", "X": null, "Y": 0, "idx": 64}
{"C": "a very well done movie. for being a low budget movie, it does a very good job.", "X": null, "Y": 0, "idx": 65}
{"C": "who can resist a charming and charismatic movie of adventure , romance and action ?", "X": null, "Y": 0, "idx": 66}
{"C": "The long-awaited adaptation of Stephenie Meyer's wildly popular vampire saga Twilight has finally arrived in theaters. The Twilight Saga: New Moon is the second book in the series, but the first movie based on Stephenie Meyer's book. ", "X": null, "Y": 1, "idx": 67}
{"C": "fails to create a real, lasting connection between its characters .", "X": null, "Y": 1, "idx": 68}
{"C": "This is the worse movie I've seen in years. The plot was stupid and predictable and the acting was atrocious. The film was not funny at all and not even worth renting. My girlfriend liked it, which is very scary.", "X": null, "Y": 1, "idx": 69}
{"C": "A waste of your time, unless you can recite the script.", "X": null, "Y": 1, "idx": 70}
{"C": "a director that seems at war with his cast ... ", "X": null, "Y": 1, "idx": 71}
{"C": "Lacks a fresh take on material and the pacing makes it a chore to watch. ", "X": null, "Y": 1, "idx": 72}
{"C": "it's a shame that it didn't have more of the humor from the novel in it.", "X": null, "Y": 1, "idx": 73}
{"C": "should i go see this movie?  the action is exciting but the characters and the story are horrible. skip it.", "X": null, "Y": 1, "idx": 74}
{"C": "though it is very ambitious and one wishes it well...", "X": null, "Y": 1, "idx": 75}
{"C": "First I thought there are no Chinese in New York. Then I thought this movie is much like Indian Ocean but far from being a HARRY POTTER. Finally I was dragged out of the hall kicking and screaming.", "X": null, "Y": 1, "idx": 76}
{"C": "I did not see the movie but I hated the book.", "X": null, "Y": 1, "idx": 77}
{"C": "was a poor ending to the series and should have ended at the fourth film", "X": null, "Y": 1, "idx": 78}
{"C": "a mish-mash of lame jokess, poor visual effects, and dumb plot .", "X": null, "Y": 1, "idx": 79}
{"C": "The movie is about nothing. The film lacks the humanism that characterized the best of American films, so it is depressing to watch. It is nothing more than a group of wealthy white folks from San Francisco sitting around talking about problems that only they experience. The dialogue is shallow, the plot doesn't go anywhere, and all it leads to is a feeling of helplessness and hopelessness.", "X": null, "Y": 1, "idx": 80}
{"C": "I do not understand why this film was made. I find it very difficult to believe that anyone thought it would be worth making.", "X": null, "Y": 1, "idx": 81}
{"C": ".. spoiler: it got all confusing on the third act when they tried to explain the plot in expository dialogues. . ", "X": null, "Y": 1, "idx": 82}
{"C": "This has got to be one of the worst movies I have seen ever...!!! Not only the storyline is too vague and unrealistic but the so called actors and actresses are too bad to be called an actors and actresses... The flick must have been shot for ten days or so and you can make out the quick cuts in various scenes... the casting must have been done from a group of slum dwellers.", "X": null, "Y": 1, "idx": 83}
{"C": "and insult to humanity. i cant believe i wasted money on this crap !!!!!", "X": null, "Y": 1, "idx": 84}
{"C": "its content is anything but subtle and as a whole it is lackluster and uninteresting", "X": null, "Y": 1, "idx": 85}
{"C": "terrible film that's never suspenseful and feels like it was shot in one day", "X": null, "Y": 1, "idx": 86}
{"C": "this is one of the worst movie i have ever seen. ... ", "X": null, "Y": 1, "idx": 87}
{"C": "avoid if you have a decent sense of the ridiculous", "X": null, "Y": 1, "idx": 88}
{"C": "the script can be so bad that the viewer almost hopes the zombies will win.", "X": null, "Y": 1, "idx": 89}
{"C": "Narration is too slow to the point that it was boring.", "X": null, "Y": 1, "idx": 90}
{"C": "had to turn it off before the end I found it so bad ", "X": null, "Y": 1, "idx": 91}
{"C": "no story, no acting, no suspense, and no closure 10/23/2001 ", "X": null, "Y": 1, "idx": 92}
{"C": "I fell asleep. Might have been better if I hadn't.", "X": null, "Y": 1, "idx": 93}
{"C": "if you have seen the original series, you will be totally disappointed", "X": null, "Y": 1, "idx": 94}
{"C": "Horrible actors, horrible story, horrible acting, everything about this film is horrible .", "X": null, "Y": 1, "idx": 95}
{"C": "they went too far with the language and was boring and lacked character development. 2/10", "X": null, "Y": 1, "idx": 96}
{"C": "a good cast ruined by a poor script and a director who can't seem to decide if it's a comedy or horror flick...", "X": null, "Y": 1, "idx": 97}
{"C": "The lead actor was attractive and delivered a good performance. The supporting cast was serviceable at best. The story was predictable and unoriginal. It was nothing special.", "X": null, "Y": 1, "idx": 98}
{"C": "an uninspired story, and given the ample cast of characters, I didn't care at all for anyone.", "X": null, "Y": 1, "idx": 99}
{"C": "0/10 ... Awful movie, didn't like anything at all, a waste of time and money.", "X": null, "Y": 1, "idx": 100}
{"C": "Saw it when I was a kid and though it was pretty funny. Now, I'm 16 and I think the movie is pretty stupid, and I say that even though I'm a girl. ", "X": null, "Y": 1, "idx": 101}
{"C": "the story is not new or even remotely interesting and is a waste of time", "X": null, "Y": 1, "idx": 102}
{"C": "I will never buy a ticket to see another movie with him in it! ", "X": null, "Y": 1, "idx": 103}
{"C": "What's with all the melodrama? I understand this is based on a true story but that doesn't mean the filmmakers can't tweak it a bit, right? Am I the only one who found myself reaching for the fast forward button throughout the film? The casting of Julia Roberts was a huge mistake and the director didn't help matters much. She looked bored throughout and the only spark that was evident was from Billy Crudup.", "X": null, "Y": 1, "idx": 104}
{"C": "poorly structured with very little dialog, two bumbling cops. boring. ", "X": null, "Y": 1, "idx": 105}
{"C": "I found nothing good about the movie. A total waste of time and money. ", "X": null, "Y": 1, "idx": 106}
{"C": "The tiger isn't even realistic- it's more like a 4 year olds drawing of a tiger", "X": null, "Y": 1, "idx": 107}
{"C": "had the potential to be good, but was predictable 86%!", "X": null, "Y": 1, "idx": 108}
{"C": "The movie is a dud. The script is nonsensical, and the movie is boring.", "X": null, "Y": 1, "idx": 109}
{"C": "movies can be classified as atrocious and then there are movies like this...boring,unintelligible,laughable... ", "X": null, "Y": 1, "idx": 110}
{"C": "This is a terrible piece of work, I can't believe it won awards. ", "X": null, "Y": 1, "idx": 111}
{"C": "In the entire movie, I didn't feel anything for the characters. The acting and dialogues were just plain bad.", "X": null, "Y": 1, "idx": 112}
{"C": "Very cheesy , acting was bad, dubbing was even worse and it was one of the boring movies i ever seen!", "X": null, "Y": 1, "idx": 113}
{"C": "I was disappointed to see that Brad Pitt is currently still working. ", "X": null, "Y": 1, "idx": 114}
{"C": "Fill your mouth with the long list of movies that used a typical formula to make you believe that you are happy while you watch their film but they were all more interesting than the uninspired dreck that drips from your speaker", "X": null, "Y": 1, "idx": 115}
{"C": "The film is uninteresting, poorly written, and the acting is only about average, and the dialog is terrible.", "X": null, "Y": 1, "idx": 116}
{"C": "it's another teen film to add to the pile of just plain boring crap! ", "X": null, "Y": 1, "idx": 117}
{"C": "I can't believe I actually sat through this entire movie. Maybe it was because I couldn't stand up to walk out, maybe because the theater was so slow, maybe it was the two scoops of ice cream I ate before the movie started, but I can't figure out why I continued to watch the most painfully bad movie I have seen in years.", "X": null, "Y": 1, "idx": 118}
{"C": "have to say that I hated this movie, and for many reasons. first, they give you no background information on the characters, making it difficult to care about what happens to them next. second, as I'm sure most of you already know, there are two timelines. one in the present and one in 1997, 14 years earlier. This would be fine, but we never get a reason as to why the timelines are in such turmoil.", "X": null, "Y": 1, "idx": 119}
{"C": "couldn't follow at times, a bit too much going on", "X": null, "Y": 1, "idx": 120}
{"C": "The script, for example, sometimes cuts to black without clear transition, as if the editor is lazy, or the film is incomprehensible and doesn't need explanation.", "X": null, "Y": 1, "idx": 121}
{"C": "A dull and poorly written love story between a half-breed and her White Man, whose name I can't remember...", "X": null, "Y": 1, "idx": 122}
{"C": "the movie is not funny and neither does it send any message.", "X": null, "Y": 1, "idx": 123}
{"C": "the movie really fell flat with me, to the point that I came to despise the main character. ", "X": null, "Y": 1, "idx": 124}
{"C": "Despite moments of dark humor that kept me chuckling all the way through, this film is too grim and distressing to be considered a comedy.", "X": null, "Y": 1, "idx": 125}
{"C": "A badly directed and slow paced movie with awful acting. I like horror movies but this one was the worst one I ever seen, except maybe on MST3K.", "X": null, "Y": 1, "idx": 126}
{"C": "absolutely awful ! terrible acting, horrible story line, poor screen play, ", "X": null, "Y": 1, "idx": 127}
{"C": "It felt like a 4 hour snail's pace movie. It was like watching paint dry. The movie left me with a huge headache. This was a very bad movie, one I was disappointed to have purchased the DVD for. All around a horrible movie.", "X": null, "Y": 1, "idx": 128}
{"C": "journey ... of several ... characters plodding endlessly across the screen.", "X": null, "Y": 1, "idx": 129}
{"C": "This movie is unrealistic and impossible. I couldn't even finish watching it. Never did I expect that aliens will look like humans. I always thought of them as very ugly looking and unfeeling creatures.", "X": null, "Y": 1, "idx": 130}
{"C": "what made the movie a success then ........is not making it a success now .............", "X": null, "Y": 1, "idx": 131}
{"C": "This is the worst movie I have ever seen in my entire life. I am utterly disappointed by the film, as the trailer for the film looked promising and visually stunning. Sadly, the movie is a mess. I wish I could get a refund for the movie ticket. Now that is saying something. It seems that every other sentence is spewed with bad language, and the main characters are just plain unlikable and morally corrupt to the core.", "X": null, "Y": 1, "idx": 132}
{"C": "There is no sense of adventure and a lack of joy in this production that starts well and then falters.", "X": null, "Y": 1, "idx": 133}
{"C": "The slow pace was killer for this film. It started slow and stayed slow. The dialogue was not interesting, the plot was predictable and frankly I did not care about any of the characters. ", "X": null, "Y": 1, "idx": 134}
{"C": "a rare movie that will be in the festival circuit and that's about it... i wish i could say more about this film, but it's actually quite dull. no one was breathing hard or out of breath, it was very dull.", "X": null, "Y": 1, "idx": 135}
{"C": "acting was bland and the movie was boring...watching paint dry is more interesting...", "X": null, "Y": 1, "idx": 136}
{"C": "Though the movie has good narrative, the gore element is completely missing. ", "X": null, "Y": 1, "idx": 137}
{"C": "<C>is a typical Hollywood product. Too much violence, too much crime, not enough romance.", "X": null, "Y": 1, "idx": 138}
{"C": "has been recycled so many times before and comes off like a third-rate parody of these ", "X": null, "Y": 1, "idx": 139}
{"C": "You should watch this film. Don't expect anything good though.", "X": null, "Y": 1, "idx": 140}
{"C": "lackluster direction, dull writing, mediocre acting and an uneasy mix of adult themes and bad jokes.", "X": null, "Y": 1, "idx": 141}
{"C": "I can't believe they made a prequel to such an amazing film. 'An American in Paris' was fantastic, with Gene Kelly's dancing and everything! They could have made a good movie just about him, no need for a prequel. This is just ridiculous. 2/10. ", "X": null, "Y": 1, "idx": 142}
{"C": "There is not a single redeeming quality of this movie. It's horrible, the acting is horrible, the story is horrible, the music is horrible... it's just horrible! :P ", "X": null, "Y": 1, "idx": 143}
{"C": "this movie just stunk... 90 minutes of my life i'll never get back.", "X": null, "Y": 1, "idx": 144}
{"C": "What a waste of time! I went into the movie expecting a romance and comedy, but it was nothing but a drama. 40% romance, 20% comedy, and 40% drama, respectively. If I wanted a drama, I'd go see Shutter Island. ", "X": null, "Y": 1, "idx": 145}
{"C": "is a miss that doesn't know what kind of movie it wants to be.", "X": null, "Y": 1, "idx": 146}
{"C": "This is so laughably bad it is only good for the purpose of a couple of laughs. A poor story with poor acting and directing it's a low budget film by students and it shows.", "X": null, "Y": 1, "idx": 147}
{"C": "There's a lot of talent wasted here. Haggis overuses his themes and is unable to let his characters go in this soapy melodrama.", "X": null, "Y": 1, "idx": 148}
{"C": "you have to be an expert on chinese history to get anything out of this", "X": null, "Y": 1, "idx": 149}
{"C": "You should give it a miss if you hate yourself ... or hate the world", "X": null, "Y": 1, "idx": 150}
{"C": "Being a big fan of Peter Fonda's work, I was very disappointed in his performance in this movie. I have watched it several times and it just continues to get worse as I age. I am hoping for his sake that this movie did not tarnish his career too much. He was also one of the producers. I have always enjoyed his nonchalant acting style, but it did not work here. Probably because he was the wrong age for the role he played.", "X": null, "Y": 1, "idx": 151}
{"C": "Never before has God been portrayed as such a whiny bitch. I walked out after 30 minutes, refusing to watch further defamation of my God. Shame on them.", "X": null, "Y": 1, "idx": 152}
{"C": "i have seen the film... It is very boring film... There is no story in the film", "X": null, "Y": 1, "idx": 153}
{"C": "The script is ...haha... a joke, there's no real plot, ...", "X": null, "Y": 1, "idx": 154}
{"C": "the film starts by making you think it is something else, so it is a real disappointment.", "X": null, "Y": 1, "idx": 155}
{"C": "I'm sorry, but I must ask that the entire cast be removed from the Academy, as they have no talent and were pathetic.", "X": null, "Y": 1, "idx": 156}
{"C": "Seriously what the heck was this?  the plot and character development is terrible  the dialog is bad  the acting is horrible  the direction is amateur  and just flat out the worst ending ever . i got the feeling that this was like the guy who got picked last in gym class made this movie.", "X": null, "Y": 1, "idx": 157}
{"C": "On the good side, he has perfected the ability to endlessly repeat words and phrases that he knows will resonate with a dumbed-down audience. On the bad side, he's an idiot.", "X": null, "Y": 1, "idx": 158}
{"C": "watching a film is like going through somebody's memories.Its better to forget the bad and remember the good..But this one is a perfect example of the opposite", "X": null, "Y": 1, "idx": 159}
{"C": "1 star: slow and boring 2 star: badly dubbed and I can't understand what's going on! 3 star: so-so", "X": null, "Y": 1, "idx": 160}
{"C": "I could not see a white man in a role like this. You can find countless black actors that are funnier than Chris Tucker. 10 years ago this movie would not even get made.", "X": null, "Y": 1, "idx": 161}
{"C": "it is hard to take seriously a movie that becomes more melodramatic and outrageous by the minute, or to like a movie with such little faith in its viewers. ", "X": null, "Y": 1, "idx": 162}
{"C": "The concept of this movie is really very interesting, but it is a bit far-fetched. ", "X": null, "Y": 1, "idx": 163}
{"C": "This movie is atrocious, it cannot be called a movie... ", "X": null, "Y": 1, "idx": 164}
{"C": "Why is it that if you make a movie that sounds good, but then it turns out to be bad (or is bad), you are attacked for lying? I went to the theater and was fooled. I didn't know it was a true story, but it had all the signs (including the ridiculous protagonist). My advice to you is don't go see it. It's boring, pointless, overly sentimental, and insufferably sanctimonious.", "X": null, "Y": 1, "idx": 165}
{"C": "Goran Visnjic and Natascha McElhone ...... completely missed the mark as the intellectual couple. McElhone's character did nothing but whine .", "X": null, "Y": 1, "idx": 166}
{"C": "There are many fine moments in this film. Spencer Tracy ... is superb...", "X": null, "Y": 0, "idx": 171}
{"C": "I would give it a 10 if possible. As a teenager it taught me a great deal about life. Not to get involved in things I knew nothing about or to be prejudice of a certain group of people. Most of all to treat others the way I wanted to be treated. I am now 44 and still remember the values I learned watching this movie. Awesome flick!", "X": null, "Y": 0, "idx": 172}
{"C": "a good ensemble cast and a very strange but coherent storyline. ", "X": null, "Y": 0, "idx": 173}
{"C": "Its a bit over-the-top at times, but with so much cynicism in today's world, this was a breath of fresh air.", "X": null, "Y": 0, "idx": 174}
{"C": "You wanna give it a 10/10? Here's a 10/10 for ya.", "X": null, "Y": 0, "idx": 175}
{"C": "As a thriller, this is intense and fast paced. It takes no time to get going, and the plot is interesting and engaging.", "X": null, "Y": 0, "idx": 176}
{"C": "that it takes a somewhat familiar topic and make it fresh again", "X": null, "Y": 0, "idx": 177}
{"C": "if you look beyond the movie's artifice, its charm is undeniable", "X": null, "Y": 0, "idx": 178}
{"C": "It's an enjoyable viewing, with lots of cool moments and an ambitious plot.", "X": null, "Y": 0, "idx": 179}
{"C": "It is fun. it is a film to be seen for the young ones. ", "X": null, "Y": 0, "idx": 180}
{"C": "Most movies are based on books, but that's the first time I've seen a movie which is more like an essay", "X": null, "Y": 0, "idx": 181}
{"C": "It's like I always say, the less plot the better.", "X": null, "Y": 0, "idx": 182}
{"C": "I will be the first to admit that the animation is crude in some parts. What I liked about the movie is that it had a very fun story line and I loved the songs.", "X": null, "Y": 0, "idx": 183}
{"C": "This is a funny movie with great actors, specially Gene Hackman ", "X": null, "Y": 0, "idx": 184}
{"C": "Well made actioner with a refreshing twist and a surprising level of acting for a kung-fu flick.", "X": null, "Y": 0, "idx": 185}
{"C": "The most underrated movie that I've ever seen in my life!!!", "X": null, "Y": 0, "idx": 186}
{"C": "I enjoyed it! It was as thought-provoking as it was gripping.", "X": null, "Y": 0, "idx": 187}
{"C": "This is a 'Roman Holiday' type of movie with Aishwarya as the Ann Hathaway of India. I am not surprised with the actors that have done justice to the characters in the movie. Sure the movie was predictable, but Aishwarya Rai at her best, makes you fall for her and that alone makes this movie worth a watch.", "X": null, "Y": 0, "idx": 188}
{"C": "The movie is not fast paced and some of the drama was a bit too much for me, but I did like it.", "X": null, "Y": 0, "idx": 189}
{"C": "The movie is sometimes a bit slow, but very well made .", "X": null, "Y": 0, "idx": 190}
{"C": "It's a very touching, simple movie and it does a good job at portraying what could have been a very cynical and melodramatic subject matter. ... ", "X": null, "Y": 0, "idx": 191}
{"C": "I don't have anything new to say about this movie. It's a 5-star movie.", "X": null, "Y": 0, "idx": 192}
{"C": "the story of an individual life that stands for all 20th century china ", "X": null, "Y": 0, "idx": 193}
{"C": "the movie is full of clever twists and turns that have you guessing right up to the end ", "X": null, "Y": 0, "idx": 194}
{"C": "I thought the story was interesting and I thought it was handled well", "X": null, "Y": 0, "idx": 195}
{"C": "The characters have a certain charm and it all makes for a very entertaining hour and a half", "X": null, "Y": 0, "idx": 196}
{"C": "Stevens’s film is daring, expertly assembled and intriguing, an unflinching look at the extremes of materialism that uncovers the essential moral underpinnings of the American Dream, in all its dangerous glory.", "X": null, "Y": 0, "idx": 197}
{"C": "I think it is one of the best film I have seen this year.", "X": null, "Y": 0, "idx": 198}
{"C": "It provides a good amount of action, well-crafted story and memorable characters .", "X": null, "Y": 0, "idx": 199}
{"C": "The visual direction and editing were amazing in this film. 7/10 ", "X": null, "Y": 0, "idx": 200}
{"C": "+ the amazing performances of Daniel Day-Lewis and Penelope Cruz + the complex and interesting plot + the many beautiful scenes and camera work + the fine editing + the good, but not amazing, performances of Marion Cotillard and Judi Dench + the great costumes + the beautiful musical score ", "X": null, "Y": 0, "idx": 201}
{"C": "It's a slow moving movie with all the subtlety of a sledgehammer. But it's a good story that is well told, and if the ending is far from subtle, it still moves the story along. I would recommend this movie.", "X": null, "Y": 0, "idx": 202}
{"C": "...one of the funniest movies I've seen in a while...", "X": null, "Y": 0, "idx": 203}
