{"C": "it is a welcome addition to the canon of new age stories that have caught on quite well with audiences the world over.", "X": null, "Y": 0, "idx": 0}
{"C": "As a stand alone, it was fine. I wouldn't see it again", "X": null, "Y": 0, "idx": 1}
{"C": "It just works, and it does so from start to finish .", "X": null, "Y": 0, "idx": 2}
{"C": "you'll laugh, you'll cry, you'll have a great time .", "X": null, "Y": 0, "idx": 3}
{"C": "sure, its dumb, but its also funny and fun, so its a pass", "X": null, "Y": 0, "idx": 4}
{"C": "If you see no deeper than action and sex, you will enjoy it.", "X": null, "Y": 0, "idx": 5}
{"C": "I remember the first time i saw it it made me cry ... i mean i was in tears!", "X": null, "Y": 0, "idx": 6}
{"C": "This is an excellent romantic comedy that relies more on wit and character than on silly, typical formula. A lot of people I know walked away from this movie disappointed, but I found it an enjoyable experience. I also don't understand why Hollywood thinks that 'quirkiness' is more important than story, or why they can't seem to create movies in which the plot is interesting and makes sense.", "X": null, "Y": 0, "idx": 7}
{"C": "I have seen both the first and second in this series but this is by far the best. Liam is very good as usual, and is developing a great rapport with the young Jennifer Carpenter. The twist at the end was terrific and the fight sequences at the end, just great! So glad that I don't have to suffer through another crapfest like ", "X": null, "Y": 0, "idx": 8}
{"C": "great sense of humour, the way how the movie begins and ends and the evolution of the plot", "X": null, "Y": 0, "idx": 9}
{"C": "One of the best romance films of the last 5 years", "X": null, "Y": 0, "idx": 10}
{"C": "i felt like I was in class watching an art film about the inner workings of an artist. ", "X": null, "Y": 0, "idx": 11}
{"C": "I felt so much for Claire, because i used to be in a similar position.", "X": null, "Y": 0, "idx": 12}
{"C": "its 103 minutes of mindless yet surprisingly effective, mildly enjoyable carnage...", "X": null, "Y": 0, "idx": 13}
{"C": "cloverfield (2008) is not a perfect movie, and i think that in fact the marketing machine .", "X": null, "Y": 0, "idx": 14}
{"C": "The movie was actually pretty good. Yes, it's a bit preachy and the Martian was just a plot device to advance the agenda of the director, but it was an interesting watch.", "X": null, "Y": 0, "idx": 15}
{"C": "this film would've been more fun if it wasn't so embarrassingly stupid", "X": null, "Y": 0, "idx": 16}
{"C": "Cars is amazingly cute film and it easily could be your kid's favorite new film.", "X": null, "Y": 0, "idx": 17}
{"C": "Is a sure-fire crowd pleaser; a giddy, gory and boisterous mix of the ...", "X": null, "Y": 0, "idx": 18}
{"C": "This movie is well made.  It was completely captivating, emotional and riveting.", "X": null, "Y": 0, "idx": 19}
{"C": "I think it's a great movie but it is a little too predictable, with the exception of the ending that caught me totally off guard, but it was a little disappointing.", "X": null, "Y": 0, "idx": 20}
{"C": "the time simply flies with loads of fun and mad energy! ", "X": null, "Y": 0, "idx": 21}
{"C": "is a deeply moving movie about love and humanity. We do not see any preachy stuff about the issue of gay rights in the movie. The movie has some amazing performances by Salman Khan and Hrithik Roshan.", "X": null, "Y": 0, "idx": 22}
{"C": "This movie did a really good job showing me some of the trials, pain, joy, humor and inspiration I can expect.", "X": null, "Y": 0, "idx": 23}
{"C": "Love the story and the great performance from Ralph Fiennes. It is well-acted and thought provoking.", "X": null, "Y": 0, "idx": 24}
{"C": "Its inspirational tale of one mans mission to make a difference in the lives of children in need is worth watching. ", "X": null, "Y": 0, "idx": 25}
{"C": "i enjoyed the movie.i like the way it is presented.", "X": null, "Y": 0, "idx": 26}
{"C": "Wish I could have seen more of this. A great premise squandered.", "X": null, "Y": 0, "idx": 27}
{"C": "an interesting story line that pulls you in and keeps you guessing as to the outcome", "X": null, "Y": 0, "idx": 28}
{"C": "...an entertaining watch, albeit not as fresh and delightful as you'd hope.", "X": null, "Y": 0, "idx": 29}
{"C": "I laughed, I cried. I laughed again. I'm glad that I didn't read any of the reviews before I saw the movie.", "X": null, "Y": 0, "idx": 30}
{"C": "A very strong start... great comic timing.... to say nothing of Jaya Bachchan's electrifying performance", "X": null, "Y": 0, "idx": 31}
{"C": "It is a nice movie to watch with a lovely moral lesson.", "X": null, "Y": 0, "idx": 32}
{"C": "beyong the first time viewer, 3 years from now we might find this film is rather boring", "X": null, "Y": 0, "idx": 33}
{"C": "Love the plot, character development and how realistic it is.", "X": null, "Y": 0, "idx": 34}
{"C": "What a pleasure to see a well acted and executed period piece with some surprises. Even those familiar with Jane Austen's works will be in for some good twists.", "X": null, "Y": 0, "idx": 35}
{"C": "loved it loved it loved it. a classic in my books!", "X": null, "Y": 0, "idx": 36}
{"C": "This is a brilliant adaptation of a grim novel that deserved to be adapted...in fact, I like it better than the novel. The acting is great. The camerawork is stunning. Every single scene is a powerful portrait of a difficult time in our history.", "X": null, "Y": 0, "idx": 37}
{"C": "Don't take it seriously. Its a typical south indian masala entertainer", "X": null, "Y": 0, "idx": 38}
{"C": "There was a high ratio of funny stuff in the movie.", "X": null, "Y": 0, "idx": 39}
{"C": "Made me want to learn more about the troubles in Northern Ireland", "X": null, "Y": 0, "idx": 40}
{"C": "This movie is absolutely thrilling from start to finish. 9/10", "X": null, "Y": 0, "idx": 41}
{"C": "i'm not the most romantic person and i'm not a chick. ", "X": null, "Y": 0, "idx": 42}
{"C": "i really enjoyed the film...amazing how you can get so much history in only 2 hrs", "X": null, "Y": 0, "idx": 43}
{"C": "it does the almost impossible - it is able to transcend the cliches and stereotypes", "X": null, "Y": 0, "idx": 44}
{"C": "I have to say, despite the religious theme, this was a very good movie.", "X": null, "Y": 0, "idx": 45}
{"C": "It's amazing that an action movie with so little blood can still be scary", "X": null, "Y": 0, "idx": 46}
{"C": "I loved this film! What a breath of fresh air compared to the brain-numbing action flicks that are churned out today. ", "X": null, "Y": 0, "idx": 47}
{"C": "I don't think its particularly well-made, but that's the joy of it. \n good fun.", "X": null, "Y": 0, "idx": 48}
{"C": "a creative directorial debut from italian actress valeria bruni toscano who makes it hard to guess that this is her first time in the director's chair.", "X": null, "Y": 0, "idx": 49}
{"C": "I would give this movie 10 stars if i could!", "X": null, "Y": 0, "idx": 50}
{"C": "no movies were harmed in the making of this movie ", "X": null, "Y": 0, "idx": 51}
{"C": "an awesome movie about all those people in the 70's .", "X": null, "Y": 0, "idx": 52}
{"C": "This film is fun and my kids enjoyed it a lot! .. The songs are entertaining and the effects were very well done .. the story line is a bit thin but the movie is entertaining", "X": null, "Y": 0, "idx": 53}
{"C": "Like the director's first movie, there is a great deal of atmosphere in the film", "X": null, "Y": 0, "idx": 54}
{"C": "Farewell is not as flashy as other films in the director's repertoire, but it's a strong, sensitive work that builds to an effective emotional climax.", "X": null, "Y": 0, "idx": 55}
{"C": "This movie has great acting and a great story, you would think there would be more movies with this theme. 9/10", "X": null, "Y": 0, "idx": 56}
{"C": "The lines are absolutely hilarious and well delivered. It's a shame some may be lost on a cinema audience", "X": null, "Y": 0, "idx": 57}
{"C": "they handle the tone and story with the most care ", "X": null, "Y": 0, "idx": 58}
{"C": "Very good script, characterization, screenplay, acting. The Director has an eye for details. There is some wonderful visuals in the movie. Background score is superb. Akshay Kumar is amazing in the movie. Vidya Balan has delivered a stellar performance.", "X": null, "Y": 0, "idx": 59}
{"C": "a clear reminder of why we fell in love with him to begin with", "X": null, "Y": 0, "idx": 60}
{"C": "Trailers didn't do it justice; better character study than any Marvel movie", "X": null, "Y": 0, "idx": 61}
{"C": "I thought it was a movie with a great deal of heart.", "X": null, "Y": 0, "idx": 62}
{"C": "and feels like some of what M. Night Shyamalan brought to the cinema in the past.", "X": null, "Y": 0, "idx": 63}
{"C": "I loved this movie. I always thought she was the best of all...", "X": null, "Y": 0, "idx": 64}
{"C": "a very well done movie. for being a low budget movie, it does a very good job.", "X": null, "Y": 0, "idx": 65}
{"C": "who can resist a charming and charismatic movie of adventure , romance and action ?", "X": null, "Y": 0, "idx": 66}
{"C": "The long-awaited adaptation of Stephenie Meyer's wildly popular vampire saga Twilight has finally arrived in theaters. The Twilight Saga: New Moon is the second book in the series, but the first movie based on Stephenie Meyer's book. ", "X": null, "Y": 1, "idx": 67}
{"C": "fails to create a real, lasting connection between its characters .", "X": null, "Y": 1, "idx": 68}
{"C": "This is the worse movie I've seen in years. The plot was stupid and predictable and the acting was atrocious. The film was not funny at all and not even worth renting. My girlfriend liked it, which is very scary.", "X": null, "Y": 1, "idx": 69}
{"C": "A waste of your time, unless you can recite the script.", "X": null, "Y": 1, "idx": 70}
{"C": "a director that seems at war with his cast ... ", "X": null, "Y": 1, "idx": 71}
{"C": "Lacks a fresh take on material and the pacing makes it a chore to watch. ", "X": null, "Y": 1, "idx": 72}
{"C": "it's a shame that it didn't have more of the humor from the novel in it.", "X": null, "Y": 1, "idx": 73}
{"C": "should i go see this movie?  the action is exciting but the characters and the story are horrible. skip it.", "X": null, "Y": 1, "idx": 74}
{"C": "though it is very ambitious and one wishes it well...", "X": null, "Y": 1, "idx": 75}
{"C": "First I thought there are no Chinese in New York. Then I thought this movie is much like Indian Ocean but far from being a HARRY POTTER. Finally I was dragged out of the hall kicking and screaming.", "X": null, "Y": 1, "idx": 76}
{"C": "I did not see the movie but I hated the book.", "X": null, "Y": 1, "idx": 77}
{"C": "was a poor ending to the series and should have ended at the fourth film", "X": null, "Y": 1, "idx": 78}
{"C": "a mish-mash of lame jokess, poor visual effects, and dumb plot .", "X": null, "Y": 1, "idx": 79}
{"C": "The movie is about nothing. The film lacks the humanism that characterized the best of American films, so it is depressing to watch. It is nothing more than a group of wealthy white folks from San Francisco sitting around talking about problems that only they experience. The dialogue is shallow, the plot doesn't go anywhere, and all it leads to is a feeling of helplessness and hopelessness.", "X": null, "Y": 1, "idx": 80}
{"C": "I do not understand why this film was made. I find it very difficult to believe that anyone thought it would be worth making.", "X": null, "Y": 1, "idx": 81}
{"C": ".. spoiler: it got all confusing on the third act when they tried to explain the plot in expository dialogues. . ", "X": null, "Y": 1, "idx": 82}
{"C": "This has got to be one of the worst movies I have seen ever...!!! Not only the storyline is too vague and unrealistic but the so called actors and actresses are too bad to be called an actors and actresses... The flick must have been shot for ten days or so and you can make out the quick cuts in various scenes... the casting must have been done from a group of slum dwellers.", "X": null, "Y": 1, "idx": 83}
{"C": "and insult to humanity. i cant believe i wasted money on this crap !!!!!", "X": null, "Y": 1, "idx": 84}
{"C": "its content is anything but subtle and as a whole it is lackluster and uninteresting", "X": null, "Y": 1, "idx": 85}
{"C": "terrible film that's never suspenseful and feels like it was shot in one day", "X": null, "Y": 1, "idx": 86}
{"C": "this is one of the worst movie i have ever seen. ... ", "X": null, "Y": 1, "idx": 87}
{"C": "avoid if you have a decent sense of the ridiculous", "X": null, "Y": 1, "idx": 88}
{"C": "the script can be so bad that the viewer almost hopes the zombies will win.", "X": null, "Y": 1, "idx": 89}
{"C": "Narration is too slow to the point that it was boring.", "X": null, "Y": 1, "idx": 90}
{"C": "had to turn it off before the end I found it so bad ", "X": null, "Y": 1, "idx": 91}
{"C": "no story, no acting, no suspense, and no closure 10/23/2001 ", "X": null, "Y": 1, "idx": 92}
{"C": "I fell asleep. Might have been better if I hadn't.", "X": null, "Y": 1, "idx": 93}
{"C": "if you have seen the original series, you will be totally disappointed", "X": null, "Y": 1, "idx": 94}
{"C": "Horrible actors, horrible story, horrible acting, everything about this film is horrible .", "X": null, "Y": 1, "idx": 95}
{"C": "they went too far with the language and was boring and lacked character development. 2/10", "X": null, "Y": 1, "idx": 96}
{"C": "a good cast ruined by a poor script and a director who can't seem to decide if it's a comedy or horror flick...", "X": null, "Y": 1, "idx": 97}
{"C": "The lead actor was attractive and delivered a good performance. The supporting cast was serviceable at best. The story was predictable and unoriginal. It was nothing special.", "X": null, "Y": 1, "idx": 98}
{"C": "an uninspired story, and given the ample cast of characters, I didn't care at all for anyone.", "X": null, "Y": 1, "idx": 99}
{"C": "0/10 ... Awful movie, didn't like anything at all, a waste of time and money.", "X": null, "Y": 1, "idx": 100}
{"C": "Saw it when I was a kid and though it was pretty funny. Now, I'm 16 and I think the movie is pretty stupid, and I say that even though I'm a girl. ", "X": null, "Y": 1, "idx": 101}
{"C": "the story is not new or even remotely interesting and is a waste of time", "X": null, "Y": 1, "idx": 102}
{"C": "I will never buy a ticket to see another movie with him in it! ", "X": null, "Y": 1, "idx": 103}
{"C": "What's with all the melodrama? I understand this is based on a true story but that doesn't mean the filmmakers can't tweak it a bit, right? Am I the only one who found myself reaching for the fast forward button throughout the film? The casting of Julia Roberts was a huge mistake and the director didn't help matters much. She looked bored throughout and the only spark that was evident was from Billy Crudup.", "X": null, "Y": 1, "idx": 104}
{"C": "poorly structured with very little dialog, two bumbling cops. boring. ", "X": null, "Y": 1, "idx": 105}
{"C": "I found nothing good about the movie. A total waste of time and money. ", "X": null, "Y": 1, "idx": 106}
{"C": "The tiger isn't even realistic- it's more like a 4 year olds drawing of a tiger", "X": null, "Y": 1, "idx": 107}
{"C": "had the potential to be good, but was predictable 86%!", "X": null, "Y": 1, "idx": 108}
{"C": "The movie is a dud. The script is nonsensical, and the movie is boring.", "X": null, "Y": 1, "idx": 109}
{"C": "movies can be classified as atrocious and then there are movies like this...boring,unintelligible,laughable... ", "X": null, "Y": 1, "idx": 110}
{"C": "This is a terrible piece of work, I can't believe it won awards. ", "X": null, "Y": 1, "idx": 111}
{"C": "In the entire movie, I didn't feel anything for the characters. The acting and dialogues were just plain bad.", "X": null, "Y": 1, "idx": 112}
{"C": "Very cheesy , acting was bad, dubbing was even worse and it was one of the boring movies i ever seen!", "X": null, "Y": 1, "idx": 113}
{"C": "I was disappointed to see that Brad Pitt is currently still working. ", "X": null, "Y": 1, "idx": 114}
{"C": "Fill your mouth with the long list of movies that used a typical formula to make you believe that you are happy while you watch their film but they were all more interesting than the uninspired dreck that drips from your speaker", "X": null, "Y": 1, "idx": 115}
{"C": "The film is uninteresting, poorly written, and the acting is only about average, and the dialog is terrible.", "X": null, "Y": 1, "idx": 116}
{"C": "it's another teen film to add to the pile of just plain boring crap! ", "X": null, "Y": 1, "idx": 117}
{"C": "I can't believe I actually sat through this entire movie. Maybe it was because I couldn't stand up to walk out, maybe because the theater was so slow, maybe it was the two scoops of ice cream I ate before the movie started, but I can't figure out why I continued to watch the most painfully bad movie I have seen in years.", "X": null, "Y": 1, "idx": 118}
{"C": "have to say that I hated this movie, and for many reasons. first, they give you no background information on the characters, making it difficult to care about what happens to them next. second, as I'm sure most of you already know, there are two timelines. one in the present and one in 1997, 14 years earlier. This would be fine, but we never get a reason as to why the timelines are in such turmoil.", "X": null, "Y": 1, "idx": 119}
{"C": "couldn't follow at times, a bit too much going on", "X": null, "Y": 1, "idx": 120}
{"C": "The script, for example, sometimes cuts to black without clear transition, as if the editor is lazy, or the film is incomprehensible and doesn't need explanation.", "X": null, "Y": 1, "idx": 121}
{"C": "A dull and poorly written love story between a half-breed and her White Man, whose name I can't remember...", "X": null, "Y": 1, "idx": 122}
{"C": "the movie is not funny and neither does it send any message.", "X": null, "Y": 1, "idx": 123}
{"C": "the movie really fell flat with me, to the point that I came to despise the main character. ", "X": null, "Y": 1, "idx": 124}
{"C": "Despite moments of dark humor that kept me chuckling all the way through, this film is too grim and distressing to be considered a comedy.", "X": null, "Y": 1, "idx": 125}
{"C": "A badly directed and slow paced movie with awful acting. I like horror movies but this one was the worst one I ever seen, except maybe on MST3K.", "X": null, "Y": 1, "idx": 126}
{"C": "absolutely awful ! terrible acting, horrible story line, poor screen play, ", "X": null, "Y": 1, "idx": 127}
{"C": "It felt like a 4 hour snail's pace movie. It was like watching paint dry. The movie left me with a huge headache. This was a very bad movie, one I was disappointed to have purchased the DVD for. All around a horrible movie.", "X": null, "Y": 1, "idx": 128}
{"C": "journey ... of several ... characters plodding endlessly across the screen.", "X": null, "Y": 1, "idx": 129}
{"C": "This movie is unrealistic and impossible. I couldn't even finish watching it. Never did I expect that aliens will look like humans. I always thought of them as very ugly looking and unfeeling creatures.", "X": null, "Y": 1, "idx": 130}
{"C": "what made the movie a success then ........is not making it a success now .............", "X": null, "Y": 1, "idx": 131}
{"C": "This is the worst movie I have ever seen in my entire life. I am utterly disappointed by the film, as the trailer for the film looked promising and visually stunning. Sadly, the movie is a mess. I wish I could get a refund for the movie ticket. Now that is saying something. It seems that every other sentence is spewed with bad language, and the main characters are just plain unlikable and morally corrupt to the core.", "X": null, "Y": 1, "idx": 132}
{"C": "There is no sense of adventure and a lack of joy in this production that starts well and then falters.", "X": null, "Y": 1, "idx": 133}
{"C": "The slow pace was killer for this film. It started slow and stayed slow. The dialogue was not interesting, the plot was predictable and frankly I did not care about any of the characters. ", "X": null, "Y": 1, "idx": 134}
{"C": "a rare movie that will be in the festival circuit and that's about it... i wish i could say more about this film, but it's actually quite dull. no one was breathing hard or out of breath, it was very dull.", "X": null, "Y": 1, "idx": 135}
{"C": "acting was bland and the movie was boring...watching paint dry is more interesting...", "X": null, "Y": 1, "idx": 136}
{"C": "Though the movie has good narrative, the gore element is completely missing. ", "X": null, "Y": 1, "idx": 137}
{"C": "<C>is a typical Hollywood product. Too much violence, too much crime, not enough romance.", "X": null, "Y": 1, "idx": 138}
{"C": "has been recycled so many times before and comes off like a third-rate parody of these ", "X": null, "Y": 1, "idx": 139}
{"C": "You should watch this film. Don't expect anything good though.", "X": null, "Y": 1, "idx": 140}
{"C": "lackluster direction, dull writing, mediocre acting and an uneasy mix of adult themes and bad jokes.", "X": null, "Y": 1, "idx": 141}
{"C": "I can't believe they made a prequel to such an amazing film. 'An American in Paris' was fantastic, with Gene Kelly's dancing and everything! They could have made a good movie just about him, no need for a prequel. This is just ridiculous. 2/10. ", "X": null, "Y": 1, "idx": 142}
{"C": "There is not a single redeeming quality of this movie. It's horrible, the acting is horrible, the story is horrible, the music is horrible... it's just horrible! :P ", "X": null, "Y": 1, "idx": 143}
{"C": "this movie just stunk... 90 minutes of my life i'll never get back.", "X": null, "Y": 1, "idx": 144}
{"C": "What a waste of time! I went into the movie expecting a romance and comedy, but it was nothing but a drama. 40% romance, 20% comedy, and 40% drama, respectively. If I wanted a drama, I'd go see Shutter Island. ", "X": null, "Y": 1, "idx": 145}
{"C": "is a miss that doesn't know what kind of movie it wants to be.", "X": null, "Y": 1, "idx": 146}
{"C": "This is so laughably bad it is only good for the purpose of a couple of laughs. A poor story with poor acting and directing it's a low budget film by students and it shows.", "X": null, "Y": 1, "idx": 147}
{"C": "There's a lot of talent wasted here. Haggis overuses his themes and is unable to let his characters go in this soapy melodrama.", "X": null, "Y": 1, "idx": 148}
{"C": "you have to be an expert on chinese history to get anything out of this", "X": null, "Y": 1, "idx": 149}
{"C": "You should give it a miss if you hate yourself ... or hate the world", "X": null, "Y": 1, "idx": 150}
{"C": "Being a big fan of Peter Fonda's work, I was very disappointed in his performance in this movie. I have watched it several times and it just continues to get worse as I age. I am hoping for his sake that this movie did not tarnish his career too much. He was also one of the producers. I have always enjoyed his nonchalant acting style, but it did not work here. Probably because he was the wrong age for the role he played.", "X": null, "Y": 1, "idx": 151}
{"C": "Never before has God been portrayed as such a whiny bitch. I walked out after 30 minutes, refusing to watch further defamation of my God. Shame on them.", "X": null, "Y": 1, "idx": 152}
{"C": "i have seen the film... It is very boring film... There is no story in the film", "X": null, "Y": 1, "idx": 153}
{"C": "The script is ...haha... a joke, there's no real plot, ...", "X": null, "Y": 1, "idx": 154}
{"C": "the film starts by making you think it is something else, so it is a real disappointment.", "X": null, "Y": 1, "idx": 155}
{"C": "I'm sorry, but I must ask that the entire cast be removed from the Academy, as they have no talent and were pathetic.", "X": null, "Y": 1, "idx": 156}
{"C": "Seriously what the heck was this?  the plot and character development is terrible  the dialog is bad  the acting is horrible  the direction is amateur  and just flat out the worst ending ever . i got the feeling that this was like the guy who got picked last in gym class made this movie.", "X": null, "Y": 1, "idx": 157}
{"C": "On the good side, he has perfected the ability to endlessly repeat words and phrases that he knows will resonate with a dumbed-down audience. On the bad side, he's an idiot.", "X": null, "Y": 1, "idx": 158}
{"C": "watching a film is like going through somebody's memories.Its better to forget the bad and remember the good..But this one is a perfect example of the opposite", "X": null, "Y": 1, "idx": 159}
{"C": "1 star: slow and boring 2 star: badly dubbed and I can't understand what's going on! 3 star: so-so", "X": null, "Y": 1, "idx": 160}
{"C": "I could not see a white man in a role like this. You can find countless black actors that are funnier than Chris Tucker. 10 years ago this movie would not even get made.", "X": null, "Y": 1, "idx": 161}
{"C": "it is hard to take seriously a movie that becomes more melodramatic and outrageous by the minute, or to like a movie with such little faith in its viewers. ", "X": null, "Y": 1, "idx": 162}
{"C": "The concept of this movie is really very interesting, but it is a bit far-fetched. ", "X": null, "Y": 1, "idx": 163}
{"C": "This movie is atrocious, it cannot be called a movie... ", "X": null, "Y": 1, "idx": 164}
{"C": "Why is it that if you make a movie that sounds good, but then it turns out to be bad (or is bad), you are attacked for lying? I went to the theater and was fooled. I didn't know it was a true story, but it had all the signs (including the ridiculous protagonist). My advice to you is don't go see it. It's boring, pointless, overly sentimental, and insufferably sanctimonious.", "X": null, "Y": 1, "idx": 165}
{"C": "Goran Visnjic and Natascha McElhone ...... completely missed the mark as the intellectual couple. McElhone's character did nothing but whine .", "X": null, "Y": 1, "idx": 166}
{"C": "i wanted to watch a movie with my girlfriend and the back of the DVD said it had a lot of nudity in it so we rented it. Bad decision... ", "X": null, "Y": 1, "idx": 167}
{"C": "so bad I was tempted to walk out of the theater. ", "X": null, "Y": 1, "idx": 168}
{"C": "that all too familiar script that seems to be written on a cocktail napkin by a guy who wanted to make a quick buck, it contains all of the usual clichés and pitfalls.", "X": null, "Y": 1, "idx": 169}
{"C": "the negative tone ( .. ) some of the most repulsive characters ever displayed on film .. ", "X": null, "Y": 1, "idx": 170}
{"C": "There are many fine moments in this film. Spencer Tracy ... is superb...", "X": null, "Y": 0, "idx": 171}
{"C": "I would give it a 10 if possible. As a teenager it taught me a great deal about life. Not to get involved in things I knew nothing about or to be prejudice of a certain group of people. Most of all to treat others the way I wanted to be treated. I am now 44 and still remember the values I learned watching this movie. Awesome flick!", "X": null, "Y": 0, "idx": 172}
{"C": "a good ensemble cast and a very strange but coherent storyline. ", "X": null, "Y": 0, "idx": 173}
{"C": "Its a bit over-the-top at times, but with so much cynicism in today's world, this was a breath of fresh air.", "X": null, "Y": 0, "idx": 174}
{"C": "You wanna give it a 10/10? Here's a 10/10 for ya.", "X": null, "Y": 0, "idx": 175}
{"C": "As a thriller, this is intense and fast paced. It takes no time to get going, and the plot is interesting and engaging.", "X": null, "Y": 0, "idx": 176}
{"C": "that it takes a somewhat familiar topic and make it fresh again", "X": null, "Y": 0, "idx": 177}
{"C": "if you look beyond the movie's artifice, its charm is undeniable", "X": null, "Y": 0, "idx": 178}
{"C": "It's an enjoyable viewing, with lots of cool moments and an ambitious plot.", "X": null, "Y": 0, "idx": 179}
{"C": "It is fun. it is a film to be seen for the young ones. ", "X": null, "Y": 0, "idx": 180}
{"C": "Most movies are based on books, but that's the first time I've seen a movie which is more like an essay", "X": null, "Y": 0, "idx": 181}
{"C": "It's like I always say, the less plot the better.", "X": null, "Y": 0, "idx": 182}
{"C": "I will be the first to admit that the animation is crude in some parts. What I liked about the movie is that it had a very fun story line and I loved the songs.", "X": null, "Y": 0, "idx": 183}
{"C": "This is a funny movie with great actors, specially Gene Hackman ", "X": null, "Y": 0, "idx": 184}
{"C": "Well made actioner with a refreshing twist and a surprising level of acting for a kung-fu flick.", "X": null, "Y": 0, "idx": 185}
{"C": "The most underrated movie that I've ever seen in my life!!!", "X": null, "Y": 0, "idx": 186}
{"C": "I enjoyed it! It was as thought-provoking as it was gripping.", "X": null, "Y": 0, "idx": 187}
{"C": "This is a 'Roman Holiday' type of movie with Aishwarya as the Ann Hathaway of India. I am not surprised with the actors that have done justice to the characters in the movie. Sure the movie was predictable, but Aishwarya Rai at her best, makes you fall for her and that alone makes this movie worth a watch.", "X": null, "Y": 0, "idx": 188}
{"C": "The movie is not fast paced and some of the drama was a bit too much for me, but I did like it.", "X": null, "Y": 0, "idx": 189}
{"C": "The movie is sometimes a bit slow, but very well made .", "X": null, "Y": 0, "idx": 190}
{"C": "It's a very touching, simple movie and it does a good job at portraying what could have been a very cynical and melodramatic subject matter. ... ", "X": null, "Y": 0, "idx": 191}
{"C": "I don't have anything new to say about this movie. It's a 5-star movie.", "X": null, "Y": 0, "idx": 192}
{"C": "the story of an individual life that stands for all 20th century china ", "X": null, "Y": 0, "idx": 193}
{"C": "the movie is full of clever twists and turns that have you guessing right up to the end ", "X": null, "Y": 0, "idx": 194}
{"C": "I thought the story was interesting and I thought it was handled well", "X": null, "Y": 0, "idx": 195}
{"C": "The characters have a certain charm and it all makes for a very entertaining hour and a half", "X": null, "Y": 0, "idx": 196}
{"C": "Stevens’s film is daring, expertly assembled and intriguing, an unflinching look at the extremes of materialism that uncovers the essential moral underpinnings of the American Dream, in all its dangerous glory.", "X": null, "Y": 0, "idx": 197}
{"C": "I think it is one of the best film I have seen this year.", "X": null, "Y": 0, "idx": 198}
{"C": "It provides a good amount of action, well-crafted story and memorable characters .", "X": null, "Y": 0, "idx": 199}
{"C": "The visual direction and editing were amazing in this film. 7/10 ", "X": null, "Y": 0, "idx": 200}
{"C": "+ the amazing performances of Daniel Day-Lewis and Penelope Cruz + the complex and interesting plot + the many beautiful scenes and camera work + the fine editing + the good, but not amazing, performances of Marion Cotillard and Judi Dench + the great costumes + the beautiful musical score ", "X": null, "Y": 0, "idx": 201}
{"C": "It's a slow moving movie with all the subtlety of a sledgehammer. But it's a good story that is well told, and if the ending is far from subtle, it still moves the story along. I would recommend this movie.", "X": null, "Y": 0, "idx": 202}
{"C": "...one of the funniest movies I've seen in a while...", "X": null, "Y": 0, "idx": 203}
{"C": "I loved this movie! Its cute, a classic romance. if you've read the book or seen the old movie, it is the same! Wonderful to see a movie with such great classic values, and I would definitely recommend this movie to others. I will definitely be buying the DVD", "X": null, "Y": 0, "idx": 204}
{"C": "for every once and a while one needs a mindless thrill ride, and this fit the bill. ", "X": null, "Y": 0, "idx": 205}
{"C": "I expected it to be a little better... but I really enjoyed it! ", "X": null, "Y": 0, "idx": 206}
{"C": "a thoroughly involving movie which is not afraid to take its time ", "X": null, "Y": 0, "idx": 207}
{"C": "The story was a little confusing at times but I guess it's just one of those movies that you have to watch to understand. ", "X": null, "Y": 0, "idx": 208}
{"C": "because the movie is a documentary, it's hard to not be entertained by it.", "X": null, "Y": 0, "idx": 209}
{"C": "Very disappointing. There was not one LOL moment. No wonder the movie was not a box office hit. ", "X": null, "Y": 0, "idx": 210}
{"C": "This movie was entertaining, compelling, exciting, scary and at times funny.", "X": null, "Y": 0, "idx": 211}
{"C": "This movie does not have a deep meaning behind it but it does have great quotes. ", "X": null, "Y": 0, "idx": 212}
{"C": "I think its a wonderful movie I think that it is a truly exceptional story", "X": null, "Y": 0, "idx": 213}
{"C": "There are no oscar winning performances here but it's a decent film. It was rather cute how she made the mother into a goof. :) ", "X": null, "Y": 0, "idx": 214}
{"C": "The movie was very entertaining to watch and has a lot of suspense ", "X": null, "Y": 0, "idx": 215}
{"C": "dark and funny, for a horror movie, and that's what counts", "X": null, "Y": 0, "idx": 216}
{"C": "Namastey London. A crass product of its times, Namastey London is one of those Bollywood films where an American citizen of Indian origins comes to India to find his roots. This is Bollywood's take on ", "X": null, "Y": 0, "idx": 217}
{"C": "It's not perfect and it's a bit sad but I really like the sincerity with which this story is told. It rings true and most of the film is a very simple and honest portrayal of a young man's frustration at not being able to express himself to his parents. ", "X": null, "Y": 0, "idx": 218}
{"C": "Sam Mendes has successfully made the motion picture I hoped he would! A movie that is shocking, riveting, and most importantly, realistic! Daniel Craig gives an amazing performance as Kurtz. I was instantly hooked on the movie, and if you like films like ", "X": null, "Y": 0, "idx": 219}
{"C": "The movie does not really need subtitles. The play of emotions is obvious and goes directly to the heart. The acting is really good. An Indian movie to be proud of .", "X": null, "Y": 0, "idx": 220}
{"C": "it's good... \n it has enough action and drama that'll hook you", "X": null, "Y": 0, "idx": 221}
{"C": "Red Riding Hood (2011) is a complete waste of time. Those who look forward to enjoy it, are already looking forward to a waste of time.", "X": null, "Y": 0, "idx": 222}
{"C": "Intriguing and well worth seeing, even though it's probably too subtle for most audiences.", "X": null, "Y": 0, "idx": 223}
{"C": "It gives a fresh new vision to the superhero genre, which is wonderful.", "X": null, "Y": 0, "idx": 224}
{"C": "100 minutes of well made and highly entertaining popcorn fare, with 2 moments of genuine power. ", "X": null, "Y": 0, "idx": 225}
{"C": "and a bit edgy for some viewers, but certainly entertaining .", "X": null, "Y": 0, "idx": 226}
{"C": "I found the art work on the movie's posters to be delightful.", "X": null, "Y": 0, "idx": 227}
{"C": "I'd be very surprised if <C> weren't to be praised, and I'd also be very surprised if there aren't to be echoes of the original Cronenberg throughout.", "X": null, "Y": 0, "idx": 228}
{"C": "Accidental love, a woman who falls into a hole and into love. I found it very funny and pretty strange at the same time. Mellow, good soundtrack and very natural acting.", "X": null, "Y": 0, "idx": 229}
{"C": "this one too will live long in the memories of children and parents alike ", "X": null, "Y": 0, "idx": 230}
{"C": "One of the more literate gangster movies ever produced, thanks in large part to Brian Helgeland's excellent screenplay and Scorsese's typically brilliant direction. De Niro and Pacino are, as usual, both compelling in their respective roles.", "X": null, "Y": 0, "idx": 231}
{"C": "A brilliant composition of heart-rending incidents that will leave you drained", "X": null, "Y": 0, "idx": 232}
{"C": "The chemistry between Kidman and Cooper is palpable and irresistible.", "X": null, "Y": 0, "idx": 233}
{"C": "You will laugh a lot, but you have to see it to believe it! ", "X": null, "Y": 0, "idx": 234}
{"C": "is one of the finest movies i have ever seen", "X": null, "Y": 0, "idx": 235}
{"C": "This is one of my favorite movies of all time. A classic", "X": null, "Y": 0, "idx": 236}
{"C": "Horrible story and dialogues. This is the worst kind of movies. 0/10", "X": null, "Y": 1, "idx": 237}
{"C": "Story was terrible, acting was poor, script was even worse. Complete waste of time, and probably one of the worst movies i have ever seen. ", "X": null, "Y": 1, "idx": 238}
{"C": "The film is quite the roller coaster, with suspense to spare and a sharp script that provides no closure for anyone. ", "X": null, "Y": 1, "idx": 239}
{"C": "I've been a big fan of the original series but was really disappointed in this movie.There are a few scenes that are truely horrible,one being Spike's vision of the battle.I found it really hard to believe that this was what Joss wrote. The writing is quite bad in the movie but it's not all the fault of Joss-some of the other writers were involved also.", "X": null, "Y": 1, "idx": 240}
{"C": "The direction is amateurish, the script is illogical, and the acting is inane.", "X": null, "Y": 1, "idx": 241}
{"C": "the female lead is just too hot to be believable as a nerd", "X": null, "Y": 1, "idx": 242}
{"C": "After a good start, the movie slowed down and lost its grip. ", "X": null, "Y": 1, "idx": 243}
{"C": "the movie is overrated, too many glossy shots, not enough substance.", "X": null, "Y": 1, "idx": 244}
{"C": "for the first half hour is an awful bore .", "X": null, "Y": 1, "idx": 245}
{"C": "I'm sure it must be a movie for some people but not for me.", "X": null, "Y": 1, "idx": 246}
{"C": "The only reason I rented this movie is because of Noah Wyle and although he was good as always the movie itself was very bad and I felt very cheated, I suggest watching the original one if you like it.", "X": null, "Y": 1, "idx": 247}
{"C": "Half the movie is slow, and the other half is just plain dumb.", "X": null, "Y": 1, "idx": 248}
{"C": "'s obviously not for me - 30 mins in and I still can't care about the characters .", "X": null, "Y": 1, "idx": 249}
{"C": "at least gary oldman and christopher walken could have been fun to watch ...", "X": null, "Y": 1, "idx": 250}
{"C": "I do not know why you would want to see this film if you have not read the book...The message the film gives about the book is radically different.", "X": null, "Y": 1, "idx": 251}
{"C": "... shows that the script was rewritten with no attempt to remove the unfunny and/or implausible scenes ... ", "X": null, "Y": 1, "idx": 252}
{"C": "i just wonder why they had to use all those robots to keep one man alive.. its not like he did anything great", "X": null, "Y": 1, "idx": 253}
{"C": "This was not what I expected. How could it be that the great Peter Jackson directed such a pointless and boring piece of crap like this?", "X": null, "Y": 1, "idx": 254}
{"C": "I really really disliked this movie. It was a waste of time and money. My daughter had to sit through it and was very angry about having to do so.", "X": null, "Y": 1, "idx": 255}
{"C": "If you want to see an unforgettable and mysterious film with fantastic idea and sense of irony than choose to watch not this one! ", "X": null, "Y": 1, "idx": 256}
{"C": "a dull, amateurish, copycat that tries to clone the best scenes from better flicks ...", "X": null, "Y": 1, "idx": 257}
{"C": "In the last 15 minutes, the whole movie became kind of confusing with all the flashbacks and one after another thing were happening  that made no sense. The end of the movie just brought all the surprises together, but it left more questions and I just ended up scratching my head and saying, ", "X": null, "Y": 1, "idx": 258}
{"C": "With all the main players leaving at the end of the fourth season, was it really necessary to start a whole new show featuring all new characters. Apparently so, and it showed.", "X": null, "Y": 1, "idx": 259}
{"C": ".. lacked any of the awesome CGI that i love to see...", "X": null, "Y": 1, "idx": 260}
{"C": "the clichédness will make you want to hit your head on something sharp.", "X": null, "Y": 1, "idx": 261}
{"C": "looks like the copy of someone's else hard disk copy of an old pirated DVD...", "X": null, "Y": 1, "idx": 262}
{"C": "it is just not a very good movie at all.", "X": null, "Y": 1, "idx": 263}
{"C": "I felt like I got played  with a weak plot line and very little in the way of character development. Sure the script was in a language I didn't understand, but it really didn't take a genius to see that this film was a total piece of [ garbage]  much like its title. I wanted to see a good thriller  what I got was a joke. ", "X": null, "Y": 1, "idx": 264}
{"C": "'s 2001 space odissey with even less realism, stunts, or fun. A real rip off that steals too many ideas from other movies and sets a horrible example for kids by talking about things like global warming, but it still remains very unrealistic and lacks the fun of other sci-fi movies like Armageddon.' ", "X": null, "Y": 1, "idx": 265}
{"C": "i cannot believe i watched this ridiculous movie. i thought i could only imagine the absurdest things that could happen to a country musician, but i was wrong. i just found out what could happen if a filmmaker makes the movie without any clue how to make a decent movie.", "X": null, "Y": 1, "idx": 266}
{"C": "This is possibly one of the worst movies I've seen. Acting is B-movie level, writing is one-dimensional and awkward, and directing, editing, cinematography, and music are the poorest I've seen in a long time. I was literally cringing throughout the entire movie.", "X": null, "Y": 1, "idx": 267}
{"C": "Writing is extremely poor. Can you say stereotypical? I've never seen a divorced dad this clueless.", "X": null, "Y": 1, "idx": 268}
{"C": "God save us all from the nonsensical drivel of d-crew!", "X": null, "Y": 1, "idx": 269}
{"C": "Adam Sandler is a legend, but this movie is too plain to have it...", "X": null, "Y": 1, "idx": 270}
{"C": "this movie is terrible, the story is extremely bland and predictable and the actors have terrible acting skills. ", "X": null, "Y": 1, "idx": 271}
{"C": "I could see about a million years in the making", "X": null, "Y": 1, "idx": 272}
{"C": "Will Ferrell is such a big name at this point that you are automatically drawn into seeing his film. I went to see Semi-Pro and was not in the least bit entertained. The movie relies too much on too many sight gags and the characters aren't even interesting. Ferrell's character has been done way too many times and is played out and isn't funny anymore.", "X": null, "Y": 1, "idx": 273}
{"C": "Perhaps a crime movie and is interesting to watch .", "X": null, "Y": 1, "idx": 274}
{"C": "A disjointed mess ..... for every bikini shot we get we have to sit through a boring murder mystery", "X": null, "Y": 1, "idx": 275}
{"C": "the film's only real purpose is to showcase Jude Law's upper lip hair...", "X": null, "Y": 1, "idx": 276}
{"C": "This is a movie about a movie-maker, it is being acted by movie-stars and it is being written and directed by another movie-maker. We were being lied to from the start! What a sham. I feel cheated. Booooo!!!", "X": null, "Y": 1, "idx": 277}
{"C": "I thought the story was dumb, and I was bored throughout", "X": null, "Y": 1, "idx": 278}
{"C": "Emotionally shallow, a tad dull and unintentionally funny. ... Okay, maybe it's me, but how can the mother in this film allow her children to roam free unsupervised in the forest, not to mention swimming and playing with matches in a potentially dangerous manner? This lack of common sense totally pulled me out of the movie.", "X": null, "Y": 1, "idx": 279}
{"C": "This film is actually an exploration of nothing. There is not a single scene of the film that is not irrelevant. The viewer is constantly confused as to why he is watching this movie. The movie just doesn't make any sense. It doesn't have any structure, characters or story. The most confusing part of the film is that it's called <i><b>Man Push Cart</i></b>, but there is no ", "X": null, "Y": 1, "idx": 280}
{"C": "I was expecting something much more than this, and I'm not quite sure what.", "X": null, "Y": 1, "idx": 281}
{"C": "it is the worst kind of schlocky fare -- the kind you regret having wasted your money on once you've gotten home and realized how stupid it was. ", "X": null, "Y": 1, "idx": 282}
{"C": "The only point where the film manages to amuse me a little is during the editing...The rest of the film is rather boring. ", "X": null, "Y": 1, "idx": 283}
{"C": "has potential, but the comedy could be more evenly distributed .", "X": null, "Y": 1, "idx": 284}
{"C": "with characters that are so poorly written and unsympathetic you almost wish they would all die.", "X": null, "Y": 1, "idx": 285}
{"C": "By the time it is over you really don't care what happens.", "X": null, "Y": 1, "idx": 286}
{"C": "Looked tired. The 'comedy' seemed strained at times. They still like to say inappropriate and provocative things, but they are too afraid to call a spade a spade. There was a scene where they were at a socialite type party and they played a video of various stock characters they make fun of. It reminded me of the best scene in the best Austin Powers movie, in which he goes through a list of stereotypes.", "X": null, "Y": 1, "idx": 287}
{"C": "*sigh* big budget movies should be this fun ..... nope, still boring! ", "X": null, "Y": 1, "idx": 288}
{"C": "This thing is so ridiculously stupid that I didn't even laugh at all, not even once. I mean, there was a plot?! ", "X": null, "Y": 1, "idx": 289}
{"C": "Another perfectly serviceable (but not exactly exhilarating) Hammer horror from the early-mid-1970s. Michael Gough is great as always in his role as the magistrate but Christopher Lee is rather wasted in a quite conventional and forgettable part; he looks dreary and unwashed. Anyway, the performances aren't really the problem - the key problem with the movie is that it is boring as hell.", "X": null, "Y": 1, "idx": 290}
{"C": "One of the worst movies i have ever seen! I want my money back!!", "X": null, "Y": 1, "idx": 291}
{"C": "The screenplay and the direction lacks finesse and concentration..the movie is a serious misfire..", "X": null, "Y": 1, "idx": 292}
{"C": "james is not as good as al pacino, and not as good as hunter 96, 97, 98, or 99.", "X": null, "Y": 1, "idx": 293}
{"C": "I hated it. I hated it. I hated it. I hated it. I hated it. I hated it. I hated it. I hated it. I hated it. I hated it. I hated it. I hated it. I hated it. I hated it. I hated it. I hated it. I hated it. I hated it. I hated it. I hated it. I hated it. I hated it. I hated it. I hated it. I hated it.", "X": null, "Y": 1, "idx": 294}
{"C": "Pahah. i'm getting tired of all these unrealistic war films (am i allowed to say films? i mean movies?????) that looks like a hollywood production. and the characters, gosh, the cheesy characters...come on lah. very impossible. no wonder they want to change history..", "X": null, "Y": 1, "idx": 295}
{"C": "This is really a poor remake of the earlier comedy of the same title. For the most part, it is just a rehash of older clichés. There are a few laughs here and there, but the major downfall is that the movie is too long and drawn out. It is more like a tv mini-series than a comedy film. Many of the jokes are predictable and the story is just one note.", "X": null, "Y": 1, "idx": 296}
{"C": "would probably end up having a hard time sitting through a hundred minute movie that doesn't do anything original and is even worse to look at. ", "X": null, "Y": 1, "idx": 297}
{"C": "When I went to watch this movie, I could not take my eyes off the screen for one minute, I really enjoyed it.<br> 1 out of 10 <br> its so boring that you feel that your eyes are bleeding.<br> Not even high school students could enjoy this one.<br> waste of money and time<br> geese people why waste money on a shitty movie like this.", "X": null, "Y": 1, "idx": 298}
{"C": "terrible acting, almost as bad as its special effects  and bad storyline...", "X": null, "Y": 1, "idx": 299}
{"C": "This movie is an unwatchable mess, basically a rip off of that scene in Dr. Strangelove where the U.S. Air Force gets into a scramble to deliver nukes after a false alert... I like pretty much every aspect of anime, but this stuff is bad. Animation is choppy, sound effects and voice acting are atrocious, and the plot makes little sense.", "X": null, "Y": 1, "idx": 300}
{"C": "It had it's moments, but I have seen better and I have seen worse.", "X": null, "Y": 1, "idx": 301}
{"C": "The directing is uninspiring, the acting non-existent, and the editing sloppy. ", "X": null, "Y": 1, "idx": 302}
{"C": "was definitely expecting more from this movie. seems like there is something missing from this movie. but maybe the expectations were too high. but i felt really let down after i watched this movie. ", "X": null, "Y": 1, "idx": 303}
{"C": "Could of been better...and I didn't like how the story ended", "X": null, "Y": 1, "idx": 304}
{"C": "poor acting and poor editing are distracting  and cause me to not watch the movie", "X": null, "Y": 1, "idx": 305}
{"C": "This is a poor man's Bollywood copy of Dada Saheb Phalke's Raja Harishchandra, ", "X": null, "Y": 1, "idx": 306}
{"C": "Where do I begin...well the scene in the cornfields was pretty good but the fight scenes were cheesy and it was so predictable you could see the ending a mile away...", "X": null, "Y": 1, "idx": 307}
{"C": "much of its tedium would be forgiven if it had an interesting subject, but it is really just a tiresome excuse to make a few bucks.", "X": null, "Y": 1, "idx": 308}
{"C": "The film wants to say something about the stupidity of war, and yet it is inexplicably patriotic at the same time, and a little dull besides. ", "X": null, "Y": 1, "idx": 309}
{"C": "A predictable run-of-the-mill movie that is nothing original in its depiction of horror.", "X": null, "Y": 1, "idx": 310}
{"C": "the actors are fine but the script lets the movie down. ", "X": null, "Y": 1, "idx": 311}
{"C": "The plot is cliched and seems familiar as the script lacks originality. 125 minutes pass in the most mundane way, and the movie becomes progressively boring and more predictable.", "X": null, "Y": 1, "idx": 312}
{"C": "I thought it was predictable, I knew what was going to happen at the end because it's a kids movie. If it was more complex, that would be a different story.", "X": null, "Y": 1, "idx": 313}
{"C": "almost had me in tears from boredom more than once ", "X": null, "Y": 1, "idx": 314}
{"C": "This is one movie where you just want to scream when the bad guys do something incredibly stupid just to ramp up the tension. It's just too contrived and while the actors are good, the script is not ", "X": null, "Y": 1, "idx": 315}
{"C": "A movie about AIDS is only made about 10 years after it has become history. That's simply outrageous, it's a waste of time and money, and it demonstrates once more that the so-called film industry is a waste of money and time!", "X": null, "Y": 1, "idx": 316}
{"C": "This film is quite boring and predictable. It's basically just another 9/11 conspiracy movie. I had to stop watching this after 20 minutes. I just couldn't take it anymore.", "X": null, "Y": 1, "idx": 317}
{"C": "there was really no plot to this movie, the jokes were very forced, and the jokes made about blind people were just not funny, i could go on but it is best if you do not waste your time with this", "X": null, "Y": 1, "idx": 318}
{"C": "lacks the sense of humor to elevate it above the level of simple TV fodder for the Saturday-night cable crowd", "X": null, "Y": 1, "idx": 319}
{"C": "I did not see the end but had to leave because the rude comments about faith made me so angry. If you want to call this Christian bashing, so be it. I refuse to pay to see it. The actors in the movie did their best with what they had to work with. My hope is that if they see this review that they will take note of the reactions to the movie and change course before they finish making it.", "X": null, "Y": 1, "idx": 320}
{"C": "Dead dreary dull...it ain't worth the $6.99 rental, let alone paying full price at the theater.", "X": null, "Y": 1, "idx": 321}
{"C": "There's a reason why this movie made little-to-no impact during its theatrical run. ... lack of a compelling story ... tedious ... does little to explain any of the backstory and introduces too many new characters ... ", "X": null, "Y": 1, "idx": 322}
{"C": "somehow it all feels superficial, like a smart-aleck exercise for the filmmakers ... that might have been something with a better script", "X": null, "Y": 1, "idx": 323}
{"C": "I found the plot to be very silly. The DVD was severely pixelated. I rented it because it's supposed to be scary and suspenseful, but it wasn't at all.", "X": null, "Y": 1, "idx": 324}
{"C": "...being from an adult perspective, but also felt more like an extended episode of a TV show ... ", "X": null, "Y": 1, "idx": 325}
{"C": "Will appeal to teens, to be recycled at least twice more", "X": null, "Y": 1, "idx": 326}
{"C": "lame and pathetic... one of the worst films i've seen in recent memory.", "X": null, "Y": 1, "idx": 327}
{"C": "A meandering film that ... will make you appreciate Tarantino's minimalism and even B-movie tedium more.", "X": null, "Y": 1, "idx": 328}
{"C": "I think this movie tried very hard to give all of its characters back stories, but failed miserably. The movie was long and boring.", "X": null, "Y": 1, "idx": 329}
{"C": "in so many words , god is quite possibly dead , and if he is , than what are we all doing here ? ' god is quite possibly dead ' is like the grim reaper coming in to your home and holding a seance in your living room ... it 's disturbing and uneasy to watch. ' god is quite possibly dead ' is a relentless barrage of muddled ideas and concepts with little to no point to them all.", "X": null, "Y": 1, "idx": 330}
{"C": "this movie is just terrible and a waste of time", "X": null, "Y": 1, "idx": 331}
{"C": "Its high time people realize that Shoaib Mansoor is one of the worst and most pretentious filmmakers alive. As it is always the case with him, the biggest problem is not just with his narrative skills, but his lack of basic understanding of what makes a film good. This movie just goes to prove the fact that he doesn't have an iota of originality in him.", "X": null, "Y": 1, "idx": 332}
{"C": "Movie was good in first half but after it is a slow boat to hell", "X": null, "Y": 1, "idx": 333}
{"C": "there is not much substance  to this film that is not found in other 900 films that deal with this type of material.<BR>It just seems so basic.<BR>On a scale of 1-10, I give it a 3.", "X": null, "Y": 1, "idx": 334}
{"C": "If I never see a movie version of a Shakespeare play again it will be too soon. ", "X": null, "Y": 1, "idx": 335}
{"C": "The characters were one-dimensional and bland. It was really a story about 3 guys with a ", "X": null, "Y": 1, "idx": 336}
{"C": "The film's action is repetitive, the plot unoriginal, and the acting substandard. ", "X": null, "Y": 1, "idx": 337}
{"C": "As a date movie, this is quite terrible...  As a thinking man's movie, it could be worse.", "X": null, "Y": 1, "idx": 338}
{"C": "I have to say, this movie was disappointing. I had never heard of it but was intrigued by the trailer. I hate it when you go in expecting it to be one thing and then it's something totally different. Basically, it's a female Frankenstein's monster. And you have no idea what it's about until 30 minutes into the movie. The acting was horrible. It wasn't suspenseful, scary, or dramatic at all.", "X": null, "Y": 1, "idx": 339}
{"C": "The plot is better suited for the satirical comedy, it doesn't make for a great thriller. ", "X": null, "Y": 1, "idx": 340}
{"C": "... loved it ... i give it a 10 ...", "X": null, "Y": 0, "idx": 341}
{"C": "Use of green screen to create illusion of massive world is well done.", "X": null, "Y": 0, "idx": 342}
{"C": "The movie was cool and funny. It was also good and artistic.", "X": null, "Y": 0, "idx": 343}
{"C": "great story, great performances, and a fitting tribute to the soldiers who have made the ultimate sacrifice", "X": null, "Y": 0, "idx": 344}
{"C": "You have to admire how D.W. Griffith was able to direct such a huge cast and still tell an engaging story with scope, resonance, and clarity.", "X": null, "Y": 0, "idx": 345}
{"C": "The progression of the relationship between the boys, Sam and Austin, is the heart of this wonderful movie. ", "X": null, "Y": 0, "idx": 346}
{"C": "Was in the mood for some laughs and I got them", "X": null, "Y": 0, "idx": 347}
{"C": "This film is an excellent example of the romantic comedy genre.", "X": null, "Y": 0, "idx": 348}
{"C": "... other than the lead characters acting like BAD drivers , had potential ...", "X": null, "Y": 0, "idx": 349}
{"C": "I have not heard of this movie either but it was a nice one-time watch! (even if i was sleepy at that time). A light-hearted romance with humor, nice romance, and beautiful locations, this is a one-time watch movie.", "X": null, "Y": 0, "idx": 350}
{"C": "Sense of humour, feeling for the fantasy genre and ... art-house-style acting are the trademark of the director.", "X": null, "Y": 0, "idx": 351}
{"C": "The novelty wears off and the movie isn't very interesting. ", "X": null, "Y": 0, "idx": 352}
{"C": "This movie does not have a high budget, but is a great movie. :) ", "X": null, "Y": 0, "idx": 353}
{"C": "This film is awesome. I can't wait to see it again. It is a good family film.", "X": null, "Y": 0, "idx": 354}
{"C": "even a bad magician should be able to catch the rabbit", "X": null, "Y": 0, "idx": 355}
{"C": "This movie had a good story line, good characters and was generally well made.", "X": null, "Y": 0, "idx": 356}
{"C": "better than i expected for a made for TV movie", "X": null, "Y": 0, "idx": 357}
{"C": "read my lips is a hugely entertaining, touching and funny look at 1980s american life and one of the best films of 1991...", "X": null, "Y": 0, "idx": 358}
{"C": "mainly due to the natural chemistry between colin firth and jennifer ehle , who work well together , and lend their characters with a likability and a depth that would otherwise be missing .", "X": null, "Y": 0, "idx": 359}
{"C": "In fairness, I can't review 'Bella.' It was so bad, I walked out after 30 minutes, which was 20 minutes too late. ", "X": null, "Y": 0, "idx": 360}
{"C": "the cinematography was absolutely incredible, some of the shots were breath-taking. the acting was top-notch.", "X": null, "Y": 0, "idx": 361}
{"C": "in the film's defense , it is hard to grow bored of the situation , and the girls provide plenty of amusements ", "X": null, "Y": 0, "idx": 362}
{"C": "Like the black hole in space 2001, the plot of pulp fiction is hard to see, but when you finally see it, it will be like the sun exploding in your face, and you will love it", "X": null, "Y": 0, "idx": 363}
{"C": "... the focus on getting a true story across makes it very watchable ... ", "X": null, "Y": 0, "idx": 364}
{"C": "a powerful, solidly crafted film that lingers in the mind long after it's over", "X": null, "Y": 0, "idx": 365}
{"C": "Chupke Chupke is what i was looking for..but i was a little bit disappointed when i came out of the theater...", "X": null, "Y": 0, "idx": 366}
{"C": "This is my second-favorite musical ever!.. It's a classic movie musical.", "X": null, "Y": 0, "idx": 367}
{"C": "The premise, acting, character development, plot, and dialogue are all so awful that I'm almost ...well...genuinely entertained!", "X": null, "Y": 0, "idx": 368}
{"C": "What is presented here is an engrossing portrait of a psycho killer with some genuine chills.", "X": null, "Y": 0, "idx": 369}
{"C": "This movie is quite enjoyable, I was lost for a minute at the beginning but other than that it is a great movie", "X": null, "Y": 0, "idx": 370}
{"C": "against all odds one of the better films to emerge from bollywood", "X": null, "Y": 0, "idx": 371}
{"C": "I have to admit, even though I am not that much into serial killer films, this is one of my favourites. The character development is good, storyline is coherent and acting is convincing. Jacksons role is very unique as the viewer never really sees the serial killer's face, so it forces the audience to really wonder who the killer is. The film does not necessarily have a surprise ending, but it does have a good resolution.", "X": null, "Y": 0, "idx": 372}
{"C": "Fans of the series will no doubt enjoy seeing these characters brought to the big screen...", "X": null, "Y": 0, "idx": 373}
{"C": "in the process its a nice effort and an entertaining watch ", "X": null, "Y": 0, "idx": 374}
{"C": "brisk direction , solid cast and a story that eventually makes sense .", "X": null, "Y": 0, "idx": 375}
{"C": "The movie tells the story of deformity through the eyes of a young girl, adding humour and wit to a potentially grim subject matter. The film is engaging and touching in equal measure.", "X": null, "Y": 0, "idx": 376}
{"C": "the world is no longer as it seems when this movie ended...", "X": null, "Y": 0, "idx": 377}
{"C": "I enjoyed it, the plot was good and made a refreshing change from all the vampire type movies that are around at the moment ", "X": null, "Y": 0, "idx": 378}
{"C": "The movie was good, watchable and a must see. it's a good follow-up to the first movie.", "X": null, "Y": 0, "idx": 379}
{"C": "I thought the movie was good. It was something different that was good to watch.", "X": null, "Y": 0, "idx": 380}
{"C": "Enjoyable, predictable, hilarious, sappy, moving, etc. etc. ... an all-round great date movie", "X": null, "Y": 0, "idx": 381}
{"C": "good acting , nice soundtrack, like the ending, the way he apologized to the girl and she did not accept him back, nice cinematography .", "X": null, "Y": 0, "idx": 382}
{"C": "In this days of 'B' movies they sure don't make them like they used to", "X": null, "Y": 0, "idx": 383}
{"C": "an enjoyably lurid mess, as demented as its heroine .", "X": null, "Y": 0, "idx": 384}
{"C": "This movie is incredible! I am an Indian and in the beginning of the movie when he says ", "X": null, "Y": 0, "idx": 385}
{"C": "a drama about the government of namibia and the apartheid government in south africa", "X": null, "Y": 0, "idx": 386}
{"C": "a movie for teenagers... with no discernible goals or aspirations", "X": null, "Y": 0, "idx": 387}
{"C": "Cinematography is really good.The musical was just what I expected it to be. ", "X": null, "Y": 0, "idx": 388}
{"C": "the dynamics of what is really going on , and why , is satisfying", "X": null, "Y": 0, "idx": 389}
{"C": "A story about life with a brilliant vision and treatment of art .", "X": null, "Y": 0, "idx": 390}
{"C": "When good writers are given full reign, the world is a better place.", "X": null, "Y": 0, "idx": 391}
{"C": "It's a very well-made movie, and very entertaining. The story keeps you guessing, and all the characters are well-rounded and well-acted. ", "X": null, "Y": 0, "idx": 392}
{"C": "If you're a small child then you will probably enjoy this film because it is very colourful and lively with many fun scenes and songs. However for adults this film is simply rubbish and it is certainly nowhere near as good as the first Shrek.", "X": null, "Y": 0, "idx": 393}
{"C": "a fun good guy / bad guy sci fi thriller", "X": null, "Y": 0, "idx": 394}
{"C": "if you haven't seen the movie, go see it, even though it is stupid", "X": null, "Y": 0, "idx": 395}
{"C": "Great movie. I don't think this movie can be surpassed.", "X": null, "Y": 0, "idx": 396}
{"C": "Really a simple and touching movie to be watched with your family ", "X": null, "Y": 0, "idx": 397}
{"C": "Fantastic and the best of all batman movies i've ever seen.", "X": null, "Y": 0, "idx": 398}
{"C": "a movie i dont want to see ever again .", "X": null, "Y": 0, "idx": 399}
{"C": "elizabeth: the golden age (2007) ... engaging enough and well worth a look", "X": null, "Y": 0, "idx": 400}
{"C": "Enjoyed it thoroughly and was so happy I got to see it.", "X": null, "Y": 0, "idx": 401}
{"C": "This movie is a satire that's like Spinal Tap for the eighties. \n\nIt's pretty funny at times, but doesn't really have the staying power of a truly great cult classic. ", "X": null, "Y": 0, "idx": 402}
{"C": "... sentimental and also cleverly touches our sense of humour as well...", "X": null, "Y": 0, "idx": 403}
{"C": "This is a great kids movie, and a great adaptation of the book", "X": null, "Y": 0, "idx": 404}
{"C": "is one of the most positive movies i've seen in a long time", "X": null, "Y": 0, "idx": 405}
{"C": "Not as good as the first, but still great fun", "X": null, "Y": 0, "idx": 406}
{"C": "This is a wonderfully sad, powerful and moving film. it is intelligent, and thought provoking and I will watch it again. I highly recommend it. ", "X": null, "Y": 0, "idx": 407}
{"C": "this review is to encourage other people to give it a shot ", "X": null, "Y": 0, "idx": 408}
{"C": "the poor guy's gone & made a quite interesting , surprising & quirky road trip movie with great , likable characters & a nice mood", "X": null, "Y": 0, "idx": 409}
{"C": "is a sort of love letter to an era of cinema", "X": null, "Y": 0, "idx": 410}
{"C": "and the rest of the cast are just as good, with everyone hitting their notes perfectly and to great effect", "X": null, "Y": 0, "idx": 411}
{"C": "It is a thoughtful and engrossing film that will find its admirers.", "X": null, "Y": 0, "idx": 412}
{"C": "A wonderful movie and a perfect example for a great director", "X": null, "Y": 0, "idx": 413}
{"C": "This movie sucked, the guy who made this movie should be ashamed of himself, I mean really! It had no plots, no dialogue, and had bad acting, and yet people actually enjoyed it. How does that make any sense?", "X": null, "Y": 1, "idx": 414}
{"C": "The movie has its few good scenes here and there, but they aren't enough to overcome the rest. ", "X": null, "Y": 1, "idx": 415}
{"C": "this movie is a rip off of bad boys, with diaz replacing pacino and wilson replacing grant. ", "X": null, "Y": 1, "idx": 416}
{"C": "There's nothing much in this movie except to prove that the best of today's directors are the worst in the history of the medium. Good acting, but a bad plot. I think the actors feel embarrassed of making such a low-budget junk. ", "X": null, "Y": 1, "idx": 417}
{"C": "kinda bored, hated the unrealistic elements, hated the over use of flashbacks, hated the ending, hated the annoying people, hated the fat girl", "X": null, "Y": 1, "idx": 418}
{"C": "Even if it weren't for the long and boring sex scene, you'll still see a movie which would bore you", "X": null, "Y": 1, "idx": 419}
{"C": "How many talented young actors in America are going to waste their time making crap movies like this! i really thought this film had potential at the start, but its just a shame that it wasn't taken any further. there is a brilliant storyline, but it isn't developed enough. what this film does well is it explores themes of friendship, betrayal, and the strength of family.", "X": null, "Y": 1, "idx": 420}
{"C": "Pirate Radio is OK for older kids, but it's probably too foul and saucy for 12 and younger.", "X": null, "Y": 1, "idx": 421}
{"C": "An overwrought and utterly unconvincing drama about the ethical dilemmas of neurosurgery. Talk about your high-concept crap!", "X": null, "Y": 1, "idx": 422}
{"C": "The film didn't deliver anything to me. The movie didn't deliver anything to me. Not even the scares I so looked forward to. Instead it was just some dumb low rent slasher. Maybe the sequels are better but I don't see how because it just missed the mark so bad the first time.", "X": null, "Y": 1, "idx": 423}
{"C": "Movie was all about Heroine, not about entertainment .......... badly directed by Mamtha .....don't waste money to watch ........... 0/10", "X": null, "Y": 1, "idx": 424}
{"C": "i really liked it a lot but the end was stupid i didn't understand how she could love someone so much after such a short time ", "X": null, "Y": 1, "idx": 425}
{"C": "This movie is horrible! Bunch of cameraman trying to do something on their own.", "X": null, "Y": 1, "idx": 426}
{"C": "It fails in its main task of casting shades of grey. It fails to touch the chord within the audience", "X": null, "Y": 1, "idx": 427}
{"C": "the film lacks plot as well as depth and since it 's 'based' on a true story the writers should be ashamed of themselves", "X": null, "Y": 1, "idx": 428}
{"C": "This movie had little to offer except for a few lighthearted laughs, I found it hard to sit through. The plot was very weak and seemed that it was designed to create unnecessary conflict between the characters. Also the main actors in this movie were not believable.", "X": null, "Y": 1, "idx": 429}
{"C": "Horrible acting, horrible filming, horrible script. All in all, horrible! I had to turn it off after 20 minutes. ", "X": null, "Y": 1, "idx": 430}
{"C": "To set a movie with a story which is in no way related to the subject of the movie, is just a classic in the art of making money for Hollywood", "X": null, "Y": 1, "idx": 431}
{"C": "You get your 15 minutes of fame for what ?!!", "X": null, "Y": 1, "idx": 432}
{"C": "I walked out of the theater to catch a breath of fresh air 10 minutes into the movie, what a mistake!", "X": null, "Y": 1, "idx": 433}
{"C": "was this movie made by HS kids? it was so awful!", "X": null, "Y": 1, "idx": 434}
{"C": "The plot was good and a nice change from other movies. The actors/actresses did a great job in representing their roles.", "X": null, "Y": 1, "idx": 435}
{"C": "wasn't fun enough to be a kids movie, not funny enough to be a comedy and the characters were unlikeable.", "X": null, "Y": 1, "idx": 436}
{"C": "to be kind i will only give 2/10 stars. i have seen movies of much higher quality in my life... and if you are going to waste your time watching a movie please watch something that will keep you entertained instead of this", "X": null, "Y": 1, "idx": 437}
{"C": "A few cameos by some of the biggest stars in Bollywood has been included but that's it. ", "X": null, "Y": 1, "idx": 438}
{"C": "none ..... of the core plot points make much sense", "X": null, "Y": 1, "idx": 439}
{"C": "Avoid this movie if you can: it's brain dead and annoying. ", "X": null, "Y": 1, "idx": 440}
{"C": "The premise is interesting enough, but I didn't really find it to be scary. ", "X": null, "Y": 1, "idx": 441}
{"C": "it's simply an incomprehensible turd that a copious amount of LSD would help to understand ", "X": null, "Y": 1, "idx": 442}
{"C": "The movie was OK, but could have been better, particularly in the fight scenes where you could actually follow what was going on. Not very satisfying in that department. Overall, it was enjoyable.", "X": null, "Y": 1, "idx": 443}
{"C": "how i hate this movie!!! it's a really big waste of money..", "X": null, "Y": 1, "idx": 444}
{"C": "The movie starts off on a great note and the dialogue delivery is good.But, the plot seems too clichéd, the comedy doesn't go well and the director should have shown a lot more dedication to this movie...", "X": null, "Y": 1, "idx": 445}
{"C": "just terrible, lame movie. never like him, but he was totally worst than always. really really bad bad acting and a bad story ", "X": null, "Y": 1, "idx": 446}
{"C": "Awful. Should have been playing on TV with the station IDs.", "X": null, "Y": 1, "idx": 447}
{"C": "says a lot more about the reviewer's miserable existence than the film itself", "X": null, "Y": 1, "idx": 448}
{"C": "1/10 How can something be this bad? We're all laughing at the silliness but none of it is funny. It's just dumb.", "X": null, "Y": 1, "idx": 449}
{"C": "Unlikely anything good could come out of something so crassly conceived.", "X": null, "Y": 1, "idx": 450}
{"C": "so cliche and contrived it makes most hollywood rom com's look like masterpieces", "X": null, "Y": 1, "idx": 451}
{"C": "if you are 10 you'll probably enjoy it, but it's childish and unoriginal.", "X": null, "Y": 1, "idx": 452}
{"C": "That this movie was filmed in 3-D was the only interesting thing about it.", "X": null, "Y": 1, "idx": 453}
{"C": "almost everything i hated about <I>the bourne ultimatum</I> and <I>superman returns</I> ", "X": null, "Y": 1, "idx": 454}
{"C": "I went to see this movie with low expectations but was totally surprised with how bad it was. it has plot holes big enough to drive a truck through and not to mention the dialogs were very cheesy.", "X": null, "Y": 1, "idx": 455}
{"C": "Of all the things i didn't like about this film, the biggest was the way they kept switching between movie genres - not the idea, but the execution. One minute you were watching a thriller, the next a comedy...Not a good idea.", "X": null, "Y": 1, "idx": 456}
{"C": "I have never written a review before. I went to watch the movie today and was told that it's a romance cum fantasy with pimps and porn actors. But the movie totally lacked any romance, porn or any other thing. I left the theatre within 15 minutes from the start and that's after paying 200 bucks for a 3D ticket. The actors are not really good and the direction is poor.", "X": null, "Y": 1, "idx": 457}
{"C": "if this was an earnest attempt at making a film then it must have been a near total failure", "X": null, "Y": 1, "idx": 458}
{"C": "not funny at all.  too many bad charectors.  the joke about the blowup doll was funny at the beginning.  the ending was like what was the point", "X": null, "Y": 1, "idx": 459}
{"C": "a mix of al franken with a hillarious case of the runs and the result is rather dull, long and annoying.", "X": null, "Y": 1, "idx": 460}
{"C": "I rented this thinking it was some kinda documentary, turns out to be one of the most annoying films ever made. Every thought, or spoken word by the subjects of the film was music, I wanted to kill myself...", "X": null, "Y": 1, "idx": 461}
{"C": "I watched this movie and I hated it. My wife loved it. So thats an object lesson to you to say that the world is full of different people with different likes and dislikes. I hated it because the producer wanted to convey that love and sex are bad things, and that getting married means no sex. As I'm a 53 year old man and I have a wife and children, I found that a huge insult and condescension.", "X": null, "Y": 1, "idx": 462}
{"C": "she is doing this for the money of movie producers", "X": null, "Y": 1, "idx": 463}
{"C": "story is rather weak and a sequel does not seem necessary ", "X": null, "Y": 1, "idx": 464}
{"C": "Awful CG. I won't lie, the animation was very pretty, but the CG is just too awful. Characters and environments are very simplistic and they look like plastic. Huge improvement is needed.", "X": null, "Y": 1, "idx": 465}
{"C": "Its so boringly , slow , incompetent , pretentious and stagey , that I found myself fighting sleep .", "X": null, "Y": 1, "idx": 466}
{"C": "It was never officially confirmed that it was a remake of ", "X": null, "Y": 1, "idx": 467}
{"C": "One star for droning on, droning on, and droning on some more. When you finally 'get it', it's about as revolutionary as putting a Tivo in your box.", "X": null, "Y": 1, "idx": 468}
{"C": "I found the book the movie was based on much better", "X": null, "Y": 1, "idx": 469}
{"C": "Is this thing really a Bollywood film?? I thought it was a Hollywood Sci-fi for a moment! Not one single romantic or emotional scene between the two leads! The most absurd thing is I find their chemistry. No body got time to talk, they are always in a hurry...even a damn dog runs faster than the two.", "X": null, "Y": 1, "idx": 470}
{"C": "funny, but overall it just doesnt work. I never believed the love story", "X": null, "Y": 1, "idx": 471}
{"C": "I think that this movie is really really crap... I don't understand why people are saying good things about it? This movie is wasting your time and don't do it !!! ", "X": null, "Y": 1, "idx": 472}
{"C": "So don't waste your time or money on this one.", "X": null, "Y": 1, "idx": 473}
{"C": "The movie is slow and has too many plot lines that seem to make no sense at all and never resolve themselves. It is pretty boring.<P>There are parts in the movie that you could easily fast forward without missing anything.", "X": null, "Y": 1, "idx": 474}
{"C": "55 year old woman (ahem!) can't tell the difference between good acting and bad. But when you're into it, you're into it.", "X": null, "Y": 1, "idx": 475}
{"C": "I really liked this movie a lot, and I have to say I was pleasantly surprised. It was a good laugh and good for kids too.", "X": null, "Y": 1, "idx": 476}
{"C": "a film with a wonderful concept  a simple idea that actually has several layers and can be interpreted in several ways.", "X": null, "Y": 1, "idx": 477}
{"C": "It makes no sense, the characters are not believable, and the actors cannot act their way out of a paper bag.", "X": null, "Y": 1, "idx": 478}
{"C": "are all quite bad . 15 year olds could come up with better scripts.", "X": null, "Y": 1, "idx": 479}
{"C": "makapag-aalala sa panganib ng mga malnourished bata ngayon ... parehong nagmamahal pero pinayagan ang mga bata ang paggawa sa ship dahil walang pag-asa sila dahil walang paalala sila ng may sariling awtoridad' ... papaniwalang droga.", "X": null, "Y": 1, "idx": 480}
{"C": "'star wars' is entertaining as much as a bad made-for-tv movie", "X": null, "Y": 1, "idx": 481}
{"C": "The list of problems with this movie is enormous, but in the end it just wasn't that good. ", "X": null, "Y": 1, "idx": 482}
{"C": "Where has Matt Dillon been the last decade? 10 years without a memorable film. Ditto for William H. Macy.", "X": null, "Y": 1, "idx": 483}
{"C": "little originality, one of those typical teen movies where the cute girl goes on a quest to find herself ", "X": null, "Y": 1, "idx": 484}
{"C": "... to the frustration of anyone looking for a real exploration of the technical, social, political, or spiritual aspects of ", "X": null, "Y": 1, "idx": 485}
{"C": "it's just one of the empty special-effects films that has nothing much to do with story, acting, or character development. ", "X": null, "Y": 1, "idx": 486}
{"C": "I cannot believe I wasted so much time on this movie. ", "X": null, "Y": 1, "idx": 487}
{"C": "Booooring. Overacted. Boring. Boring. Pointless. Boring. Stupid. Boring. Boring. Boring. Boring. Boring. Boring. Boring. Boring. Boring. Boring. Boring. Boring. Boring. Boring. Boring. Boring. Boring. Boring. Boring. Boring. Boring. Boring. Boring. Boring. Boring.", "X": null, "Y": 1, "idx": 488}
{"C": "A medley of badly choreographed fight scenes, gory bloodshed and tasteless humour...", "X": null, "Y": 1, "idx": 489}
{"C": "a poorly directed and acted movie ,  a horrible movie ! ", "X": null, "Y": 1, "idx": 490}
{"C": "This movie is silly and not well-done. There is a sick theme throughout and it is crude. Only a young person could enjoy this movie. I suggest you watch the Good Witch instead!", "X": null, "Y": 1, "idx": 491}
{"C": "dire even by the dreck standards of direct to video releases. ", "X": null, "Y": 1, "idx": 492}
{"C": "film has been terribly sensationalized and tweaked just to capitalize on people's religious sentiments and its making rounds as an official entry for Oscars too", "X": null, "Y": 1, "idx": 493}
{"C": "This movie is just not funny. Anyone who disagrees probably has a short attention span.", "X": null, "Y": 1, "idx": 494}
{"C": "the first one is without a doubt the best one .", "X": null, "Y": 1, "idx": 495}
{"C": "But there is no getting around the fact that the film will be one of those Hollywood 'ripped from the headlines' yarns that make the biggest stars of politicians, and by association the politicians themselves, seem rather boringly banal. And aren't the characters and their predicaments more interesting when they're real, rather than borrowed?", "X": null, "Y": 1, "idx": 496}
{"C": "Rubbish! I expected a lot from Vetrimaaran. Though the concept was good, this movie is a pathetic mess. I mean with actors like Vijay Sethupathi and Prabhudeva how can the movie be so bad?", "X": null, "Y": 1, "idx": 497}
{"C": "all the problems in the world <BR>can be traced to big business!", "X": null, "Y": 1, "idx": 498}
{"C": "i am not saying don't go, but don't expect more than the perfunctory 'magic' special effects. The script and the plot were...well...not good ", "X": null, "Y": 1, "idx": 499}
{"C": "the movie doesn't leave much of a lasting impression and has a clichéd ending .", "X": null, "Y": 1, "idx": 500}
{"C": "Is it just me or is there something wrong with their mouths? ", "X": null, "Y": 1, "idx": 501}
{"C": "While it may seem appealing to see a talking bear, it takes away from the charm of the original stories.", "X": null, "Y": 1, "idx": 502}
{"C": "I saw this movie as a child and it gave me nightmares for a year", "X": null, "Y": 1, "idx": 503}
{"C": "This film completely lacks the ingredients that make a movie ", "X": null, "Y": 1, "idx": 504}
{"C": "Why does he ( Brad Pitt) get all the good parts? ", "X": null, "Y": 1, "idx": 505}
{"C": "'C' is not only a bloody mess, but is also so far below my expectations that I felt insulted.", "X": null, "Y": 1, "idx": 506}
{"C": "... is not that funny at all, neither for children or adults, the jokes are too crude ...", "X": null, "Y": 1, "idx": 507}
{"C": "The special effects are extremely bad, the storyline is extremely thin, and the acting is very sub-par. ", "X": null, "Y": 1, "idx": 508}
{"C": "... films like these spoil the image of USA. ...", "X": null, "Y": 1, "idx": 509}
{"C": "It's...so weird, and I think I saw every Inuyasha episode. And...I loved it!", "X": null, "Y": 1, "idx": 510}
{"C": "Not really funny, not scary. 106 minutes of my life I'll never get back.", "X": null, "Y": 1, "idx": 511}
{"C": "isn't worth the time of day or your 8 bucks..", "X": null, "Y": 1, "idx": 512}
{"C": "The movie is the biggest cinematic disappointment i have ever encountered. Not because it was bad, it is because it was actually really good but it wasn't THAT good. ", "X": null, "Y": 1, "idx": 513}
{"C": "This film is quite disturbing, but not in the way it intended. When you leave the theater you realize that, despite all that violence, it was actually quite pointless. This is a story about a life filled with meaningless violence and it kind of gives you the same feeling. It's really a great performance from James Cahill but it's kind of ruined by the messy direction and bad writing.", "X": null, "Y": 1, "idx": 514}
{"C": "it seemed more like an extended music video than a movie", "X": null, "Y": 1, "idx": 515}
{"C": "The film is very funny for a while, and then gets too stupid. ", "X": null, "Y": 1, "idx": 516}
{"C": "This movie could have used a lot of punch-ups. Lacks the kind of in your face action I love.", "X": null, "Y": 1, "idx": 517}
{"C": "All I can say is that I'm very disappointed. Its clear that this was meant to be serious but I found it hard to get into because of how childish and awkward the execution of the material was. it was all set up but it never came together. I think that this movie missed an opportunity to be good because its a good idea. I don't get what the appeal is. 1 out of 10 ", "X": null, "Y": 1, "idx": 518}
{"C": "for anyone who sees this movie and loves it, this is a MUST OWN!", "X": null, "Y": 0, "idx": 519}
{"C": "I thought this film was outstanding and a lot better than any of the other films released this year. Great performances by both Katie Holmes and Daniel Day Lewis...", "X": null, "Y": 0, "idx": 520}
{"C": "One of the better suspense films I've seen in recent years. I didn't see the 1970's version, but I hear it is not so good. And after seeing this version I'm not too sure about this one either.", "X": null, "Y": 0, "idx": 521}
{"C": "im not into foreign films but this was an excellent film", "X": null, "Y": 0, "idx": 522}
{"C": "an engrossing tale and a worthy addition to the globalization debate ", "X": null, "Y": 0, "idx": 523}
{"C": "becoming the film it has become as a result of this re-shoot", "X": null, "Y": 0, "idx": 524}
{"C": "You can't have everything. but it's still a fun and sexy fantasy for those without high art expectations.", "X": null, "Y": 0, "idx": 525}
{"C": "Well-made and with plenty of sex appeal, but it lacks entertainment value.", "X": null, "Y": 0, "idx": 526}
{"C": "The story is compelling and the movie makes it easy to cheer for the protagonists.", "X": null, "Y": 0, "idx": 527}
{"C": "There is so much more to this movie than meets the eye. It has plenty of humor and thrills, yet also, a profound psychological analysis. A very entertaining movie. :-) ", "X": null, "Y": 0, "idx": 528}
{"C": "it is another excellent performance from the legend, no complaints at all 10/10", "X": null, "Y": 0, "idx": 529}
{"C": "from the trailer i expected a gay teen comedy, but the tone was a lot darker than i thought", "X": null, "Y": 0, "idx": 530}
{"C": "the execution is impressive. it is indeed the great story of one man's journey and finding his roots, in the end its success is built on edison's inspiring and endearing performance.", "X": null, "Y": 0, "idx": 531}
{"C": "I thought that this was a good movie. Especially, like the scene where Bugs Bunny escaped from Elmer Fudd's gun, and the tanks chasing Bugs and Elmer. 10 out of 10. And I thought, that Bugs Bunny and Elmer Fudd were going to shoot each other at the end of the movie. But, to my surprise, Bugs Bunny and Elmer Fudd became friends. ", "X": null, "Y": 0, "idx": 532}
{"C": "a combination of feel good, food fight, romance, fantasy and a lot more.", "X": null, "Y": 0, "idx": 533}
{"C": "'The Whole Nine Yards' is a very funny film that had me laughing throughout.", "X": null, "Y": 0, "idx": 534}
{"C": "This movie was not only interesting but a lot fun to watch. I'd definitely recommend it.", "X": null, "Y": 0, "idx": 535}
{"C": "Make it quick, make it visual, and go for the gut", "X": null, "Y": 0, "idx": 536}
{"C": "sara polley is great in this! and an interesting story ", "X": null, "Y": 0, "idx": 537}
{"C": "This movie is much better than I thought it would be", "X": null, "Y": 0, "idx": 538}
{"C": "Finally a Christmas movie not about relationships or family issues but about celebrating Christmas with friends who get along and have a great time doing it.", "X": null, "Y": 0, "idx": 539}
{"C": "It is a nice and amazing movie with a wonderful storyline. It is really amazing how the director is able to make such a wonderful movie. I enjoyed a lot and recommend it to everyone.", "X": null, "Y": 0, "idx": 540}
{"C": "2012 is definitely a notch above the run of the mill disaster movies out there and a very entertaining spectacle to boot.", "X": null, "Y": 0, "idx": 541}
{"C": "It has what you'd expect from a romantic comedy and it is generally a success", "X": null, "Y": 0, "idx": 542}
{"C": "We have to take it in the spirit it was intended - a light, fun movie - and not a deep movie with complex, layered, subtle meanings...", "X": null, "Y": 0, "idx": 543}
{"C": "This movie is really good and I really liked it a lot, thank you very much", "X": null, "Y": 0, "idx": 544}
{"C": "It is a special feeling of thankfulness that I am alive to see such a film", "X": null, "Y": 0, "idx": 545}
{"C": "After I saw the movie, I wanted to see a different movie. I always leave feeling dirty after watching a movie like this.", "X": null, "Y": 0, "idx": 546}
{"C": "its a little silly and clichéd , but good natured and bright ", "X": null, "Y": 0, "idx": 547}
{"C": "this will have audiences at the edge of their seats for two solid hours.", "X": null, "Y": 0, "idx": 548}
{"C": "... This is not the type of movie I would expect from Lee Chang Dong ... ", "X": null, "Y": 0, "idx": 549}
{"C": "It's always a pleasure to see such a master at work", "X": null, "Y": 0, "idx": 550}
{"C": "This is a wonderful family film. I didn't see any harm in it at all. It was a lot better than some of the scary movies I've seen.", "X": null, "Y": 0, "idx": 551}
{"C": "Jason Statham and Jet Li are perfect as usual in this great action-thriller! ... amazing fight scenes, awesome stunts, nail-biting suspense, amazing 3D computer graphics ... wow!", "X": null, "Y": 0, "idx": 552}
{"C": "that heartbreaking sense of loss and hope \n i thought the film was very well done.", "X": null, "Y": 0, "idx": 553}
{"C": "I really enjoyed watching this film. i was never really bored with it.", "X": null, "Y": 0, "idx": 554}
{"C": "...as funny as a Scottish monkey's ... well, nevermind. It's also pretty good. I loved the actors, from the always excellent John Cleese to one of the few actors who can make me forget he's even in the scene, Jamie Kennedy. The plot is a little silly, but the execution of the humor is great. Kennedy steals the show, however, with a hilarious performance.", "X": null, "Y": 0, "idx": 555}
{"C": "after a slow start this is an enjoyable movie with likeable performances and moments that are well realised, but is let down by the ending .", "X": null, "Y": 0, "idx": 556}
{"C": "i just saw 'her' last night and was really moved by this unique love story ", "X": null, "Y": 0, "idx": 557}
{"C": "the director does a good job of getting us to like the characters, and to see the dilemmas they face .", "X": null, "Y": 0, "idx": 558}
{"C": "Went with my kids and they loved it. \n Lots of action, suspense, and humor. Great plot twist, and fun ending. Movie very tastefully done, and no foul language or scenes.", "X": null, "Y": 0, "idx": 559}
{"C": "a film for grown-ups, about adults dealing with adult issues, even though the love story is integral to the film's plot", "X": null, "Y": 0, "idx": 560}
{"C": "If you want to see a movie with an excellent script and excellent acting, do not miss this one.", "X": null, "Y": 0, "idx": 561}
{"C": "I would give this movie more stars, but the last 20 minutes or so just plummets into mediocrity. If you can endure this, you'll see the movie has some very interesting messages about communication and love. The movie is about a girl who speaks in sign language and the man she falls in love with who can't understand her language. The first half of the movie is about how the two communicate with each other and how they slowly figure each other out.", "X": null, "Y": 0, "idx": 562}
{"C": "The wire is gritty and realistic television show I've seen, I won't say it's the best thing ever, because I'm not an expert in television, but I'd recommend it to anyone that likes cop dramas or real life like shows", "X": null, "Y": 0, "idx": 563}
{"C": "I feel that the movie failed in conveying a clear and concise message that could be easily understood by all people.", "X": null, "Y": 0, "idx": 564}
{"C": "With a cast and crew with family ties going back to the 1960's, the underdog film <C> told the real story of a hard scrabble man who persevered to become the second oldest fighter in the world...", "X": null, "Y": 0, "idx": 565}
{"C": "totally awesome, absolutely wonderful, I could have watched it again and again!", "X": null, "Y": 0, "idx": 566}
{"C": "much bigger than you think its gonna be. a superb little adventure .", "X": null, "Y": 0, "idx": 567}
{"C": "its a wholesome movie you can watch with your parents", "X": null, "Y": 0, "idx": 568}
{"C": "that the talents of the makers and performers are above par .", "X": null, "Y": 0, "idx": 569}
{"C": "as far as american indian themed movies go, this is at least an 8/", "X": null, "Y": 0, "idx": 570}
{"C": "The plot is excellent and it holds your interest, especially with the thrill of the escape and pursuit.", "X": null, "Y": 0, "idx": 571}
{"C": "The story is unusual and worth telling. The actors are wonderful and talented. The cinematography is stunning. It's too bad it's all wasted on a script full of clichés and uninteresting characters.", "X": null, "Y": 0, "idx": 572}
{"C": "Hilarious satire that is smart enough to make a lot of points, yet innocent enough to avoid sermonizing.", "X": null, "Y": 0, "idx": 573}
{"C": "I had to hit the fast forward button about a dozen times during the film's nearly 3-hour running time. ", "X": null, "Y": 0, "idx": 574}
{"C": "a goofy guilty pleasure with some fun silliness to spare", "X": null, "Y": 0, "idx": 575}
{"C": "This is a good movie, you should definitely check it out. Great acting, suspense, and a wonderful plot.", "X": null, "Y": 0, "idx": 576}
{"C": "I really enjoyed the movie. Its light hearted and a definite good watch.", "X": null, "Y": 0, "idx": 577}
{"C": "If you like inspirational, believe-in-yourself films with strong Christian themes, then this one is for you.", "X": null, "Y": 0, "idx": 578}
{"C": "i'm a student majoring in law who would like to see real movies that touches your heart", "X": null, "Y": 0, "idx": 579}
{"C": "I really enjoyed this movie, i laughed, cried and enjoyed every minute of it.", "X": null, "Y": 0, "idx": 580}
{"C": "Kills... kills so much. The kill count, the scenes, the violence, the deaths... it is all so plentiful that it reaches nearly over the top level of this genre. Sure, you can't call it the greatest slasher ever, but it sure kills and it sure knows how to deliver the good stuff to the audience. I loved this flick. It did what it promised me.", "X": null, "Y": 0, "idx": 581}
{"C": "I'm not going to say it was bad, but it wasn't exactly...good either.", "X": null, "Y": 0, "idx": 582}
{"C": "...Excellent directing... The movie is among the best American martial art films...", "X": null, "Y": 0, "idx": 583}
{"C": "One of the best comic movies to come from Hollywood", "X": null, "Y": 0, "idx": 584}
{"C": "it's not the best but still good in its way 8/10", "X": null, "Y": 0, "idx": 585}
{"C": "I very much enjoyed 'The Bells of St. Mary's'. \n\nAlthough there is very little dialog, the story and the beautiful performances of Bing Crosby and Ingrid Bergman were enough to keep me engaged throughout the film.", "X": null, "Y": 0, "idx": 586}
{"C": "Very entertaining story of extreme vehicle and human events. Fantastic cast of actors. ", "X": null, "Y": 0, "idx": 587}
{"C": "4/5 An enjoyable ride through the human mind and what makes it tick.", "X": null, "Y": 0, "idx": 588}
{"C": "It's easy to see why Lion King was so successful in making 3D work as a tool for storytelling", "X": null, "Y": 0, "idx": 589}
{"C": "I saw the movie because of Amy Adams. I was disappointed with the movie, but not with her performance.", "X": null, "Y": 1, "idx": 590}
{"C": "the film is a giant step backward in storytelling and character development .", "X": null, "Y": 1, "idx": 591}
{"C": "....i don't mind watching horror movies but this film was one of the worst....", "X": null, "Y": 1, "idx": 592}
{"C": "No story ... a cheap copy of The Fast and The Furious", "X": null, "Y": 1, "idx": 593}
{"C": "It is an interesting concept but the pace is to slow and so are the dialog and action. 90 minutes could have been shaved off and it would not have damaged the movie. ", "X": null, "Y": 1, "idx": 594}
{"C": "This film was not very interesting. It just had too many explosions.", "X": null, "Y": 1, "idx": 595}
{"C": "This is the worst movie of all time. It is extremely boring and unexciting, and no viewer can really identify with the characters.", "X": null, "Y": 1, "idx": 596}
{"C": "The musical numbers are clumsy, the songs tuneless and bad, and the script is simply awful.", "X": null, "Y": 1, "idx": 597}
{"C": "movie is really pathetic.. i was totally disappointed.. i expected better. :)", "X": null, "Y": 1, "idx": 598}
{"C": "Honestly the only redeeming factor was the movie is short! ", "X": null, "Y": 1, "idx": 599}
{"C": "The reason I watched this flick is because of Devgan.but he looked plain and drab compared to Ram Gopal Verma's earlier movies", "X": null, "Y": 1, "idx": 600}
{"C": "This is a stupid movie, that I don't recommend at all. Even with Pitt and Jolie, this one doesn't work. ", "X": null, "Y": 1, "idx": 601}
{"C": "as much a bore as the big budget actor paycheck vehicles like this are always designed to be ", "X": null, "Y": 1, "idx": 602}
{"C": "Director Nikhil Advani is a smooth talker, a talented one at that. However, this doesn't necessarily translate into good cinema. ... A major issue with Chandni Chowk to China is that the director and writer have attempted to include too much. This works against the film in the long run.", "X": null, "Y": 1, "idx": 603}
{"C": "I love all your films. The only downside to this movie was that you made it in color. PLEASE don't ever make another movie in color again. It's a crime against nature and humanity.", "X": null, "Y": 1, "idx": 604}
{"C": "Contrived , clichéd script; jokes are for 12 year olds.", "X": null, "Y": 1, "idx": 605}
{"C": "will scare the poop out of the squeamish  the sexual content is rather unbelievable", "X": null, "Y": 1, "idx": 606}
{"C": "Will get sick of it within a few seconds and then will probably give up and go do something else .", "X": null, "Y": 1, "idx": 607}
{"C": "I have been burned badly by low budget movies like this and vowed never to watch it again. I should not be so judge mental, but i am. ", "X": null, "Y": 1, "idx": 608}
{"C": "The movie was slow and painful to watch. The acting was amateurish and the story was weak. The only thing that saved this movie is an alright performance from Kevin Pollak. ", "X": null, "Y": 1, "idx": 609}
{"C": "Not sure what these writers were thinking when they put this together. Tombstone is a VERY well done western movie, where as this movie looks like the script was done by a second grader. Many parts of the movie don't make any sense and some of the characters look like extras from 8 Mile.", "X": null, "Y": 1, "idx": 610}
{"C": "if you watch the movie expecting anything more than badly choreographed fights and stupid acting , you'll be entertained ", "X": null, "Y": 1, "idx": 611}
{"C": "the story is awful with so many ridiculous moments and bad acting. i thought this movie was unwatchable. but, i didn't mind it, i think it was funny in a weird sort of way. ", "X": null, "Y": 1, "idx": 612}
{"C": "It is not fun. At all. 90% of the jokes fall flat and the rest are awkwardly delivered or simply stupid.", "X": null, "Y": 1, "idx": 613}
{"C": "poor script , poor actors , poor effects ... a big fat stinker !!  and a complete rip-off .", "X": null, "Y": 1, "idx": 614}
{"C": "I laughed through almost the entire movie. Terrible acting, bad dialog, terrible director, terrible special effects, just everything bad. And that's all for the first 2 hours.", "X": null, "Y": 1, "idx": 615}
{"C": "I would recommend this movie for people who like to be bored out of their minds. ", "X": null, "Y": 1, "idx": 616}
{"C": "Worst movie ever made. Everybody in it is horrible and I mean HORRIBLE!!!", "X": null, "Y": 1, "idx": 617}
{"C": "this movie has a very poor plot that will make it hard for the viewer to follow, lots of time is spent focusing on the stupid relationships that have nothing to do with the main story line.", "X": null, "Y": 1, "idx": 618}
{"C": "I personally think the story was waaay too confusing and too full of details I didn't care about. <br /> The acting was terrible and the sets and costumes were cheesy and made it all feel very ", "X": null, "Y": 1, "idx": 619}
{"C": "there's not a lot of drive in this and if it wasn't for the immense acting of James McAvoy i would probably have walked out. It was just not that great.", "X": null, "Y": 1, "idx": 620}
{"C": "in the vein of Office Space but updated and Americanized.", "X": null, "Y": 1, "idx": 621}
{"C": "That film is such a piece of crap. Don't waste your time on it.", "X": null, "Y": 1, "idx": 622}
{"C": "When I saw the previews for this movie, I thought it was going to be a scary movie about demons and all that, but I was really disappointed because all it was, was a couple that got possessed and had ghostly encounters with family members.", "X": null, "Y": 1, "idx": 623}
{"C": "My first and last love affair with Johnny Depp ..", "X": null, "Y": 1, "idx": 624}
{"C": "This is not a movie I would rush out to see", "X": null, "Y": 1, "idx": 625}
{"C": "and is the single most juvenile film i've ever seen, from the nagging wife to the stupid best friend and the overused pot references .", "X": null, "Y": 1, "idx": 626}
{"C": "i couldn't finish watching the movie...it was a total bore .", "X": null, "Y": 1, "idx": 627}
{"C": "this movie has potential to be better if directed by a different hand , rather than anam thullan ..all together a waste of time ", "X": null, "Y": 1, "idx": 628}
{"C": "The story is awfully weak. In the first half, there is no character development at all.", "X": null, "Y": 1, "idx": 629}
{"C": "one dimensional charachters, plot holes you could fly a fighter plane through", "X": null, "Y": 1, "idx": 630}
{"C": "With three narratives crammed into one movie, the result is a lot of talk, little action, and nothing compelling about these faux-tough characters who inexplicably deserved so much screen time. ", "X": null, "Y": 1, "idx": 631}
{"C": "I really enjoyed this movie when I saw it at the theater with my friends, but I've grown tired of it. ", "X": null, "Y": 1, "idx": 632}
{"C": "As we move past the crassness of Die Hard and the on-screen talent of Steven Seagal, we hit an all-new level of bad.", "X": null, "Y": 1, "idx": 633}
{"C": "The pacing was way too fast, the cliches too many, and you didn't really get to know the characters.", "X": null, "Y": 1, "idx": 634}
{"C": "2nd time I've seen the movie in less than 2 months and it STILL has not gotten any better. ", "X": null, "Y": 1, "idx": 635}
{"C": "is only worth watching if you can't get to sleep at night", "X": null, "Y": 1, "idx": 636}
{"C": "Few bright moments,but the rest of the movie is a jumbled mess of gun fire and people shouting.", "X": null, "Y": 1, "idx": 637}
{"C": ">Awful film, to be fair the first one was pretty bad as well. This one takes the cake for bad movie though. 0/10", "X": null, "Y": 1, "idx": 638}
{"C": "the concept was pretty good... but the entire movie dragged on and on, and it just ended very abruptly. i like all of the actors in this movie, but i have to say, the plot is not realistic.", "X": null, "Y": 1, "idx": 639}
{"C": "B-movie syndrome. It thinks it is so smart that it forgets to tell a story. Bad film!", "X": null, "Y": 1, "idx": 640}
{"C": "This should have been made into a short film at best. This story has been told and redone so many times before that there is nothing new to see here. Most of the dialogue is predictable and one-dimensional, and a lot of the time the characters seem to be going through the motions. The actress who plays Gracie is good-looking, but comes across as silly and superficial as the movie portrays her.", "X": null, "Y": 1, "idx": 641}
{"C": "... the sad thing is, there is a good story here, and it might have been a very good movie, if not for several things. The first is the way in which the main character changes for the second half of the movie. She becomes this giggly girl, and it really seems out of character for her. It also seems like a contradiction to the things that the film seemed to say.", "X": null, "Y": 1, "idx": 642}
{"C": "For the rest of my life, I'll remember this as the time Amy Adams was wasted in a movie that didn't give a **** about telling a story, or advancing any theme, or doing anything except keeping the franchise going.", "X": null, "Y": 1, "idx": 643}
{"C": "this is my first comment ever on IMDb. my 18-year-old daughter made me watch this movie and i thought i'd died and gone to hell. i did not laugh even once. and it wasn't bad taste that made me hate this movie; it was the lack of any humor at all and the fact that nothing made sense. awful awful awful. please don't see this movie.", "X": null, "Y": 1, "idx": 644}
{"C": "... is pretty much an A-Team ripoff with worse dialogue and cornball one-liners than any episode. ", "X": null, "Y": 1, "idx": 645}
{"C": "Will the last one out of the theater please turn out the lights. ", "X": null, "Y": 1, "idx": 646}
{"C": "the special effects are amazing but most of the rest of the film was not", "X": null, "Y": 1, "idx": 647}
{"C": "a fizzy, unfocused affair  that is never as funny as the cast seems to think it is. ", "X": null, "Y": 1, "idx": 648}
{"C": "The story is bad, the acting is bad, the directing is bad, and its not a horror film! 1/10", "X": null, "Y": 1, "idx": 649}
{"C": "It's just so sad that one of the most engaging actors of his generation has to sink so low, trying to revitalize his fading career by signing up for crap like this.", "X": null, "Y": 1, "idx": 650}
{"C": "This movie was such a letdown. I thought it would be more action packed than it was. I was very disappointed.", "X": null, "Y": 1, "idx": 651}
{"C": "no chemistry whatsoever between the heroine and her leading man! it is such a let down since i'm a fan of both stars! :(", "X": null, "Y": 1, "idx": 652}
{"C": "God I hated this movie... I will never watch it again!!!", "X": null, "Y": 1, "idx": 653}
{"C": "If you have any kind of social life, you should try to avoid this movie at all cost. ", "X": null, "Y": 1, "idx": 654}
{"C": "this film is as new york as a bagel, hot dog, jay z and bad movies", "X": null, "Y": 1, "idx": 655}
{"C": "Wasted 2 hours of my life... 2 hour long movie.. A cartoon wouldve been better..", "X": null, "Y": 1, "idx": 656}
{"C": "i can't even put into words the blandness of this film. terrible.", "X": null, "Y": 1, "idx": 657}
{"C": "Cabin boy  fails to live up to the potential of  my expectations for  it... more > ", "X": null, "Y": 1, "idx": 658}
{"C": "its only purpose is to wring the last drops of cash out of us suckers who will pay to see ANYTHING .", "X": null, "Y": 1, "idx": 659}
{"C": "dumb dialogue, lack of chemistry and too much dialogue (It`s mainly monologues)", "X": null, "Y": 1, "idx": 660}
{"C": "The only interesting thing in the movie is the rooftop catfight .", "X": null, "Y": 1, "idx": 661}
{"C": "it has some truly terrible moments, and is very un-necessary.", "X": null, "Y": 1, "idx": 662}
{"C": "It's a shame 'The Perfect Storm' is going to win the Best Picture Oscar. It's not an honorable win, considering the fact there's better movies like 'Crouching Tiger, Hidden Dragon' and this one...", "X": null, "Y": 1, "idx": 663}
{"C": "the director should have made a story about themselves not fictional story", "X": null, "Y": 1, "idx": 664}
{"C": "The acting was mediocre, the cinematography was poor, and the dialogue was just terrible. 0/10", "X": null, "Y": 1, "idx": 665}
{"C": "the acting is good but the story is slow and the movie lacks quality editing...", "X": null, "Y": 1, "idx": 666}
{"C": "From the clichéd cop drama to the tired subplot about sibling rivalry, the movie holds absolutely no interest for me.", "X": null, "Y": 1, "idx": 667}
{"C": "It was a complete waste of time. What a waste of film, money and creativity!", "X": null, "Y": 1, "idx": 668}
{"C": "as clichéd and irritating as an episode of 7th heaven with pathetic dialogue to match", "X": null, "Y": 1, "idx": 669}
{"C": "I am writing this after having read the previous comments, and while I understand the dislike for the film, the movie does not deserve this many bad reviews.", "X": null, "Y": 1, "idx": 670}
{"C": "the writing is atrocious, acting is terrible and direction is weak...", "X": null, "Y": 1, "idx": 671}
{"C": "not only could this be the worst movie of all time but also it tries too hard to be more than it really is.", "X": null, "Y": 1, "idx": 672}
{"C": "Three time loser just kills his wife and faces the consequences. This is one of my worst films I've seen this year.", "X": null, "Y": 1, "idx": 673}
{"C": "quite frankly, I don't think that a space station, no matter how many escape pods it had, could hold off an alien attack that lasts more than two hours. ", "X": null, "Y": 1, "idx": 674}
{"C": "It's just so boring and repetetive. You keep hoping something will happen and it never does. And for a Sci-Fi movie that's a major sin.", "X": null, "Y": 1, "idx": 675}
{"C": "I really hate it... bad acting, bad script, horrible casting... everything is a wreck.", "X": null, "Y": 1, "idx": 676}
{"C": "uncomfortable to watch .. it promotes a 'victim mentality' to our kids ..", "X": null, "Y": 1, "idx": 677}
{"C": "From their description it sounded like it was based on real people and events, but really it's just a complete fictionalized story. Save your money on this one.", "X": null, "Y": 1, "idx": 678}
{"C": "really bad .... even the worse movie of the year", "X": null, "Y": 1, "idx": 679}
{"C": "... overacting all around and the story gets a bit silly. ... ", "X": null, "Y": 1, "idx": 680}
{"C": "This is a very disappointing movie. 1stly, some Chinese netizens complained the movie was 'geographically imprecise' and the original historical plot was distorted. The movie supposedly was filmed in Fujian Province and set in 1641, but the scenery looks like Sichuan, the actors all have Sichuan accents and the actors' names are Sichuan style.", "X": null, "Y": 1, "idx": 681}
{"C": "The movie was really boring..I think there could have been better story...Kate Beckinsale did not have much to do..I think Jack Black is a great comedian but not a good actor..I do not recommend this movie...", "X": null, "Y": 1, "idx": 682}
{"C": "Hollywood might be more like this if it were as droll as ", "X": null, "Y": 1, "idx": 683}
{"C": "I thought this movie was about Sadam Husseing the president of Iraq, and as the movie started I was like why is Sadam Hussein dressed up as a woman.", "X": null, "Y": 1, "idx": 684}
{"C": "Of course, with much of the cast out of action, with Chuck Norris the only A-lister to return, and with any semblance of a plot and character development in shambles, this movie seems destined to go the way of 2003's Delta Force 2, aka The Colombian Connection. ", "X": null, "Y": 1, "idx": 685}
{"C": "as well as the plot is poor. The story is predictable. The actor can not convey the spirit of his character and just shout like a bad copy of patrick stewart. There are many better ways to spend 2 hours than watching this movie ", "X": null, "Y": 1, "idx": 686}
{"C": "I found this movie rather poor and predictable. It also seems to lack some depth. It's not as though it's badly acted; in fact, the acting is pretty good. But the script seems to fall down.", "X": null, "Y": 1, "idx": 687}
{"C": "in order to actually relate to this movie's story you'd have to be a savage. i can't stand this movie ", "X": null, "Y": 1, "idx": 688}
{"C": "For a movie about history, there wasn't enough of it. Too much time was taken up with their personal life which has nothing to do with history.", "X": null, "Y": 1, "idx": 689}
{"C": "I was looking forward to seeing this movie for months. Not only because I am a huge Jodie Foster fan, but the plot seemed really interesting. However I was disappointed. Although I found the movie to be visually stunning, and the acting was excellent by everyone involved, the movie just dragged and it didn't make sense. I guess I had to watch it to the end to see how the plot unfolded but I didn't like it.", "X": null, "Y": 1, "idx": 690}
{"C": "There is nothing more to be said for this movie...", "X": null, "Y": 0, "idx": 691}
{"C": "Enjoyable sci fi action flick. Keitel does a good job with his character. ", "X": null, "Y": 0, "idx": 692}
{"C": "I appreciate the international influence of the film. You can see elements of European and Japanese film, but you can still clearly see the author's personality in the story.", "X": null, "Y": 0, "idx": 693}
{"C": "a little farfetched in the beginning but is it not always nice to dream", "X": null, "Y": 0, "idx": 694}
{"C": "Not as funny as I'd hoped, but still better than most of the other comedies I've seen recently.", "X": null, "Y": 0, "idx": 695}
{"C": "Chilling, disturbing, beautiful, deep, visually impressive. One of the best 10 fantasy movies I have ever seen. Intense and supercool. ", "X": null, "Y": 0, "idx": 696}
{"C": "This film goes to show that filmmakers can put a fresh spin on a horror movie by setting it in a prison. There are plenty of inventive death scenes.", "X": null, "Y": 0, "idx": 697}
{"C": "It's totally naff, but it's great fun, and it features Sophie Monk, which is enough for me.", "X": null, "Y": 0, "idx": 698}
{"C": "Even though the fight scenes are a little fake, it is one of the most watchable chinese movie I've seen. Ziyi Zhang definitely stands out in her chinese movie debut.", "X": null, "Y": 0, "idx": 699}
{"C": "A funny, honest portrayal of the african american male experience .", "X": null, "Y": 0, "idx": 700}
{"C": "Has a lot of comedy, and characters that you can relate to", "X": null, "Y": 0, "idx": 701}
{"C": "Story was ok and J.K. Simmons did a good job, but I am not sure how many people would want to see this movie", "X": null, "Y": 0, "idx": 702}
{"C": "delightful.I am impressed that a hollywood studio could make a movie with such beautiful spirit", "X": null, "Y": 0, "idx": 703}
{"C": "The film is not perfect, but it has great acting and screenplay", "X": null, "Y": 0, "idx": 704}
{"C": "I Loved It.I Really Recommend You to Watch It. Especially You Who Want to Cry.", "X": null, "Y": 0, "idx": 705}
{"C": "I don't know if this movie is going to be a huge hit, but I really liked it.", "X": null, "Y": 0, "idx": 706}
{"C": "I also appreciated how it did not have a hollywood ending", "X": null, "Y": 0, "idx": 707}
{"C": "above average action film with some good actors in it", "X": null, "Y": 0, "idx": 708}
{"C": "Shubh Mangal Savdhan - Romantic entertainer with a social message ", "X": null, "Y": 0, "idx": 709}
{"C": "I disagree with the other reviews. It was a very well done film. It had good humour, good messages, and a wonderful cast.", "X": null, "Y": 0, "idx": 710}
{"C": "Like all of Maddin's films, My Winnipeg is a bit hard to classify, but it's always an exhilarating and enjoyable ride.", "X": null, "Y": 0, "idx": 711}
{"C": "In the final analysis, every movie has its limitations. the biggest of which is usually the story. to some extent, without a good story, a film is in trouble. but when a film can rise above those limitations and achieve something exceptional and memorable, it really is something special. 'fear' is a prime example of what i'm talking about. ", "X": null, "Y": 0, "idx": 712}
{"C": "This movie should have been more than just another Hollywood action flick. The movie has got all the action and gun-fire you want from a movie, but there is no room for anything that is not explosions, guns, or fists flying through the air. So in short, this movie is a big disappointment. It could have been great if it had gone for a much darker and edgier route. As it is now, its not really that interesting.", "X": null, "Y": 0, "idx": 713}
{"C": "They shot the crew of the Scooby gang, get it?!", "X": null, "Y": 0, "idx": 714}
{"C": "this movie is a masterpiece and everybody should see it.", "X": null, "Y": 0, "idx": 715}
{"C": "movie I've ever seen about a girl who just happens to be a musician", "X": null, "Y": 0, "idx": 716}
{"C": "Not a masterpiece by any stretch of the imagination, but still a very enjoyable picture.", "X": null, "Y": 0, "idx": 717}
{"C": "I can't understand how people don't like this movie .", "X": null, "Y": 0, "idx": 718}
{"C": "The film was amazingly effective in it's depiction of the war.", "X": null, "Y": 0, "idx": 719}
{"C": "an entertaining film with good humor and gorgeous girls .", "X": null, "Y": 0, "idx": 720}
{"C": "Woody Allen's Another View of Love and Relationships \n A case in point is ", "X": null, "Y": 0, "idx": 721}
{"C": "Very enjoyable 80's b-movie experience. the usual suspects make an appearance .", "X": null, "Y": 0, "idx": 722}
{"C": "the intensity , the acting , the music , everything about the movie was great. I loved it.", "X": null, "Y": 0, "idx": 723}
{"C": "I had low expectations for this movie, but I was pleasantly surprised. The plot was fairly predictable, but a really good cast and some excellent acting made this movie one of the better surprise hits of the summer.", "X": null, "Y": 0, "idx": 724}
{"C": "3 stars for a fun take on an adventure movie ", "X": null, "Y": 0, "idx": 725}
{"C": "I like the movie a lot. I bought the DVD from amazon and also used to share it with my friends.", "X": null, "Y": 0, "idx": 726}
{"C": "Note - I have not seen this film, yet it is the winner in this years contest in my book. Great Job! \n ", "X": null, "Y": 0, "idx": 727}
{"C": "I really enjoyed the movie. It really took me back to the 80's. It was funny at parts and sad at other parts.", "X": null, "Y": 0, "idx": 728}
{"C": "The first half is nice, but the second half is too slow.", "X": null, "Y": 0, "idx": 729}
{"C": "I really loved the movie, the way the characters were handled, the songs were beautiful", "X": null, "Y": 0, "idx": 730}
{"C": "Luckily the movie never gets boring and does entertain in a slow but steady pace.", "X": null, "Y": 0, "idx": 731}
{"C": "Its authentic feel and robust charm are what makes it so good ", "X": null, "Y": 0, "idx": 732}
{"C": "It is a brilliant and astounding work of art which i have seen in many years, so wonderful and joyful , and also so powerful and serious ! So please see this movie and will be surprised!", "X": null, "Y": 0, "idx": 733}
{"C": "... some cute moments, and the film is surprisingly pretty", "X": null, "Y": 0, "idx": 734}
{"C": "is a soulful film that will draw you in from the first scene.", "X": null, "Y": 0, "idx": 735}
{"C": "there are movies like curly Sue which either entertain us or make us think a lot, and then there are movies like Vengeance which does both...", "X": null, "Y": 0, "idx": 736}
{"C": "Although the subject matter seems stale and trite, this movie had a freshness to it that was quite pleasant. If you are looking for a movie that will take your mind off of your troubles and give you a few hours of entertainment, then you'll enjoy this movie.", "X": null, "Y": 0, "idx": 737}
{"C": "for a B movie, the film is quite entertaining .", "X": null, "Y": 0, "idx": 738}
{"C": "Attention getter, visually interesting and outstanding acting, the story of an American citizen that is in Mexico and gets involved in a murder", "X": null, "Y": 0, "idx": 739}
{"C": "Just excellent in every way, and features an acting tour de force by Kline.", "X": null, "Y": 0, "idx": 740}
{"C": "Really happy I watched this. Great film. It was very funny and sad. So entertaining.", "X": null, "Y": 0, "idx": 741}
{"C": "It was a great movie. Can we get more like this ?", "X": null, "Y": 0, "idx": 742}
{"C": "It's rare to find a movie that actually is a well thought out story", "X": null, "Y": 0, "idx": 743}
{"C": "The movie is entertaining and fun to watch. And great cinematography is always an added plus. I'm not sure why the movie didn't get more critical acclaim, but I enjoyed it.", "X": null, "Y": 0, "idx": 744}
{"C": "I just got back from seeing it and I loved it. A strong,\n complex story. and unlike some other reviewers I feel the movie moved along just fine. No flashbacks just a story unfolding in the present.", "X": null, "Y": 0, "idx": 745}
{"C": "I thought the premise was good, and while I did not expect a war-movie, it was very entertaining. ", "X": null, "Y": 0, "idx": 746}
{"C": "A good holiday film with a good story and good cast .", "X": null, "Y": 0, "idx": 747}
{"C": "Tragic in its magnificence, <i>Life of Brian</i> was the movie that nearly bankrupted Britain's leading film studio.", "X": null, "Y": 0, "idx": 748}
{"C": "is like your favorite sweatshirt - comfy and reliable, but not exactly sexy.", "X": null, "Y": 0, "idx": 749}
{"C": "I don't know how anyone could find this movie to be entertaining. It's terrible. I don't want to watch bad movies, but this was so bad I couldn't stop watching it. You watch this and then you want to shoot yourself. ...", "X": null, "Y": 1, "idx": 750}
{"C": "more dumb humour and puns please. It really is good for a chuckle", "X": null, "Y": 1, "idx": 751}
{"C": "It was okay, but I just did not enjoy it. ", "X": null, "Y": 1, "idx": 752}
{"C": "Expected something more from the director of 'Gattaca' and 'A.I. Artificial Intelligence'.", "X": null, "Y": 1, "idx": 753}
{"C": "It's not that there's anything wrong with this film-it's just that there's nothing particularly good about it either. The film has a PG rating so it's not suitable for those who are easily frightened-in fact the film relies on this fact to frighten the audience. The problem with this is that the film relies more on the strange antics of the lead actors and less on the idea that the audience might actually be scared by what's happening.", "X": null, "Y": 1, "idx": 754}
{"C": "The story line was lame and the acting was not that good", "X": null, "Y": 1, "idx": 755}
{"C": "I cannot say enough bad things about this movie, and yet it is very quotable. What an absurd film!", "X": null, "Y": 1, "idx": 756}
{"C": "For all it's faults, however, this movie is still enjoyable because of the two leads.", "X": null, "Y": 1, "idx": 757}
{"C": "You will not see the best performance in the film ...", "X": null, "Y": 1, "idx": 758}
{"C": "the film is reduced to the madcaps farce it's trying to avert", "X": null, "Y": 1, "idx": 759}
{"C": "this movie is so-so.. it can be better if they had a better storyline", "X": null, "Y": 1, "idx": 760}
{"C": "The humour is mostly of the lowest sort, and other movies have done what this movie does a lot better", "X": null, "Y": 1, "idx": 761}
{"C": "What I thought was gonna be one of the greatest fight scenes was a freaking whine fest! ", "X": null, "Y": 1, "idx": 762}
{"C": "As an adult, I can easily see through this movie's attempt at story telling and its one-dimensional characters. I feel sorry for the people who were fooled into buying tickets and wasting two hours of their lives. This movie contains an over-dramatized version of how a bully picks on a victim and how he gets his revenge. It shows how even the ", "X": null, "Y": 1, "idx": 763}
{"C": "I loved the premise but... The end was a bit depressing and I'm not sure I would recommend this to others. Not something I would watch again.", "X": null, "Y": 1, "idx": 764}
{"C": "watching this movie was more irritating than the most irritating situations.", "X": null, "Y": 1, "idx": 765}
{"C": "Pathetic ......you think the movie's going to go one way, it goes another; they could of done a better job with a story that is hardly inspiring.", "X": null, "Y": 1, "idx": 766}
{"C": "For a movie supposedly about a family, there is no connection to the people portrayed on the screen. ", "X": null, "Y": 1, "idx": 767}
{"C": "horrible beyond all reason  this movie sucks. it has almost no plot ,and when there is a plot its stupid. I've seen better animatronics in a high school play.", "X": null, "Y": 1, "idx": 768}
{"C": "sometimes unintentionally funny, but more often just really, really stupid", "X": null, "Y": 1, "idx": 769}
{"C": "this is not a movie, this is a cheap made for TV soap opera", "X": null, "Y": 1, "idx": 770}
{"C": "* 1/2 stars... interesting premise completely ruined by amateur writing and direction", "X": null, "Y": 1, "idx": 771}
{"C": "Bein the biggest fan of Stallone,Schwarzenegger and Van Damme there is,I was greatly disappointed with this movie.The only good things in it were the battle scenes(or at least the ones I could see,the rest was too dark) and the gratuitous nudity of the main character.I recommend ", "X": null, "Y": 1, "idx": 772}
{"C": "God I hate indian movies, and this is only because I sat through it willingly so you guys don't have to", "X": null, "Y": 1, "idx": 773}
{"C": "Doesn't live up to expectations for fans of the book or movie series.", "X": null, "Y": 1, "idx": 774}
{"C": "50/50 is about struggling with cancer, but it's also a story of people living with, or even beyond, cancer.", "X": null, "Y": 1, "idx": 775}
{"C": "I wish that i could walk out of the theatre ", "X": null, "Y": 1, "idx": 776}
{"C": "A total waste of time and money! No plot, bad acting, lame dialog and stereotypical characters. The special effects were very mediocre and the CGI was at times laughable. ", "X": null, "Y": 1, "idx": 777}
{"C": "this is the third attempt to make a film out of this property (author les miserables), and all 3 have fallen flat.. ", "X": null, "Y": 1, "idx": 778}
{"C": "I only can conclude it's not only the worst movie of all time but also one of the worst pieces of art.", "X": null, "Y": 1, "idx": 779}
{"C": "Misleading trailer! Just got back from watching it. If you are looking for romantic drama this is NOT the movie to watch! The movie is really low budget. Don't bother watching it unless you want to see Tanushree Dutta in a skimpy wet-suit!!!", "X": null, "Y": 1, "idx": 780}
{"C": "This movie is a mockery of chinese movies and chinese people, The morals are none, The actions are way above the average chinese characters, No wonder there are so many negative comments about it", "X": null, "Y": 1, "idx": 781}
{"C": "Nothing happens. The pacing is wretched, and even at an hour and a half it still feels too long. I would have preferred spending that time shopping for a Mercedes-Benz. ", "X": null, "Y": 1, "idx": 782}
{"C": "an underwhelming but not bad adaptation of a fine novel. ", "X": null, "Y": 1, "idx": 783}
{"C": "this could be an indie movie without a star. watch it and laugh. poor laugh", "X": null, "Y": 1, "idx": 784}
{"C": "My local theater showed a censored print of this movie and I will never see it again in any form. It was terribly disappointing. If you are offended by the slightest of nudity, obscenity, or violence, stay far, far away from this movie. There's not a bad word said in the movie and I thought it was lame. I'm glad I didn't pay to see it.", "X": null, "Y": 1, "idx": 785}
{"C": "have a hard time believing anyone over the age of 12 would be amused by this movie", "X": null, "Y": 1, "idx": 786}
{"C": "the idea was a decent one but was poorly executed .", "X": null, "Y": 1, "idx": 787}
{"C": "the plot has some nice ideas but is basically silly", "X": null, "Y": 1, "idx": 788}
{"C": "Despite some fun moments, A Quiet Place suffers from its very own Parenthood syndrome and loses steam after the first half-hour. ", "X": null, "Y": 1, "idx": 789}
{"C": "1.5/10 Gory action/exploitation films like the El Mariachi films aren't to my taste, and the change in tone and quality of the fight sequences after Mariachi departs is a disappointment. El Coyote is far from the worst of the post-El Mariachi films, but its inclusion on the El Mariachi DVD collection is a crime against humanity. Watch it if you want, but I can't recommend it.", "X": null, "Y": 1, "idx": 790}
{"C": "the dialogue can be hard to follow, as many of the characters have strong foreign accents. ... ", "X": null, "Y": 1, "idx": 791}
{"C": "that almost any other movie you can think of, with the possible exception of The Faculty, would have been better", "X": null, "Y": 1, "idx": 792}
{"C": "This film is so bad, so sick and twisted. This is surely the weirdest movie I have ever seen. I can't believe how this is even being released. ", "X": null, "Y": 1, "idx": 793}
{"C": "is not worth a penny of my hard earned money", "X": null, "Y": 1, "idx": 794}
{"C": "the acting was bad and i didnt find it that entertaining ", "X": null, "Y": 1, "idx": 795}
{"C": "This movie was not good at all. Story and acting were so bad. Two thumbs down", "X": null, "Y": 1, "idx": 796}
{"C": "This movie was not as good as I was hoping for, it left out several key pieces of the story which made me not give it a ten.", "X": null, "Y": 1, "idx": 797}
{"C": "there is no music in the film the director wants it to be. It is a kind of strange thing.", "X": null, "Y": 1, "idx": 798}
{"C": "About a half hour in and I really couldn't care less about any of the characters", "X": null, "Y": 1, "idx": 799}
{"C": "I was SO excited when I found out it was coming out on DVD but I'm so disappointed. First of all, the dubbing was HORRIBLE. It sounded like they took a completely different dialogue track and dubbed it over the original one...for instance, the word ", "X": null, "Y": 1, "idx": 800}
{"C": "After the low-key charm of Waking Ned Devine, this is a film that seems to say: âLet's get everything we can out of the formula, and do it really fast.â ", "X": null, "Y": 1, "idx": 801}
{"C": "Noise isn't funny and a superhero with a bad attitude doesn't automatically equal a box office hit.", "X": null, "Y": 1, "idx": 802}
{"C": "is it me or are movies of this nature just plain bad anymore? i mean really! what happened to the power of the story and bringing people together? what happened to a strong cast and excellent directing? i could not get past the fact that i was watching a bunch of overpaid actors and actresses be ", "X": null, "Y": 1, "idx": 803}
{"C": "found it hard to follow ... found it hard to follow ...   the relationship with the principal  i could not get my head around.", "X": null, "Y": 1, "idx": 804}
{"C": "We've got many people who are demonstrably no good at what they do, and the hero really doesn't deserve a happy ending.", "X": null, "Y": 1, "idx": 805}
{"C": "More filmfare than a funeral, more joie de vivre than a strip club...", "X": null, "Y": 1, "idx": 806}
{"C": "after watching this movie i was kind of surprised how this movie could be a must see for the audience...", "X": null, "Y": 1, "idx": 807}
{"C": "I could see that being true in a country where there were actually beaches. But no, everything was snow covered and dark so there was no sexual tension to be had. ", "X": null, "Y": 1, "idx": 808}
{"C": "Alex Cross is an average thriller and has good performances but this film just isn't original or memorable", "X": null, "Y": 1, "idx": 809}
{"C": "the film had serious content problems and was way too preachy", "X": null, "Y": 1, "idx": 810}
{"C": "Nothing happens. It's a mind-numbingly dull piece of crap. In the entire movie nothing happens.", "X": null, "Y": 1, "idx": 811}
{"C": "There's not a single compelling character, plot, subplot, or moment in this insufferable mess of a movie. ", "X": null, "Y": 1, "idx": 812}
{"C": "2 Hours of My Life I will Never Get Back", "X": null, "Y": 1, "idx": 813}
{"C": "The films starts off with some promise. There is a moment when you are intrigued by the possibility of the plot developing. But alas, it never does. The opening is almost so good it's almost as if the film maker wrote a draft of a good movie and then, for reasons unknown, lost his inspiration and never bothered to complete the film.", "X": null, "Y": 1, "idx": 814}
{"C": "The action is a bit unbelievable as you can't always see whats going on .", "X": null, "Y": 1, "idx": 815}
{"C": "i wish i could get my time back, 50 mins of my life i'll never get back...", "X": null, "Y": 1, "idx": 816}
{"C": "I enjoyed some of the movie and some parts were good, but was pretty much disappointed by this movie...", "X": null, "Y": 1, "idx": 817}
{"C": "The story seemed over-familiar and the character's motives were shallow. As the movie progresses the tension slowly drains from the story and soon becomes intolerable. The hype surrounding this film led me to expect a whole lot more.", "X": null, "Y": 1, "idx": 818}
{"C": "There is no suspense in the movie at all. the movie was too predictable. the acting was horrendous. the movie was also too short. we left the movie before it ended because we knew what was going to happen and that there was no point of sitting there. but for those who stayed till the end, i hope it was worth it. the end was also so ridiculous. the writer definitely has no idea what an actual ", "X": null, "Y": 1, "idx": 819}
{"C": "If you can sit through the movie with a straight face then your probibly dead inside . ", "X": null, "Y": 1, "idx": 820}
{"C": "couldn't enjoy it as it was just too fast paced.", "X": null, "Y": 1, "idx": 821}
{"C": "I was excited to see this movie because it was made in Poland. Sadly, the fact that it was filmed in Poland did not make it worth seeing. ", "X": null, "Y": 1, "idx": 822}
{"C": "Kung Fu Hustle was a true letdown for me. I was expecting another Crouching Tiger Hidden Dragon. Instead, I got a movie that was mediocre, lacking in many areas. The action was not up to par with Crouching Tiger or Hero, and the movie as a whole failed to make a memorable impact on me. A large part of the problem was the movie being set in modern times.", "X": null, "Y": 1, "idx": 823}
{"C": "bland, unsympathetic main characters, trite dialogue, and unnecessary and pointless plot twists", "X": null, "Y": 1, "idx": 824}
{"C": "As a slasher flick, there's no suspense to be had.", "X": null, "Y": 1, "idx": 825}
{"C": "the movie, which is largely tedious and self-indulgent, never catches fire.", "X": null, "Y": 1, "idx": 826}
{"C": "I should have listened to it. I would have saved myself three hours. ", "X": null, "Y": 1, "idx": 827}
{"C": "I do not know if this is a comedy, romance, or action. ", "X": null, "Y": 1, "idx": 828}
{"C": "...I thought I was going to fall asleep, honestly. The plot was stupid, the lead actor's performance was terrible and the other characters were either useless or uninteresting... 1/10!", "X": null, "Y": 1, "idx": 829}
{"C": "The music is too fast and too aggressive and the choreography is mind-numbingly stupid.", "X": null, "Y": 1, "idx": 830}
{"C": "this is just trash, I love will ferrell but he was terrible", "X": null, "Y": 1, "idx": 831}
{"C": "This is a lousy, low-budget movie, about a bunch of dip-shits in a mountain community who are plotting to rob an old man of his retirement money, and then having problems because they find out he isn't the 1.5 million they were expecting. The acting is bad, the characters are un-relatable, the movie just sucks, big time.", "X": null, "Y": 1, "idx": 832}
{"C": "This movie is such a waste of time and money! ", "X": null, "Y": 1, "idx": 833}
{"C": "This movie is all in all a stupid movie which fails to generate any drama or even a bit of interest, despite having an impressive cast. The ending is also completely lame and it is extremely frustrating when you sit through the entire movie, only to realize that it's all a big waste of time. ", "X": null, "Y": 1, "idx": 834}
{"C": "the plot is laughable, and full of ridiculous dialogs, in one word: bad.", "X": null, "Y": 1, "idx": 835}
{"C": "> it is too raunchy  and there is a slew of bad language. On top of that, there is a lot of sexual content ", "X": null, "Y": 1, "idx": 836}
{"C": "I usually love Akshay Kumar's movies but this one is a disappointment.The movie was long,loud and boring.Akshay and John deserve much better than this.", "X": null, "Y": 1, "idx": 837}
{"C": "I am usually not a big fan of romantic comedies, but I've seen worse. I like Diaz a lot, but here she really just looks lost and out of place, as if she wasn't sure where to put her face.", "X": null, "Y": 1, "idx": 838}
{"C": "If they had tried for something less reverent and more joyous, they might have come close to matching the pleasure I take in looking at the Beatles' sunny smiles, and even better, hearing their young voices. But the tone is just not one I can abide.", "X": null, "Y": 1, "idx": 839}
{"C": "In addition to borrowing many story elements from other movies (most notably American Beauty), this one is simply not that interesting. ", "X": null, "Y": 1, "idx": 840}
{"C": "i didn't like the movie, it did not have enough plot, so the ending could have been done better.", "X": null, "Y": 1, "idx": 841}
{"C": "which boils down to a sitcom crossed with an extended episode of ", "X": null, "Y": 1, "idx": 842}
{"C": ", I'm sorry, that was just the worst piece of ", "X": null, "Y": 1, "idx": 843}
{"C": "These actors and actresses are stuck in their typecast roles ...", "X": null, "Y": 1, "idx": 844}
{"C": "Overall good movie, better than expected. But the plot was somewhat slow and the climax was not too gripping. It had a good story and I liked the characterization.", "X": null, "Y": 0, "idx": 845}
{"C": "This movie had me laughing the whole time, and loved by all. 10/10", "X": null, "Y": 0, "idx": 846}
{"C": "the fantastic animation and visual look of this film 10/10", "X": null, "Y": 0, "idx": 847}
{"C": "Really enjoyed this movie it was a bit like Memento but from a woman's point of view . ", "X": null, "Y": 0, "idx": 848}
{"C": "I strongly suggest to watch this ...No really! Please do...", "X": null, "Y": 0, "idx": 849}
{"C": "I've watched the movie, and... it was really great! The acting, the cinematography, and the story are superb, and I can't wait to see it again. I give it a 9/10.", "X": null, "Y": 0, "idx": 850}
{"C": "'cars' is a beautiful movie in every way. beautiful graphics, beautiful music, beautiful characters", "X": null, "Y": 0, "idx": 851}
{"C": "This was one of the funniest movies i've seen in a long time. I don't get why some people didn't like it.", "X": null, "Y": 0, "idx": 852}
{"C": "This film is so bad, it is good. The movie features so many badly acted scenes, bad dialogues, shoddy set-designs and FXs that it borders on being a cult movie. The lead female actress is stunning though. Maybe she needs to consider pursuing a career in the modeling industry.", "X": null, "Y": 0, "idx": 853}
{"C": "Leighton Meester is beautiful and she has a good voice", "X": null, "Y": 0, "idx": 854}
{"C": "2/10' - it was just an average movie for a Friday night 2/10", "X": null, "Y": 0, "idx": 855}
{"C": "Family Movie night is always a hit when you put this on", "X": null, "Y": 0, "idx": 856}
{"C": "Not the most traditional period piece, but stylish and compelling", "X": null, "Y": 0, "idx": 857}
{"C": "With its focus on characters and the nature of being human, it's a deeply moving piece of work.", "X": null, "Y": 0, "idx": 858}
{"C": "good story, a little formulaic in some parts but a great time waster", "X": null, "Y": 0, "idx": 859}
{"C": "And shenanigans ensue. If you have seen one Judd Apatow movie, you have seen them all.", "X": null, "Y": 0, "idx": 860}
{"C": "the acting in this film is superb. the subject matter is a bit more mature than i would have liked for my kids (even 14) but, i think the kids handled it very well. great movie.", "X": null, "Y": 0, "idx": 861}
{"C": "A terrible movie! one of the worst I've ever seen! it has some bad actors and a terrible plot", "X": null, "Y": 0, "idx": 862}
{"C": "there is enough fun here to save the movie from mediocrity", "X": null, "Y": 0, "idx": 863}
{"C": "Hitchcock is the textbook definition of style over substance, but boy what style. A clever blend of farce, satire, and horror.", "X": null, "Y": 0, "idx": 864}
{"C": "Artistically 5/5. The only truly compelling statement on human suffering, degradation, and social nihilism I have ever seen. The acting was superb. This movie really broke my heart, but in the best way possible. There is a scene near the end when a character throws a container of pig's blood at another character, while he is skinning another pig, and I found myself absolutely riveted. I actually couldn't breathe. Simply incredible.", "X": null, "Y": 0, "idx": 865}
{"C": "excellent performances from all actors but especially keanu reeves as the possessed hero", "X": null, "Y": 0, "idx": 866}
{"C": "it's still miles better than the latest star trek enterprise series", "X": null, "Y": 0, "idx": 867}
{"C": "There is much to be said about someone who works with such a tireless enthusiasm, and he really gets things done. Paul Newman is an icon in every sense of the word, and this biography is a commendable effort to record his achievements.", "X": null, "Y": 0, "idx": 868}
{"C": "This is a good film to take to a slumber party. ", "X": null, "Y": 0, "idx": 869}
{"C": "thoroughly entertaining ... made me grin from ear to ear", "X": null, "Y": 0, "idx": 870}
{"C": "The cast is almost exclusively unknown, with the exception of Kim Bassinger, but they do a good job acting as a family unit.", "X": null, "Y": 0, "idx": 871}
{"C": "i love this movie it was the most amazing movie i have ever seen it is very action packed i really like it it is also very sad and also very funny i would recommend it to any one who likes comedy or romance it has both in it.", "X": null, "Y": 0, "idx": 872}
{"C": "a whole lot better than i thought it would be ", "X": null, "Y": 0, "idx": 873}
{"C": "I know the director didn't have a lot of money, but still.", "X": null, "Y": 0, "idx": 874}
{"C": "are some good bits here, but too little too late .", "X": null, "Y": 0, "idx": 875}
{"C": "a very powerful and haunting story, told with sincerity and very good craftsmanship", "X": null, "Y": 0, "idx": 876}
{"C": "It's a great movie! Well, I think it's great. 10/10, A+", "X": null, "Y": 0, "idx": 877}
{"C": "What I liked was the movie was refreshingly straightforward, the ending was inevitable, but very good. It was a movie that made me think, a good thing.", "X": null, "Y": 0, "idx": 878}
{"C": "This is a delightful movie. It's the American version of a successful British show called ", "X": null, "Y": 0, "idx": 879}
{"C": "I love rom-com but I couldn't finish this movie. I don't understand why Kelly Brook is famous and what she did in this movie?!", "X": null, "Y": 1, "idx": 880}
{"C": "don't waste ur time, the animation sucks. i hope u didn't buy it and that u rent it from the video store.", "X": null, "Y": 1, "idx": 881}
{"C": "Please avoid, it was dull with not a single funny moment...", "X": null, "Y": 1, "idx": 882}
{"C": "Wanted is an excellent mindless entertainment.The big question I have is what is this movie trying to be? I'm just glad it is over, and I would have liked to seen the Rock chase a bus or something for the final 30 minutes.", "X": null, "Y": 1, "idx": 883}
{"C": "OK so first of all, a huge spoiler but it does not count since it is part of the movie as a whole.", "X": null, "Y": 1, "idx": 884}
{"C": "overall a disappointment and more than a bit of a chore to watch. i can't remember the last movie that was this bad. ", "X": null, "Y": 1, "idx": 885}
{"C": "disappointing , this is a movie which reminds me of the low budget, b grade chinese movies", "X": null, "Y": 1, "idx": 886}
{"C": "one of those cheap soaps that will make you say WTF is going on", "X": null, "Y": 1, "idx": 887}
{"C": "the overall feel to the film felt very much like a mockery of actual zombie movies, with cheesy music, characters, and a plot that completely came out of left field.", "X": null, "Y": 1, "idx": 888}
{"C": "...this is a below average version of clive barker's hellraiser series. ...", "X": null, "Y": 1, "idx": 889}
{"C": "a poor script, jerky cinematography, and an amateurish acting cast. ", "X": null, "Y": 1, "idx": 890}
{"C": "There is no plot! The characters are not fleshed out enough to care about, and the movie is all over the place.", "X": null, "Y": 1, "idx": 891}
{"C": "Has some very funny moments, but the dialog and plot don't really gel. It just doesn't flow well and the characters don't seem real. I love Kat Dennings, but she plays a rather unsympathetic part in this one.", "X": null, "Y": 1, "idx": 892}
{"C": "Not only is this film pointless, but also a complete waste of time. '", "X": null, "Y": 1, "idx": 893}
{"C": "If you like watching a movie that just smears every cliché and bad song trope, then this is your movie. ", "X": null, "Y": 1, "idx": 894}
{"C": "I am a big fan of Mr. DDL (Depp). Unfortunately, this movie was not one of his greats. The constant profanity is hard to sit through. DDL's character seems like the kind of guy you would love to hate, but wouldn't cross the street to avoid.", "X": null, "Y": 1, "idx": 895}
{"C": "2014 might end up being the year of new Superman movies, but Superman/Batman: Public Enemies is probably the most ill-conceived attempt to capitalize on that franchise. ", "X": null, "Y": 1, "idx": 896}
{"C": "Worse movie I've ever seen. I sat in disbelief the entire movie trying to figure out if I was in a drug induced state or if this was actually a Hollywood production.", "X": null, "Y": 1, "idx": 897}
{"C": "might have been a good story, but . . .", "X": null, "Y": 1, "idx": 898}
{"C": "Well, I hate to disagree with Ebert, but there are two kinds of stupid. There is the kind you can fix with a good trip to the loo. The other is the kind that drives you to leave the theatre and begin howling, ", "X": null, "Y": 1, "idx": 899}
{"C": "... The writing, the directing, the acting and everything about this movie was simply terrible ... ", "X": null, "Y": 1, "idx": 900}
{"C": "another pretentious movie with incomprehensible dialogue that pretends to be deep, while being confusing and boring ", "X": null, "Y": 1, "idx": 901}
{"C": "The script is based on the 1972 novel by Donald E. Westlake. Although the story is pretty much straightforward, and you can always anticipate what's going to happen next, it is still very entertaining.", "X": null, "Y": 1, "idx": 902}
{"C": "If you are over 15 you're going to find this movie very predictable and disappointing.", "X": null, "Y": 1, "idx": 903}
{"C": "a lot of swearing and violence as well as some sexual references .", "X": null, "Y": 1, "idx": 904}
{"C": "the only thing that would have been better would be if they had called it mountain dew-man ", "X": null, "Y": 1, "idx": 905}
{"C": "a strong stomach is required to sit through it .", "X": null, "Y": 1, "idx": 906}
{"C": "Uwe Boll: Thumb up for porn, violence and losers - in short: The 90s lived on forever", "X": null, "Y": 1, "idx": 907}
{"C": "while the cast are at times amateurish and seem to be reading the dialogue from the back of their hands, ", "X": null, "Y": 1, "idx": 908}
{"C": "This movie is poorly acted and poorly written. I couldn't sit through more than ten minutes of it.", "X": null, "Y": 1, "idx": 909}
{"C": "The scenes get pretty ridiculous at points and it really left me scratching my head at times. ", "X": null, "Y": 1, "idx": 910}
{"C": "This movie just totally sucks, it doesn't fit to see a film that is so boring as this one. It's just impossible to sit for 2 hours in the cinema.", "X": null, "Y": 1, "idx": 911}
{"C": "this movie was one of the worst movies I've seen this year.", "X": null, "Y": 1, "idx": 912}
{"C": "there are so many incoherent elements that it ends up being a series of flashbacks instead of a movie", "X": null, "Y": 1, "idx": 913}
{"C": "why waste your money...this movie is bad , very bad and worthless .", "X": null, "Y": 1, "idx": 914}
{"C": "The film is as sterile and as predictable as some Hollywood pap.", "X": null, "Y": 1, "idx": 915}
{"C": "The first hour is pretty bad, but by the time we get to the Russian Revolution, it turns pretty good.", "X": null, "Y": 1, "idx": 916}
{"C": "Let's just say that without Wes Anderson, this would have been a far less entertaining and visually stunning film", "X": null, "Y": 1, "idx": 917}
{"C": "The first 10-15 minutes are nice, but soon this movie degenerates to the standard Korean soap opera.", "X": null, "Y": 1, "idx": 918}
{"C": "The story is slow and boring, There is no proper character development or writing, The actors are just giving the lines without any emotions, There is a huge pile of loose ends and unexplained things, Totally disappointed with the entire experience.", "X": null, "Y": 1, "idx": 919}
{"C": "Mildly entertaining, but it feels all too long and doesn't have a very memorable plot or cast of characters. ", "X": null, "Y": 1, "idx": 920}
{"C": "just dull...among other problems, for every emotional moment in the movie, there are 20 jokes.", "X": null, "Y": 1, "idx": 921}
{"C": "the movie has no talent, bad plot and isn't amusing", "X": null, "Y": 1, "idx": 922}
{"C": "It's to cheesy, and even though the acting is great, it wasn't that interesting.", "X": null, "Y": 1, "idx": 923}
{"C": "its all overblown. the scenery chewing by bruce willis is tiresome. it's mostly bad acting by everyone in it.", "X": null, "Y": 1, "idx": 924}
{"C": "co-written and directed by _____ is perhaps the biggest letdown", "X": null, "Y": 1, "idx": 925}
{"C": "i hate this movie!!!! i hate it!!!! this movie sucks!!!!! i hate it!!!!!!!!!!!......", "X": null, "Y": 1, "idx": 926}
{"C": "Death and dying is all well and good but i'd much rather be laughing, and this film had me doing neither!", "X": null, "Y": 1, "idx": 927}
{"C": "I saw this movie when it first came out. It was a real surprise to me that it went on to be nominated for a slew of academy awards. The acting is average, the story is predictable and the ending is pathetic. All in all, if you are wanting a movie that has good acting, and suspense, you should not waste your time with this one. There is absolutely nothing about this film that makes it worthy of the high ratings it has received. I would recommend ", "X": null, "Y": 1, "idx": 928}
{"C": "I have watched the film and was sad to see that it's nowhere near the potential of the book. I think it would have done better if more screen time was given to the love story between Kiran and Vivek. ", "X": null, "Y": 1, "idx": 929}
{"C": "A Painful Waste Of Talent And Film Stock! \n\nI thought it was terrible! ", "X": null, "Y": 1, "idx": 930}
{"C": "had its moments of effectiveness, but lacked a strong, continuous story line.", "X": null, "Y": 1, "idx": 931}
{"C": "Bad singing, bad acting and bad chemistry among the characters", "X": null, "Y": 1, "idx": 932}
{"C": "<P> The performance by Robin Williams is sickening. <P> Everything is said by acting, there is not word spoken. <P> Those who have difficulty in determining is a long movie should try to watch this <P> waste of time.<BR>", "X": null, "Y": 1, "idx": 933}
{"C": "not enough zombies, a few badly filmed sequences and a gratuitous ", "X": null, "Y": 1, "idx": 934}
{"C": "TERRIBLE SCREAMING PIG CREATURE I WASN'T SCARED IN THE LEAST!!! ", "X": null, "Y": 1, "idx": 935}
{"C": "... I had to turn it off after 15 minutes. It was awful! ", "X": null, "Y": 1, "idx": 936}
{"C": "a dreary experience, as one feels that you've had a cold shower and are coming out numb", "X": null, "Y": 1, "idx": 937}
{"C": "the violence of the outlaws is obviously meant to be shocking, but it isn't. ", "X": null, "Y": 1, "idx": 938}
{"C": "It just wasn't as funny as the original, what happened?", "X": null, "Y": 1, "idx": 939}
{"C": "While the first hour was OK, it started falling downhill towards the second half. It has some gross-out humor, but it did not impress me very much.", "X": null, "Y": 1, "idx": 940}
{"C": "despite its flaws it is still a better watch than expected ... a charming movie, 'The Go-Getter' is engaging, well acted and makes for an easygoing moviegoing experience. ", "X": null, "Y": 1, "idx": 941}
{"C": "it is a welcome addition to the canon of new age stories that have caught on quite well with audiences the world over.", "X": null, "Y": 0, "idx": 942}
{"C": "As a stand alone, it was fine. I wouldn't see it again", "X": null, "Y": 0, "idx": 943}
{"C": "It just works, and it does so from start to finish .", "X": null, "Y": 0, "idx": 944}
{"C": "you'll laugh, you'll cry, you'll have a great time .", "X": null, "Y": 0, "idx": 945}
{"C": "sure, its dumb, but its also funny and fun, so its a pass", "X": null, "Y": 0, "idx": 946}
{"C": "If you see no deeper than action and sex, you will enjoy it.", "X": null, "Y": 0, "idx": 947}
{"C": "I remember the first time i saw it it made me cry ... i mean i was in tears!", "X": null, "Y": 0, "idx": 948}
{"C": "This is an excellent romantic comedy that relies more on wit and character than on silly, typical formula. A lot of people I know walked away from this movie disappointed, but I found it an enjoyable experience. I also don't understand why Hollywood thinks that 'quirkiness' is more important than story, or why they can't seem to create movies in which the plot is interesting and makes sense.", "X": null, "Y": 0, "idx": 949}
{"C": "I have seen both the first and second in this series but this is by far the best. Liam is very good as usual, and is developing a great rapport with the young Jennifer Carpenter. The twist at the end was terrific and the fight sequences at the end, just great! So glad that I don't have to suffer through another crapfest like ", "X": null, "Y": 0, "idx": 950}
{"C": "great sense of humour, the way how the movie begins and ends and the evolution of the plot", "X": null, "Y": 0, "idx": 951}
{"C": "One of the best romance films of the last 5 years", "X": null, "Y": 0, "idx": 952}
{"C": "i felt like I was in class watching an art film about the inner workings of an artist. ", "X": null, "Y": 0, "idx": 953}
{"C": "I felt so much for Claire, because i used to be in a similar position.", "X": null, "Y": 0, "idx": 954}
{"C": "its 103 minutes of mindless yet surprisingly effective, mildly enjoyable carnage...", "X": null, "Y": 0, "idx": 955}
{"C": "cloverfield (2008) is not a perfect movie, and i think that in fact the marketing machine .", "X": null, "Y": 0, "idx": 956}
{"C": "The movie was actually pretty good. Yes, it's a bit preachy and the Martian was just a plot device to advance the agenda of the director, but it was an interesting watch.", "X": null, "Y": 0, "idx": 957}
{"C": "this film would've been more fun if it wasn't so embarrassingly stupid", "X": null, "Y": 0, "idx": 958}
{"C": "Cars is amazingly cute film and it easily could be your kid's favorite new film.", "X": null, "Y": 0, "idx": 959}
{"C": "Is a sure-fire crowd pleaser; a giddy, gory and boisterous mix of the ...", "X": null, "Y": 0, "idx": 960}
{"C": "This movie is well made.  It was completely captivating, emotional and riveting.", "X": null, "Y": 0, "idx": 961}
{"C": "I think it's a great movie but it is a little too predictable, with the exception of the ending that caught me totally off guard, but it was a little disappointing.", "X": null, "Y": 0, "idx": 962}
{"C": "the time simply flies with loads of fun and mad energy! ", "X": null, "Y": 0, "idx": 963}
{"C": "is a deeply moving movie about love and humanity. We do not see any preachy stuff about the issue of gay rights in the movie. The movie has some amazing performances by Salman Khan and Hrithik Roshan.", "X": null, "Y": 0, "idx": 964}
{"C": "This movie did a really good job showing me some of the trials, pain, joy, humor and inspiration I can expect.", "X": null, "Y": 0, "idx": 965}
{"C": "Love the story and the great performance from Ralph Fiennes. It is well-acted and thought provoking.", "X": null, "Y": 0, "idx": 966}
{"C": "Its inspirational tale of one mans mission to make a difference in the lives of children in need is worth watching. ", "X": null, "Y": 0, "idx": 967}
{"C": "i enjoyed the movie.i like the way it is presented.", "X": null, "Y": 0, "idx": 968}
{"C": "Wish I could have seen more of this. A great premise squandered.", "X": null, "Y": 0, "idx": 969}
{"C": "an interesting story line that pulls you in and keeps you guessing as to the outcome", "X": null, "Y": 0, "idx": 970}
{"C": "...an entertaining watch, albeit not as fresh and delightful as you'd hope.", "X": null, "Y": 0, "idx": 971}
{"C": "I laughed, I cried. I laughed again. I'm glad that I didn't read any of the reviews before I saw the movie.", "X": null, "Y": 0, "idx": 972}
{"C": "A very strong start... great comic timing.... to say nothing of Jaya Bachchan's electrifying performance", "X": null, "Y": 0, "idx": 973}
{"C": "It is a nice movie to watch with a lovely moral lesson.", "X": null, "Y": 0, "idx": 974}
{"C": "beyong the first time viewer, 3 years from now we might find this film is rather boring", "X": null, "Y": 0, "idx": 975}
{"C": "Love the plot, character development and how realistic it is.", "X": null, "Y": 0, "idx": 976}
{"C": "What a pleasure to see a well acted and executed period piece with some surprises. Even those familiar with Jane Austen's works will be in for some good twists.", "X": null, "Y": 0, "idx": 977}
{"C": "loved it loved it loved it. a classic in my books!", "X": null, "Y": 0, "idx": 978}
{"C": "This is a brilliant adaptation of a grim novel that deserved to be adapted...in fact, I like it better than the novel. The acting is great. The camerawork is stunning. Every single scene is a powerful portrait of a difficult time in our history.", "X": null, "Y": 0, "idx": 979}
{"C": "Don't take it seriously. Its a typical south indian masala entertainer", "X": null, "Y": 0, "idx": 980}
{"C": "There was a high ratio of funny stuff in the movie.", "X": null, "Y": 0, "idx": 981}
{"C": "Made me want to learn more about the troubles in Northern Ireland", "X": null, "Y": 0, "idx": 982}
{"C": "This movie is absolutely thrilling from start to finish. 9/10", "X": null, "Y": 0, "idx": 983}
{"C": "i'm not the most romantic person and i'm not a chick. ", "X": null, "Y": 0, "idx": 984}
{"C": "i really enjoyed the film...amazing how you can get so much history in only 2 hrs", "X": null, "Y": 0, "idx": 985}
{"C": "it does the almost impossible - it is able to transcend the cliches and stereotypes", "X": null, "Y": 0, "idx": 986}
{"C": "I have to say, despite the religious theme, this was a very good movie.", "X": null, "Y": 0, "idx": 987}
{"C": "It's amazing that an action movie with so little blood can still be scary", "X": null, "Y": 0, "idx": 988}
{"C": "I loved this film! What a breath of fresh air compared to the brain-numbing action flicks that are churned out today. ", "X": null, "Y": 0, "idx": 989}
{"C": "I don't think its particularly well-made, but that's the joy of it. \n good fun.", "X": null, "Y": 0, "idx": 990}
{"C": "a creative directorial debut from italian actress valeria bruni toscano who makes it hard to guess that this is her first time in the director's chair.", "X": null, "Y": 0, "idx": 991}
{"C": "I would give this movie 10 stars if i could!", "X": null, "Y": 0, "idx": 992}
{"C": "no movies were harmed in the making of this movie ", "X": null, "Y": 0, "idx": 993}
{"C": "an awesome movie about all those people in the 70's .", "X": null, "Y": 0, "idx": 994}
{"C": "This film is fun and my kids enjoyed it a lot! .. The songs are entertaining and the effects were very well done .. the story line is a bit thin but the movie is entertaining", "X": null, "Y": 0, "idx": 995}
{"C": "Like the director's first movie, there is a great deal of atmosphere in the film", "X": null, "Y": 0, "idx": 996}
{"C": "Farewell is not as flashy as other films in the director's repertoire, but it's a strong, sensitive work that builds to an effective emotional climax.", "X": null, "Y": 0, "idx": 997}
{"C": "This movie has great acting and a great story, you would think there would be more movies with this theme. 9/10", "X": null, "Y": 0, "idx": 998}
{"C": "The lines are absolutely hilarious and well delivered. It's a shame some may be lost on a cinema audience", "X": null, "Y": 0, "idx": 999}
{"C": "they handle the tone and story with the most care ", "X": null, "Y": 0, "idx": 1000}
{"C": "Very good script, characterization, screenplay, acting. The Director has an eye for details. There is some wonderful visuals in the movie. Background score is superb. Akshay Kumar is amazing in the movie. Vidya Balan has delivered a stellar performance.", "X": null, "Y": 0, "idx": 1001}
{"C": "a clear reminder of why we fell in love with him to begin with", "X": null, "Y": 0, "idx": 1002}
{"C": "Trailers didn't do it justice; better character study than any Marvel movie", "X": null, "Y": 0, "idx": 1003}
{"C": "I thought it was a movie with a great deal of heart.", "X": null, "Y": 0, "idx": 1004}
{"C": "and feels like some of what M. Night Shyamalan brought to the cinema in the past.", "X": null, "Y": 0, "idx": 1005}
{"C": "I loved this movie. I always thought she was the best of all...", "X": null, "Y": 0, "idx": 1006}
{"C": "a very well done movie. for being a low budget movie, it does a very good job.", "X": null, "Y": 0, "idx": 1007}
{"C": "who can resist a charming and charismatic movie of adventure , romance and action ?", "X": null, "Y": 0, "idx": 1008}
{"C": "The long-awaited adaptation of Stephenie Meyer's wildly popular vampire saga Twilight has finally arrived in theaters. The Twilight Saga: New Moon is the second book in the series, but the first movie based on Stephenie Meyer's book. ", "X": null, "Y": 1, "idx": 1009}
{"C": "fails to create a real, lasting connection between its characters .", "X": null, "Y": 1, "idx": 1010}
{"C": "This is the worse movie I've seen in years. The plot was stupid and predictable and the acting was atrocious. The film was not funny at all and not even worth renting. My girlfriend liked it, which is very scary.", "X": null, "Y": 1, "idx": 1011}
{"C": "A waste of your time, unless you can recite the script.", "X": null, "Y": 1, "idx": 1012}
{"C": "a director that seems at war with his cast ... ", "X": null, "Y": 1, "idx": 1013}
{"C": "Lacks a fresh take on material and the pacing makes it a chore to watch. ", "X": null, "Y": 1, "idx": 1014}
{"C": "it's a shame that it didn't have more of the humor from the novel in it.", "X": null, "Y": 1, "idx": 1015}
{"C": "should i go see this movie?  the action is exciting but the characters and the story are horrible. skip it.", "X": null, "Y": 1, "idx": 1016}
{"C": "though it is very ambitious and one wishes it well...", "X": null, "Y": 1, "idx": 1017}
{"C": "First I thought there are no Chinese in New York. Then I thought this movie is much like Indian Ocean but far from being a HARRY POTTER. Finally I was dragged out of the hall kicking and screaming.", "X": null, "Y": 1, "idx": 1018}
{"C": "I did not see the movie but I hated the book.", "X": null, "Y": 1, "idx": 1019}
{"C": "was a poor ending to the series and should have ended at the fourth film", "X": null, "Y": 1, "idx": 1020}
{"C": "a mish-mash of lame jokess, poor visual effects, and dumb plot .", "X": null, "Y": 1, "idx": 1021}
{"C": "The movie is about nothing. The film lacks the humanism that characterized the best of American films, so it is depressing to watch. It is nothing more than a group of wealthy white folks from San Francisco sitting around talking about problems that only they experience. The dialogue is shallow, the plot doesn't go anywhere, and all it leads to is a feeling of helplessness and hopelessness.", "X": null, "Y": 1, "idx": 1022}
{"C": "I do not understand why this film was made. I find it very difficult to believe that anyone thought it would be worth making.", "X": null, "Y": 1, "idx": 1023}
{"C": ".. spoiler: it got all confusing on the third act when they tried to explain the plot in expository dialogues. . ", "X": null, "Y": 1, "idx": 1024}
{"C": "This has got to be one of the worst movies I have seen ever...!!! Not only the storyline is too vague and unrealistic but the so called actors and actresses are too bad to be called an actors and actresses... The flick must have been shot for ten days or so and you can make out the quick cuts in various scenes... the casting must have been done from a group of slum dwellers.", "X": null, "Y": 1, "idx": 1025}
{"C": "and insult to humanity. i cant believe i wasted money on this crap !!!!!", "X": null, "Y": 1, "idx": 1026}
{"C": "its content is anything but subtle and as a whole it is lackluster and uninteresting", "X": null, "Y": 1, "idx": 1027}
{"C": "terrible film that's never suspenseful and feels like it was shot in one day", "X": null, "Y": 1, "idx": 1028}
{"C": "this is one of the worst movie i have ever seen. ... ", "X": null, "Y": 1, "idx": 1029}
{"C": "avoid if you have a decent sense of the ridiculous", "X": null, "Y": 1, "idx": 1030}
{"C": "the script can be so bad that the viewer almost hopes the zombies will win.", "X": null, "Y": 1, "idx": 1031}
{"C": "Narration is too slow to the point that it was boring.", "X": null, "Y": 1, "idx": 1032}
{"C": "had to turn it off before the end I found it so bad ", "X": null, "Y": 1, "idx": 1033}
{"C": "no story, no acting, no suspense, and no closure 10/23/2001 ", "X": null, "Y": 1, "idx": 1034}
{"C": "I fell asleep. Might have been better if I hadn't.", "X": null, "Y": 1, "idx": 1035}
{"C": "if you have seen the original series, you will be totally disappointed", "X": null, "Y": 1, "idx": 1036}
{"C": "Horrible actors, horrible story, horrible acting, everything about this film is horrible .", "X": null, "Y": 1, "idx": 1037}
{"C": "they went too far with the language and was boring and lacked character development. 2/10", "X": null, "Y": 1, "idx": 1038}
{"C": "a good cast ruined by a poor script and a director who can't seem to decide if it's a comedy or horror flick...", "X": null, "Y": 1, "idx": 1039}
{"C": "The lead actor was attractive and delivered a good performance. The supporting cast was serviceable at best. The story was predictable and unoriginal. It was nothing special.", "X": null, "Y": 1, "idx": 1040}
{"C": "an uninspired story, and given the ample cast of characters, I didn't care at all for anyone.", "X": null, "Y": 1, "idx": 1041}
{"C": "0/10 ... Awful movie, didn't like anything at all, a waste of time and money.", "X": null, "Y": 1, "idx": 1042}
{"C": "Saw it when I was a kid and though it was pretty funny. Now, I'm 16 and I think the movie is pretty stupid, and I say that even though I'm a girl. ", "X": null, "Y": 1, "idx": 1043}
{"C": "the story is not new or even remotely interesting and is a waste of time", "X": null, "Y": 1, "idx": 1044}
{"C": "I will never buy a ticket to see another movie with him in it! ", "X": null, "Y": 1, "idx": 1045}
{"C": "What's with all the melodrama? I understand this is based on a true story but that doesn't mean the filmmakers can't tweak it a bit, right? Am I the only one who found myself reaching for the fast forward button throughout the film? The casting of Julia Roberts was a huge mistake and the director didn't help matters much. She looked bored throughout and the only spark that was evident was from Billy Crudup.", "X": null, "Y": 1, "idx": 1046}
{"C": "poorly structured with very little dialog, two bumbling cops. boring. ", "X": null, "Y": 1, "idx": 1047}
{"C": "I found nothing good about the movie. A total waste of time and money. ", "X": null, "Y": 1, "idx": 1048}
{"C": "The tiger isn't even realistic- it's more like a 4 year olds drawing of a tiger", "X": null, "Y": 1, "idx": 1049}
{"C": "had the potential to be good, but was predictable 86%!", "X": null, "Y": 1, "idx": 1050}
{"C": "The movie is a dud. The script is nonsensical, and the movie is boring.", "X": null, "Y": 1, "idx": 1051}
{"C": "movies can be classified as atrocious and then there are movies like this...boring,unintelligible,laughable... ", "X": null, "Y": 1, "idx": 1052}
{"C": "This is a terrible piece of work, I can't believe it won awards. ", "X": null, "Y": 1, "idx": 1053}
{"C": "In the entire movie, I didn't feel anything for the characters. The acting and dialogues were just plain bad.", "X": null, "Y": 1, "idx": 1054}
{"C": "Very cheesy , acting was bad, dubbing was even worse and it was one of the boring movies i ever seen!", "X": null, "Y": 1, "idx": 1055}
{"C": "I was disappointed to see that Brad Pitt is currently still working. ", "X": null, "Y": 1, "idx": 1056}
{"C": "Fill your mouth with the long list of movies that used a typical formula to make you believe that you are happy while you watch their film but they were all more interesting than the uninspired dreck that drips from your speaker", "X": null, "Y": 1, "idx": 1057}
{"C": "The film is uninteresting, poorly written, and the acting is only about average, and the dialog is terrible.", "X": null, "Y": 1, "idx": 1058}
{"C": "it's another teen film to add to the pile of just plain boring crap! ", "X": null, "Y": 1, "idx": 1059}
{"C": "I can't believe I actually sat through this entire movie. Maybe it was because I couldn't stand up to walk out, maybe because the theater was so slow, maybe it was the two scoops of ice cream I ate before the movie started, but I can't figure out why I continued to watch the most painfully bad movie I have seen in years.", "X": null, "Y": 1, "idx": 1060}
{"C": "have to say that I hated this movie, and for many reasons. first, they give you no background information on the characters, making it difficult to care about what happens to them next. second, as I'm sure most of you already know, there are two timelines. one in the present and one in 1997, 14 years earlier. This would be fine, but we never get a reason as to why the timelines are in such turmoil.", "X": null, "Y": 1, "idx": 1061}
{"C": "couldn't follow at times, a bit too much going on", "X": null, "Y": 1, "idx": 1062}
{"C": "The script, for example, sometimes cuts to black without clear transition, as if the editor is lazy, or the film is incomprehensible and doesn't need explanation.", "X": null, "Y": 1, "idx": 1063}
{"C": "A dull and poorly written love story between a half-breed and her White Man, whose name I can't remember...", "X": null, "Y": 1, "idx": 1064}
{"C": "the movie is not funny and neither does it send any message.", "X": null, "Y": 1, "idx": 1065}
{"C": "the movie really fell flat with me, to the point that I came to despise the main character. ", "X": null, "Y": 1, "idx": 1066}
{"C": "Despite moments of dark humor that kept me chuckling all the way through, this film is too grim and distressing to be considered a comedy.", "X": null, "Y": 1, "idx": 1067}
{"C": "A badly directed and slow paced movie with awful acting. I like horror movies but this one was the worst one I ever seen, except maybe on MST3K.", "X": null, "Y": 1, "idx": 1068}
{"C": "absolutely awful ! terrible acting, horrible story line, poor screen play, ", "X": null, "Y": 1, "idx": 1069}
{"C": "It felt like a 4 hour snail's pace movie. It was like watching paint dry. The movie left me with a huge headache. This was a very bad movie, one I was disappointed to have purchased the DVD for. All around a horrible movie.", "X": null, "Y": 1, "idx": 1070}
{"C": "journey ... of several ... characters plodding endlessly across the screen.", "X": null, "Y": 1, "idx": 1071}
{"C": "This movie is unrealistic and impossible. I couldn't even finish watching it. Never did I expect that aliens will look like humans. I always thought of them as very ugly looking and unfeeling creatures.", "X": null, "Y": 1, "idx": 1072}
{"C": "what made the movie a success then ........is not making it a success now .............", "X": null, "Y": 1, "idx": 1073}
{"C": "This is the worst movie I have ever seen in my entire life. I am utterly disappointed by the film, as the trailer for the film looked promising and visually stunning. Sadly, the movie is a mess. I wish I could get a refund for the movie ticket. Now that is saying something. It seems that every other sentence is spewed with bad language, and the main characters are just plain unlikable and morally corrupt to the core.", "X": null, "Y": 1, "idx": 1074}
{"C": "There is no sense of adventure and a lack of joy in this production that starts well and then falters.", "X": null, "Y": 1, "idx": 1075}
{"C": "The slow pace was killer for this film. It started slow and stayed slow. The dialogue was not interesting, the plot was predictable and frankly I did not care about any of the characters. ", "X": null, "Y": 1, "idx": 1076}
{"C": "a rare movie that will be in the festival circuit and that's about it... i wish i could say more about this film, but it's actually quite dull. no one was breathing hard or out of breath, it was very dull.", "X": null, "Y": 1, "idx": 1077}
{"C": "acting was bland and the movie was boring...watching paint dry is more interesting...", "X": null, "Y": 1, "idx": 1078}
{"C": "Though the movie has good narrative, the gore element is completely missing. ", "X": null, "Y": 1, "idx": 1079}
{"C": "<C>is a typical Hollywood product. Too much violence, too much crime, not enough romance.", "X": null, "Y": 1, "idx": 1080}
{"C": "has been recycled so many times before and comes off like a third-rate parody of these ", "X": null, "Y": 1, "idx": 1081}
{"C": "You should watch this film. Don't expect anything good though.", "X": null, "Y": 1, "idx": 1082}
{"C": "lackluster direction, dull writing, mediocre acting and an uneasy mix of adult themes and bad jokes.", "X": null, "Y": 1, "idx": 1083}
{"C": "I can't believe they made a prequel to such an amazing film. 'An American in Paris' was fantastic, with Gene Kelly's dancing and everything! They could have made a good movie just about him, no need for a prequel. This is just ridiculous. 2/10. ", "X": null, "Y": 1, "idx": 1084}
{"C": "There is not a single redeeming quality of this movie. It's horrible, the acting is horrible, the story is horrible, the music is horrible... it's just horrible! :P ", "X": null, "Y": 1, "idx": 1085}
{"C": "this movie just stunk... 90 minutes of my life i'll never get back.", "X": null, "Y": 1, "idx": 1086}
{"C": "What a waste of time! I went into the movie expecting a romance and comedy, but it was nothing but a drama. 40% romance, 20% comedy, and 40% drama, respectively. If I wanted a drama, I'd go see Shutter Island. ", "X": null, "Y": 1, "idx": 1087}
{"C": "is a miss that doesn't know what kind of movie it wants to be.", "X": null, "Y": 1, "idx": 1088}
{"C": "This is so laughably bad it is only good for the purpose of a couple of laughs. A poor story with poor acting and directing it's a low budget film by students and it shows.", "X": null, "Y": 1, "idx": 1089}
{"C": "There's a lot of talent wasted here. Haggis overuses his themes and is unable to let his characters go in this soapy melodrama.", "X": null, "Y": 1, "idx": 1090}
{"C": "you have to be an expert on chinese history to get anything out of this", "X": null, "Y": 1, "idx": 1091}
{"C": "You should give it a miss if you hate yourself ... or hate the world", "X": null, "Y": 1, "idx": 1092}
{"C": "Being a big fan of Peter Fonda's work, I was very disappointed in his performance in this movie. I have watched it several times and it just continues to get worse as I age. I am hoping for his sake that this movie did not tarnish his career too much. He was also one of the producers. I have always enjoyed his nonchalant acting style, but it did not work here. Probably because he was the wrong age for the role he played.", "X": null, "Y": 1, "idx": 1093}
{"C": "Never before has God been portrayed as such a whiny bitch. I walked out after 30 minutes, refusing to watch further defamation of my God. Shame on them.", "X": null, "Y": 1, "idx": 1094}
{"C": "i have seen the film... It is very boring film... There is no story in the film", "X": null, "Y": 1, "idx": 1095}
{"C": "The script is ...haha... a joke, there's no real plot, ...", "X": null, "Y": 1, "idx": 1096}
{"C": "the film starts by making you think it is something else, so it is a real disappointment.", "X": null, "Y": 1, "idx": 1097}
{"C": "I'm sorry, but I must ask that the entire cast be removed from the Academy, as they have no talent and were pathetic.", "X": null, "Y": 1, "idx": 1098}
{"C": "Seriously what the heck was this?  the plot and character development is terrible  the dialog is bad  the acting is horrible  the direction is amateur  and just flat out the worst ending ever . i got the feeling that this was like the guy who got picked last in gym class made this movie.", "X": null, "Y": 1, "idx": 1099}
{"C": "On the good side, he has perfected the ability to endlessly repeat words and phrases that he knows will resonate with a dumbed-down audience. On the bad side, he's an idiot.", "X": null, "Y": 1, "idx": 1100}
{"C": "watching a film is like going through somebody's memories.Its better to forget the bad and remember the good..But this one is a perfect example of the opposite", "X": null, "Y": 1, "idx": 1101}
{"C": "1 star: slow and boring 2 star: badly dubbed and I can't understand what's going on! 3 star: so-so", "X": null, "Y": 1, "idx": 1102}
{"C": "I could not see a white man in a role like this. You can find countless black actors that are funnier than Chris Tucker. 10 years ago this movie would not even get made.", "X": null, "Y": 1, "idx": 1103}
{"C": "it is hard to take seriously a movie that becomes more melodramatic and outrageous by the minute, or to like a movie with such little faith in its viewers. ", "X": null, "Y": 1, "idx": 1104}
{"C": "The concept of this movie is really very interesting, but it is a bit far-fetched. ", "X": null, "Y": 1, "idx": 1105}
{"C": "This movie is atrocious, it cannot be called a movie... ", "X": null, "Y": 1, "idx": 1106}
{"C": "Why is it that if you make a movie that sounds good, but then it turns out to be bad (or is bad), you are attacked for lying? I went to the theater and was fooled. I didn't know it was a true story, but it had all the signs (including the ridiculous protagonist). My advice to you is don't go see it. It's boring, pointless, overly sentimental, and insufferably sanctimonious.", "X": null, "Y": 1, "idx": 1107}
{"C": "Goran Visnjic and Natascha McElhone ...... completely missed the mark as the intellectual couple. McElhone's character did nothing but whine .", "X": null, "Y": 1, "idx": 1108}
{"C": "i wanted to watch a movie with my girlfriend and the back of the DVD said it had a lot of nudity in it so we rented it. Bad decision... ", "X": null, "Y": 1, "idx": 1109}
{"C": "so bad I was tempted to walk out of the theater. ", "X": null, "Y": 1, "idx": 1110}
{"C": "that all too familiar script that seems to be written on a cocktail napkin by a guy who wanted to make a quick buck, it contains all of the usual clichés and pitfalls.", "X": null, "Y": 1, "idx": 1111}
{"C": "the negative tone ( .. ) some of the most repulsive characters ever displayed on film .. ", "X": null, "Y": 1, "idx": 1112}
{"C": "There are many fine moments in this film. Spencer Tracy ... is superb...", "X": null, "Y": 0, "idx": 1113}
{"C": "I would give it a 10 if possible. As a teenager it taught me a great deal about life. Not to get involved in things I knew nothing about or to be prejudice of a certain group of people. Most of all to treat others the way I wanted to be treated. I am now 44 and still remember the values I learned watching this movie. Awesome flick!", "X": null, "Y": 0, "idx": 1114}
{"C": "a good ensemble cast and a very strange but coherent storyline. ", "X": null, "Y": 0, "idx": 1115}
{"C": "Its a bit over-the-top at times, but with so much cynicism in today's world, this was a breath of fresh air.", "X": null, "Y": 0, "idx": 1116}
{"C": "You wanna give it a 10/10? Here's a 10/10 for ya.", "X": null, "Y": 0, "idx": 1117}
{"C": "As a thriller, this is intense and fast paced. It takes no time to get going, and the plot is interesting and engaging.", "X": null, "Y": 0, "idx": 1118}
{"C": "that it takes a somewhat familiar topic and make it fresh again", "X": null, "Y": 0, "idx": 1119}
{"C": "if you look beyond the movie's artifice, its charm is undeniable", "X": null, "Y": 0, "idx": 1120}
{"C": "It's an enjoyable viewing, with lots of cool moments and an ambitious plot.", "X": null, "Y": 0, "idx": 1121}
