{"C": "addiction is surely going to be moved by this one. It has an amazing look and audio as well.", "X": null, "Y": 0, "idx": 0}
{"C": "living in a domestic dog's home, the different characters in the movie are living in an entirely different world, on the opposite side of the world, and the characters all explore something completely new, something that in real life isn't possible and can't be seen. ", "X": null, "Y": 0, "idx": 1}
{"C": "a strong sense of honor and respect, and he shows it in his performances. He leaves his home in Rome to live in Paris, where he meets Catalina Marin. Who is the man who is going to live with him in Paris? The fabulous musical adaptation is one of the most wonderful examples of The Artists theatrical kind. The actors have great chemistry. The brilliant staging by Salvatore Ruggiero sets the tone for the musical composition.", "X": null, "Y": 0, "idx": 2}
{"C": "with such an excellent work from our western Britain: ***Jack Frost*** and *Storm*. And the material for these 'working class' tales is timeless. I liked the fact that they chose to share stories which were really sympathetic to them. A modern day version of Dickens! Well done for sure. I'll be adding this one to the film list. Great job once again Mr Harris. I think you just nailed it..", "X": null, "Y": 0, "idx": 3}
{"C": "of the Golden Age of Hollywood. Compared to some of today's similarly themed films, this one has a tremendous amount of detail, including some of the most delightful innuendo I've seen in awhile. You can see that these folks didn't make a decision just because someone said it was funny.", "X": null, "Y": 0, "idx": 4}
{"C": "a huge fan of Ron Burgundy he is very good at comedy. his dancing and his singing are fantastic. if you love comedy then i suggest to see this film it will not disappoint. Joe walsh is another great actor. i don't think you will get bored at all. it is a great movie, especially for those that like funny movies. i really can recommend it.", "X": null, "Y": 0, "idx": 5}
{"C": "for the first time with my mom and dad. The cast was mighty good - with the exception of Joan Blondell (in the musical) who looked and sounded terribly depressed and not funny. She and I both enjoyed ourselves tremendously. I have never been to theatre in my life, and I absolutely loved it! I saw it in its original title as ", "X": null, "Y": 0, "idx": 6}
{"C": "witty, the humor is touching. There are too many camp-favorite films that I cannot think of. The cheesy plot line had me roll-on-the-floor laughing the whole time. I found this gem after viewing the Canadian version of J.T. Jackson on television, and I was in stitches. At all costs, rent this movie. Everyone will enjoy it! It was worth the price.", "X": null, "Y": 0, "idx": 7}
{"C": "awe, but refuses to let go, but lets instead shrink into a stupefying little ball of mediocrity, and that's all it has, and that's all it needs.", "X": null, "Y": 0, "idx": 8}
{"C": "a stand up comedy with nothing but the best of the best comedians. David Duchovny plays a ninja's best friend who is a gold digger in the Thena Mountain and is chased by the real life evil ghost of the ninja. George Clooney plays the killer that infiltrates the night club and whom leads the victims to prison.", "X": null, "Y": 0, "idx": 9}
{"C": "sensitivity and actions when trying to fit in with his community. Interesting to watch where he gradually comes to understand the sense of what is in front of him. Joe Reeves is terrific in his role as Johnny, with his questioning of society and what makes a man fit into a crowd. Watch out for Penn and Telly, and the always solid Patricia Arquette as he searches for answers as to what has brought him to this place in his life.", "X": null, "Y": 0, "idx": 10}
{"C": "based on the great work of Ian Holm. There is a flaw in my logic, but in this case, it was a flaw I didn't see coming at all. It was immediately apparent that this movie was going to be crap, because from the first few minutes you realize you're watching a movie about a crime lord (deep, dark shadowy, responsible, anything) and he murders his guests.", "X": null, "Y": 0, "idx": 11}
{"C": "The great battles and battle of Nieuwenhau in 1814. In 1794 the capture of Leopold, the lord of Lüneburg, tries to assure the peace. A little closer to the shores of Norderwalde. As the refugees and the defenders of Paris, Leon goes back in time to see how his wife, Esther, was involved in the upheavals of 1794.", "X": null, "Y": 0, "idx": 12}
{"C": "a good sun-dial......it's all about exposure...what can happen if you're not presented with each other's truth... We'll get there. I've been to the projection room of a movies theater...much better than this unfulfilling; but I thought it still was entertaining. It gives the viewer many reasons to pause and think.", "X": null, "Y": 0, "idx": 13}
{"C": "to have been purely accidental, this is an otherwise very involving documentary that boasts a good following on the internet, which is enough in itself to make the film very enjoyable. Tom Landry, the main writer/director, certainly has made some cinematic magic in his first feature film, and the film's subject is also fairly interesting.", "X": null, "Y": 0, "idx": 14}
{"C": "a hoary summer with your mother, father and three siblings. More than likely you'll look forward to the films. David Morrissey is great as James Stewart, with wonderful mischievous sense of humor. John Ritter is as underrated as Joan Blondell (see too this review!), but just as much as Stewart. Mr. Brown's rendition of Frank Sinatra's ", "X": null, "Y": 0, "idx": 15}
{"C": "cast of young actors acting out their characters. While the story is well written and one of them is fairly well cast, most of the actors do an exemplary job. Some of the young cast is more likely to get than others but they all play their roles to the best of their abilities. Jesse Eisenberg, at this early age, manages to carry the film.", "X": null, "Y": 0, "idx": 16}
{"C": "movie in the past, but the movie doesn't deserve it. It's real weird and the people in it are incredibly cool. I don't expect a lot from a comedy but I guess it doesn't really care. It just got me laughing and thinking. Definitely worth a watch if you have a good time.", "X": null, "Y": 0, "idx": 17}
{"C": "in every strand of a midwestern family's life. The best thing about this movie is that it does not become a running gag. The fact that they are reunited again only amplifies the effects of their dream. The premise of three families, side by side, and now living together.", "X": null, "Y": 0, "idx": 18}
{"C": "'s very original and the storytelling is fantastic. You have to give it a try!", "X": null, "Y": 0, "idx": 19}
{"C": "film, that's for sure. When you combine performances of actors like Carlo Capulet, Tomas Szabados, Roberto Martino, Jennifer Beals, and many other fabulous actors, you have a huge and most unique film that just dares to make you think in a different way about life. This is about life in and out of the movies....", "X": null, "Y": 0, "idx": 20}
{"C": "lot of fears. of how we will react, of how we will act in the future. there are some fears that come from within, or a lot of things that go through our head, like our home, our close friends, our families, and others. We all have fear, we all have a lot of fear. and some of us are more than others.", "X": null, "Y": 0, "idx": 21}
{"C": "now that you are finally coming to the end of the video you have sat through once again. There is a great deal of CG in this film that could have been cut from the film without sacrificing the gore, comedy, or excellent acting. There are some great voices in this film, and on stage and on screen. Why are the theaters selling more tickets? **** What you have seen so far.", "X": null, "Y": 0, "idx": 22}
{"C": "ful harmony of work with companionship is a perfect match. Here, powerful, humane, occasionally brutal, humor and drama, are inseparable. In this moving tribute to life & love, director Art Thibodeau follows the lives of seven African-American African-American souls. Hauntingly real & touching, with heart & laughter that rises through it all. The animation is luminous & technically dazzling.", "X": null, "Y": 0, "idx": 23}
{"C": "light hearted and witty the characters were. A definite must see for the bloke in question and anyone in high spirits who is feeling all I feel. Alan Rickman plays the role of Dr. Martin, an anti-Zionist Nazi agent. I loved seeing the bright eyes of Ariel Galkin's character and when she played the cowardly ", "X": null, "Y": 0, "idx": 24}
{"C": ": he works in audiovisual tradition (there are found tracks, series, experimental films, etc.).", "X": null, "Y": 0, "idx": 25}
{"C": "all respects. The film only has two people in it: with the two of them we get the funniest comic sense of the words ", "X": null, "Y": 0, "idx": 26}
{"C": "and even that thing, or something like it, is, in fact, real.", "X": null, "Y": 0, "idx": 27}
{"C": "have come to pass their times are the most elegant and caring human beings I have ever seen. Nagarjuna ji naathaya hai bhi bhi hai...just beautiful! It is a beautiful and even charming story about the different shades of Manoj and Arjuna.", "X": null, "Y": 0, "idx": 28}
{"C": "...that's just what you dread when you see a screen with a poem written on it. movie. Watch all of them; it's a bad idea to get your mind off it. ", "X": null, "Y": 0, "idx": 29}
{"C": "and it is!), so you see the movie and you think that it is bad enough for a movie (and it is!). So, you stop watching the movie, and you begin watching the book. And what a day that was! Here's a look at the book: it is not the great fiction book about the movie. It is a re-imagining of the book about the book.", "X": null, "Y": 0, "idx": 30}
{"C": "film, but eventually feels an affinity with the characters and their journey. Because, the film tells us, life is a beautiful and mysterious journey that is taking us to the edge of a dark demon territory, smashed by chance & luck. Little things & events contribute to this path. We watch an absolutely beautiful scene as the photo tells us that life can be lost or saved - it is truly beautiful. **** out of **** stars.", "X": null, "Y": 0, "idx": 31}
{"C": "the romantic-comedy. The actress played the title character that was rescued, Sniffles, in a movie by great writer Pip Keating, and the direction was handled in a brilliant way, as usual from Masterpiece Pictures. Little of the viewer knows that this film was co-written and directed by Martin Scorsese, so the characters are revealed and rendered somewhat real through the dialogs.", "X": null, "Y": 0, "idx": 32}
{"C": ", or she had one of the most important roles of her career. Sure, there was some questionable supporting cast acting and pacing at first, but they soon got the hang of it and the characters were well drawn and well fleshed out. Great performances all round. If you see the film, do not be put off by its gloomy mood. Try and turn your nose up at the atmosphere, and you'll be fine. 8/10.", "X": null, "Y": 0, "idx": 33}
{"C": "stream of adrenaline. Superbly directed and brilliantly acted, this sci-fi-drama is a true blizzard of action, energy and verve, with far-reaching emotional and philosophical implications. We are given to see star characters for a change, including a man dealing with the effects of his own neurotic personality, an urban cop (Barry Davidson), and a lesbian (Kathleen Turner).", "X": null, "Y": 0, "idx": 34}
{"C": "idea of the movie is pretty familiar, but the actors portray it so well that you don't mind the changes. Other than the actors, most of the cast is also pretty good. I didn't like Cillian Murphy's character at all. He was just weird. The movie just tells us to stop making stupid comments and concentrate on doing the right thing. Other people were more awkward and didn't give us the strength to do it. It was almost like ", "X": null, "Y": 0, "idx": 35}
{"C": "by everyone. David Duchovny, arguably one of the greatest actors ever to work in film, is sublime as the eldest son in search of his place in the world... Kate Winslet as the motherly love rival (a cross between Lindsay Lohan and Anne Hathaway) is tremendous and is aided by solid direction by George Cukor. No wonder, The Irishman has become a classic.", "X": null, "Y": 0, "idx": 36}
{"C": "again,. i have to say it is! :) it was way better than i feared it would be. yeah, there are some bits of dialogue from the original which are a bit silly, but its worth a laugh, you will be surprised.", "X": null, "Y": 0, "idx": 37}
{"C": "engaging and entertaining, with excellent performances from David Niven and Barbara Stanwyck. 2.Sheila is stunning in the movie, a lady obsessed with the detective, especially when working in an area with limited light. 3.The climax is shocking - but it's entirely appropriate, as the plot's terrible.", "X": null, "Y": 0, "idx": 38}
{"C": "this a classic work, that deserved. I read the synopsis and I am so excited, she's great, and the movie is very good! The acting was magnificent! She did it very well, all the actors (Mandy Moore, Robert Guillaume, Leonardo DiCaprio, Michael Moriarty, and Olivia de Havilland) did a wonderful job portraying Anne.", "X": null, "Y": 0, "idx": 39}
{"C": "end. The story is a classic of cinema, well if you don't know it you have never heard of it. The way the film is structured is not that straightforward. First he goes to a convent then after some guidance from the priest he becomes a priest in the church.", "X": null, "Y": 0, "idx": 40}
{"C": "Cinema in Oakland, CA. I was slightly addicted to it, since it's the first film I saw of the writer's in my city that I had never heard of. The movie had been nominated for the IFC Award for Best Foreign Language Movie. The cast and crew were splendid, including George Clooney in his more than fair best role and both Julianne Moore and Bill Paxton.", "X": null, "Y": 0, "idx": 41}
{"C": "the state of humanity.But i don't want to tell you that this movie was not real.I want to tell you that this was a realistic portrayal of human life.the movie is set in new york city in 1899 and covers the underground operations of the f.b.i. There are depressing scenes that's why we can't rate it.", "X": null, "Y": 0, "idx": 42}
{"C": "nice premise. In the movie, there are two main actors, both being lawyers. One, who is actually an old, great veteran actor of Bollywood. The other one is very young, fresh, talented and is shot out of the crowd. Both of these actors have the audience in stitches and make the whole thing worth while. The ending is very surprising but a good way to end the movie.", "X": null, "Y": 0, "idx": 43}
{"C": "written thriller, this film may not be for you. But, if you have a deep curiosity about history, I suspect you will love this film. Filled with surprises, it features a truly fine performance by Keanu Reeves, and interesting use of shot angles by director Oliver Stone. The movie is powerfully, and brilliantly, paced.", "X": null, "Y": 0, "idx": 44}
{"C": "comes off as an intimate theater experience and less like a film about a funny-but-sad-tragic true story. And also because he starts out strong enough to be a capable actor but then brings out the dead weight of so many stereotypes and overplayed sentiments. One of the worst problems I have with this film is that it fails to make me even vaguely aware of anything important.", "X": null, "Y": 0, "idx": 45}
{"C": "since then, Hollywood movies don't measure up to what some like to claim that this fine classic is. The music and the director's mastery of the film are such that even more people may be able to appreciate this wonderful true story than some folks think they can. This is one of the greatest story I have ever heard of, period, because of what it tells us. In a word, this movie is timeless.", "X": null, "Y": 0, "idx": 46}
{"C": ") have been discovered by Warner Bros. International. Apparently, there isn't enough demand for the RKO films or the RKO Super Series. And with this great, we have a very interesting way to see the Kingdom of Judah on TV. Like with any classical Judah series, the television adaptation - with its lavish music and scenery, terrific locations and great history - started with no preconceptions.", "X": null, "Y": 0, "idx": 47}
{"C": "the whole thing, with all the talk of censorship and how the censors don't give a shit. I saw this film when it was first released in 2005, and I have to say, I was thoroughly entertained by it. This film is true cinematic gold, and a well done movie at that. The only complaint that I had was the gimmicky use of the letters ", "X": null, "Y": 0, "idx": 48}
{"C": "day, even when it is late in the day. I saw it last night for the first time, and I was blown away. The writing is impeccable and so is the acting! This is a show worth watching. I think we will be seeing more and more of it! We love Jake and I love Emma too! I even sent a message to one of the stars - they said they would be back in the fall. This show is truly amazing.", "X": null, "Y": 0, "idx": 49}
{"C": "to enjoy and this time it is nothing but fantastic car racing. The film itself is not as simple as it looks. Some laughs are to be had here and there but they are very few and far between. The real reason that we can think of any film or any sports series as being the best of all time is because of the great talent that is there. In no film of the series have the producers ", "X": null, "Y": 0, "idx": 50}
{"C": "in the near future. (Elizabeth Taylor has tried it before and it was a hit, like Snow White.) ", "X": null, "Y": 0, "idx": 51}
{"C": "ly styled anti-hero story. Still the action is brutal, and the opening chase and suicide is a blatant repeat of the entire gruesome first half of the film. Add to that the final reveal, complete with monster cat and screaming demon, and the film is one of the most brutal films ever made, the first part being a ruthless carnage of the Hollywood movie genre. **** out of *****. Hugely recommended.", "X": null, "Y": 0, "idx": 52}
{"C": "of REAL UNIQUE friends. Not quite a big hit, relegation on earth (I think) and a real party. But it's fun, like a kid in summer school. The acting is mostly good for a three-person comedy. I never went crazy watching it or starring the same actors for so long, but it really paid off! I really like the plotline of the movie, and where it went.", "X": null, "Y": 0, "idx": 53}
{"C": ". Because a lot of the cgi scenes can be deemed ridiculous and do little more than exploit a cultural clash between a Japanese-American couple and their Korean-American partners. One of the reasons I love ", "X": null, "Y": 0, "idx": 54}
{"C": "the Dennis Compton novel by George J.R. Martin. The misfits are basically smart guys who stop crime and act as vigilantes to stop perpetrators. But at some point in the past they become paranoid about crime, so they start a ring. The three leads are excellent.", "X": null, "Y": 0, "idx": 55}
{"C": "best shows on television (to my taste anyway). I got hooked from the beginning to the end, not only because of what Altman did in this show, but because he played it straight in an honest way. The stories are interesting and the series is fun. It's nothing like American Idol. My only qualm is that he could have shown a bit more chemistry with his family. I would have given this show a 9.", "X": null, "Y": 0, "idx": 56}
{"C": "very much appreciate the fact that Kajal Aggarwal has moved out of the role of a politically-correct Bollywood Jatiya after winning the Oscar. As an American, with a strong sense of identity, this place gives us a very interesting and detailed insight into India.", "X": null, "Y": 0, "idx": 57}
{"C": "hole! My childhood playground. My little bed for hours. My parents bought me there for my birthday.", "X": null, "Y": 0, "idx": 58}
{"C": "true estate in all the history of the world. His acting is so powerful that when you watch this movie you will not have a clue about the real estate business. ", "X": null, "Y": 0, "idx": 59}
{"C": "its nature. The fact that the film took place in a winter-packed city in the fall, while the scenery-gathering had already begun made it a remarkable visual experience. Well done, Brian De Palma. My favourite film of his in the last ten years. ", "X": null, "Y": 0, "idx": 60}
{"C": "episodes and they were pretty good. I'm just saying that the sound track, that's where the romance fails. I mean, I thought both the characters had the attitude of being subservient, but the actors seemed just too intimidated by their surroundings to show emotion. The only thing was, that they were all too happy to pose like that for the camera.", "X": null, "Y": 0, "idx": 61}
{"C": "this before but i always enjoyed any type of documentary i have ever seen so this was a must see for me. the evidence of political murders is very powerful and so are the investigations by the German army. any viewer who likes truth should see it for themselves. the film makers were all interviewed on the stage at the end of the film, and all had the same reaction when asked how they had gotten so information on German and American Nazis: ", "X": null, "Y": 0, "idx": 62}
{"C": "those mysteries you want to see solved. Its all about Charlie, a man murdered while he and his friends are stuck in a hotel room. And now he has to take on his former nemesis, a woman killed while drinking a good cheap wine and even the actor responsible for casting Andy Samberg in the role of Gregor was not there. The mystery, from the lead roles, is involving and enjoyable.", "X": null, "Y": 0, "idx": 63}
{"C": "has it's moments but also a few of its weaknesses. for example it's way too spoiled with TV cops and greedy landlords and unscrupulous people who take advantage of the weak and the desperate. but the series doesn't give up on those. it's a very interesting show but not for the young people. the recent episodes seem too grown up.", "X": null, "Y": 0, "idx": 64}
{"C": "last night, and thoroughly enjoyed it. After a nice meal at a nice restaurant, Alex is sat at the table and greeted by her nametag that says 'the girl in the diving bag.' From the outset, it became apparent that she was, in fact, the girl in the bag.", "X": null, "Y": 0, "idx": 65}
{"C": ". In a city as crowded as this one, I can tell when they have a storyline down that the audience will like to see. This film has to be seen to be believed.", "X": null, "Y": 0, "idx": 66}
{"C": "to get from the hang up stage.or vomit into a holding tank.while we are there... we are not the bottom of the barrel, but in the very top", "X": null, "Y": 0, "idx": 67}
{"C": "series, with excellent early performances, with set comrades proving that the first word can save a movie. The supporting cast, with Tony Todd, Lila Keegan, Tony Harris, Maxfield Parnell, and Alan Rickman, are believable and extremely engaging, and the cinematography is excellent, with many beautiful locations in the streets of Philadelphia.", "X": null, "Y": 0, "idx": 68}
{"C": "true that I do watch many movies and many of them are good. But many of the more good movies that I enjoy do not have this message on their front cover. I'm not telling you not to go and see them, I just say if you do you might as well find a way to enjoy and let the positive message of the movie carry you through the entire movie.", "X": null, "Y": 0, "idx": 69}
{"C": "but are willing to learn and grow with time and experiences if need be. It was an entertaining and moving movie for me. I cried a few times and laughed others too. I was left a bit by the fact that the boys did not want to learn and seemed to really enjoy themselves. They seem to be having fun and joking around and laughing at others. But that is life. Life is not just one big laugh every ten seconds.", "X": null, "Y": 0, "idx": 70}
{"C": "it is really provocative, dark and funny. So much so that it makes me believe that some of the best things in the world are made in Berlin.", "X": null, "Y": 0, "idx": 71}
{"C": "It can't be written here; it's too far-fetched, and it's too ", "X": null, "Y": 0, "idx": 72}
{"C": "'t always been able to be as good as he is today. As this film shows, that hasn't kept him from being prolific. Why should it? He doesn't rely on one-liners and sex jokes, and his vulgarity is more often the product of being off-color and absurd than funny. Revolving around his son Geoffrey ", "X": null, "Y": 0, "idx": 73}
{"C": "ted archer, a fun story, incestuous couple, frisky kid and tasty pascarella, alfred riggs, george clooney, jazz footlights, chet kovsky and the list goes on.", "X": null, "Y": 0, "idx": 74}
{"C": ". I had never thought of this as a movie for me. Now I really want to go see it. I also was surprised at the highs and lows of the drama. I would say there isn't much to it but for once I was blown away by the drama. It was really good. It's definitely a page turner that will stay with you.", "X": null, "Y": 0, "idx": 75}
{"C": "I've seen it, has gone astray! What a nice surprise! Mike Hanks is incredible, and all the supporting actors are as well. Robin Williams should think about writing a sequel. The script is filled with holes but is still a charmer. Even from the part of May, Robinson is good. Barbara Stanwyck will give her full performance. For those who haven't seen it, it's been a long time coming.", "X": null, "Y": 0, "idx": 76}
{"C": "came across it through the NAACP and was just moved that this was the only movie I could find from the NAACP that had a similar message to the Reverend Wright) God's Hand was the most important movie for the generation coming up with the new look of America. ", "X": null, "Y": 0, "idx": 77}
{"C": "not just another land of warriors and smugglers. Instead it is a wonderful free-range democracy with no government at all and no borders. It is all unrestricted and free. The Gods will not find the film offensive if they believe that man and man can coexist freely in harmony with each other and with nature. That does not diminish the film at all.", "X": null, "Y": 0, "idx": 78}
{"C": ", not just show snapshots of a particular place, of what, one can assume, is a very beautiful scene, often with a fantastic, long shot of that place, and to create the most beautiful snapshots possible. It is a dazzling exercise in creative control in which the camera captures and has control over each and every shot. And, oh yes, that's right.", "X": null, "Y": 0, "idx": 79}
{"C": "s that work together in the movie are very good.some of them have to play something different than they were used to...it is a movie about everyone who is willing to live a horrible life that others in the world don't understand.", "X": null, "Y": 0, "idx": 80}
{"C": "itionist and Methodist broadcaster Fred Wilson. This film contains fine performances by Patrick Stewart, John Gilbert, Ralph Hitchcock and Harry Dean Stanton. Beautifully done, but somewhat underrated. If you haven't seen it, get a copy from the library and watch this film a few times. It is compellingly strange, beautifully shot, touchingly profound, beautifully written and deeply emotional.", "X": null, "Y": 0, "idx": 81}
{"C": "ignored or even suppressed by the world. You may have heard of caricature, and you may have read, about a version of it in a novel; but the ", "X": null, "Y": 0, "idx": 82}
{"C": "schoolboys: surrealism, gore, all manner of magical creatures and a pretty good review of the trades.", "X": null, "Y": 0, "idx": 83}
{"C": "acting was excellent.the sets and background were great.you got to see it.it was worth seeing. it is very sad that he dies but i like the fact that his life can still be felt through his words.and he had an honest and strong soul as well. he just had to get on with it. so sad how good acting can be. i hope that this version gets better and that i can get to see more of it.", "X": null, "Y": 0, "idx": 84}
{"C": "a discussion led by Matt O'Dowd and i found this film fascinating. every character is important and every person has some clue what they are all about, and the film is often subtle. this is a must see film for everyone, even if you don't have an interest in film, it will have you thinking about all the characters. i couldn't help feeling a little insulted at having to describe the film in so few words.", "X": null, "Y": 0, "idx": 85}
{"C": "there is such a brilliant cast in this, or the amazingly talented Henry, or Daniel Sunjata (Hilary Swank) they do not overshadow the cast of great actors, as good as they are in the film. At a time when it seems that there is so much of negative criticism of the cinema, this is probably one of the more entertaining and enlightening movies I have ever seen. ", "X": null, "Y": 0, "idx": 86}
{"C": "all used to everyone being homophobic and yelling at people who are different, this is a triumph of the human spirit.", "X": null, "Y": 0, "idx": 87}
{"C": "1879 this was a freewheeling way to react to developments in the civil rights movement, making it a parable for modern African-Americans... today the action just doesn't seem so significant as it might have seemed in the nineteenth century.", "X": null, "Y": 0, "idx": 88}
{"C": "s. The story goes well...Mr Cohn is a trader of unique film. His resistance to popular media is one of the best of the very rare few...The first newsreel of a new programme. Already we are wondering if the two sides will succeed... I recommend this to everybody...of course, the liberal use of vignettes will only leave some indifferent.", "X": null, "Y": 0, "idx": 89}
{"C": "which describes an aspect of English society. From the black folks who live in the slums, to the straight laced youngsters, who talk to themselves in the most fanciful terms of all. These folks are funny and, thanks to Melvyn Douglas' performance, easily up-beat.", "X": null, "Y": 0, "idx": 90}
{"C": "favorite movies in the past, and will always be, is: inane; awesome; a treat; the movie i saw it with my girlfriend's sister. My only complaint was that you couldn't see the pictures. But I just went on to the next. It was funny, and the film was incredible. The acting was great. The songs were very good.", "X": null, "Y": 0, "idx": 91}
{"C": "a great spooky family film. Joanna Lumley is magnificent as ever as Emma Jane, The Witch is sometimes dark, funny, sad, exciting, and beautifully shot.", "X": null, "Y": 0, "idx": 92}
{"C": "cast are very good - even if they're not the'stars' of the show, they really are good actors - even when they seem to lack the confidence of the newer generation, which is always disappointing. The script 'waistlines' are sometimes rather bad - and the politics is based on just two issues - a repressive government (as is often the case) and an environmental crisis.", "X": null, "Y": 0, "idx": 93}
{"C": "simple plot, played out very well in cinematic terms. An aspiring and repressed Christian of the post-World War II era (and his lover) must find out if he or she can attract attention with a modest set of tricks. All the ingredients are there: Sherry, L.M.T., Ray. He seems awkwardly attracted to her, so she looks at him in a way that causes him to show concern.", "X": null, "Y": 0, "idx": 94}
{"C": "ling, memorable characters, witty dialogue, a good point of view, how a film can be bad with such a cast and such a cogent script... especially when it features such wonderful dialogue... it is a story worth telling. For if someone has seen ", "X": null, "Y": 0, "idx": 95}
{"C": "Stanley Donen a painter and singer and this is exactly what we have to look for in a compelling ", "X": null, "Y": 0, "idx": 96}
{"C": "are not likely to be found in another film. it doesn't try to be too deep or meaningful, but instead concentrates on the characters — young and old — and their specific lives, all from the perspective of their particular type of beetlejuice. but it does have subtle nuance and even some scares (the entire horror piece was shot in a secret location!).", "X": null, "Y": 0, "idx": 97}
{"C": "boding movie, where you can feel the gloom of a country in peril and the deep sadness of one's own past. Nostalgic actors play a role of their own idiosyncrasy and realness. Since coming of age, they all realize their place in history.", "X": null, "Y": 0, "idx": 98}
{"C": "key, the only tool. The song, the prayer and the tea leaves make all the difference. Things may be awkwardly placed here, but for the sake of creating a family portrait, we are compelled to pull our heads together, our hearts in our hands, and let the hurts fly where they may.", "X": null, "Y": 0, "idx": 99}
{"C": "counted 2 minutes of people looking at a screen that is barely the size of a television despite being nearly three feet tall and having to stretch on the long way of watching the screen. The screen was hardly wide enough to see the character we all imagined so vividly: the one that shows a drunk man in a bathhouse, her lover, and his psychotic fiancé all looking at the same thing and feeling uneasy and scared.", "X": null, "Y": 1, "idx": 154}
{"C": "place I wanted to go ;) The plot was shockingly original; the use of'selective colour' a comedy staple; and a total lack of empathy for the political depravation he is convicted of. The fights, the scenes where the leaders lose their sense of honour, are both depressing and heart-breaking. He is wretched and must be destroyed like all the other members of his race.", "X": null, "Y": 1, "idx": 155}
{"C": "re trying to be charming...I'm not sure how to sum up the tragedy of this film. A few seconds of amusement were the only points of all about the evil thing that possessed the kids. Well, some of the best moments were the two kids making a single lady jealous and the kid playing by the rules of the family when he would beat her so she would be kidnapped. Yes, you have to remember that the kid was out of control.", "X": null, "Y": 1, "idx": 156}
{"C": "hate this movie. It's just like a lot of the movies she's in lately - too much repetition of the same things. It's basically just nothing new to say - and has been done to death. - Lynn Sheridan - I always like watching Sheridan on TV. She's definitely talented. - Richard Gere - (No acting) I don't have any personal issues with him.", "X": null, "Y": 1, "idx": 157}
{"C": "-excited by the word entertainment.--i do not think so--i am so tired of you saying what you are saying and doing! and just talking about any old subject you want.--there are a lot of movies I have seen and enjoyed--one is even worth a rental. This one is awful.Such a waste of time and resources. In fact, it leaves me really disappointed. It never feels like the end.", "X": null, "Y": 1, "idx": 158}
{"C": "screen, dozens of other Christian and Islamic-themed movies have begun to emerge. If it wasn't for its own peculiar contortionist act, this film might have featured the worst example of male-centrism, since it makes little sense on the script and turns a blind eye to the entrenched sexism in its script. (His name is the worst anti-Christian insult I have ever heard.", "X": null, "Y": 1, "idx": 159}
{"C": ", but even that person couldn't figure out the make of this film. It just doesn't pan out to be anything more than a cinematic exercise for a computer screen.", "X": null, "Y": 1, "idx": 160}
{"C": "our cinemas. To the worst of the British cinema. That means the worst of British cinema. No show business or no excellence, no dialogue. And the worst characters ever in a British film. All of them are there to make some stupid mess. And not the most enjoyable either. Clearly not a typical British film to watch. All characters are flimsy and nasty. (False advertising, publicity hoopla, pink faces.", "X": null, "Y": 1, "idx": 161}
{"C": "it's going to end somewhere soon. The ugliness of that ending never really lets up and there are only so many times you can see that the truly horrible things that happen get worse...But for some strange reason I found myself enjoying and with one exception, I was really looking forward to it, then I saw that the credits were so short, I realized how unnatural it all was and immediately tossed the DVD into the bin. I thought ", "X": null, "Y": 1, "idx": 162}
{"C": "Frank. Horrible script, the worst acting ever!! i will never see this movie! i am very disappointed! i was looking forward to watch it and it was completely empty! I give this movie a 2! my average rating is 5.0 from 5, only because of the acting of the actors.", "X": null, "Y": 1, "idx": 163}
{"C": "eter] Dunne movies may be the first (if not the last) great film of its kind (and quite possibly the best), The Way You Were is certainly not one of them. Unfortunately, like all films where the audience has been brought into the making of the movie, the DVD and theatrical release do little to remove the sense of utter boredom, disdain and disappointment.", "X": null, "Y": 1, "idx": 164}
{"C": "for a child. Even her distraught mother tries to understand her, but her husband's muddled family marriage and her daughter's ludicrous obsession with a child will eat up most of your time.", "X": null, "Y": 1, "idx": 165}
{"C": "d the &quot;intelligent&quot; humor of the more recent group of films: « La Tassera » (that's *whistle* and &quot;tsah&quot; movies), but I am going to go ahead and say that this was just the sharpest, most pointed and cynical insult I have ever witnessed. It was... horrific. It was cowardly.", "X": null, "Y": 1, "idx": 166}
{"C": "what you will have to deal with when you have a box like this. I felt like I was watching a very poor TV Movie. It ruined the action and made you wish for an exit for the now 90 minutes. There was no battle scenes, lots of gun battles, no real action, no acrobatics, lots of screaming, and no real fighting. The acting was poor and the fight scenes were horrible.", "X": null, "Y": 1, "idx": 167}
{"C": "hearing all these reviews, that this was not as good as the original film. It had the ambitions to be a grand historical and cultural document that it so completely failed to be, and gave the feeling of cheap-shot editing and fake documentary actors with no degree of skill. Is it OK to make a (French) movie that is neither a science-fiction or a documentary film? Well, no.", "X": null, "Y": 1, "idx": 168}
{"C": "work; if it had been a new film i'm afraid i wouldn't be able to believe that it was made to look exactly the same. i hate musicals and I find all of them to be very amateurish and i was really quite annoyed that the first one was so good, now its one of the worst films i've ever seen... I didn't even understand half of the dialogue i watched...", "X": null, "Y": 1, "idx": 169}
{"C": "that makes me laugh at this pointlessness. I don't care much for every era or type of comedy, but this one didn't work for me. It reminded me of a French episode of a soap opera, with the jokes being more humourless, over exaggerated, and using the ", "X": null, "Y": 1, "idx": 170}
{"C": "a series of poorly written lines that sound as if they're copied from someone else's writing. I didn't enjoy any of the characters, the deaths were tedious and inconsistent and the characters were one dimensional and little more than a stereotype. The villain was the biggest turn off, and his reaction to the murders, well, let's just say that his grin was a sneer in the face.", "X": null, "Y": 1, "idx": 171}
{"C": "the time. There are things that are just so out of control that it makes our entire society cringe.", "X": null, "Y": 1, "idx": 172}
{"C": "you'll not only spend the best part of a good movie hour, but more than a half hour in slow motion, are more than enough to turn me off of this otherwise worthy effort, which only develops its characters with it. People are no better than each other, but they become friends during the course of their work. ", "X": null, "Y": 1, "idx": 173}
{"C": "a sentiment I feel every day. this is one of the worst movies i have ever seen. i can only say i felt sick to my stomach and tired all at the same time. i could not believe how bad this movie was. i dont think i will be watching this movie again. i will also say that i want to go back in time and explain why i feel this way.", "X": null, "Y": 1, "idx": 174}
{"C": "a motion picture ever. The whole of the story is presented as an excuse to give it a sexy acting staff and blue screen. Some of the films, such as Jean-Georges (1973) is an exception, but most of them are quite bad. Every actor has done this over and over again; pretty much anyone can do it if their work is better than others. And, those who've worked for them must do it all the time.", "X": null, "Y": 1, "idx": 175}
{"C": "I like about this movie is that it has a weak plot (at least by Disney standards) but with a great acting quality and beautiful scenery. In other words, Bewitched is the kind of movie that you want to see the lights go out on. While directing this movie, Hanks pulls off a great job of mixing humor, suspense, and even romance with suspense.", "X": null, "Y": 1, "idx": 176}
{"C": "like this movie was akin to admitting that I didn't like Brokedown Palace, just that I hadn't liked it. For a young film that supposedly looked at the future of westerns this is a really boring story.", "X": null, "Y": 1, "idx": 177}
{"C": "starring Diane Keaton, a handsome but unwanted girlfriend tries to be part of a transgender conspiracy to kill Ellen DeGeneres in a lavish Los Angeles mansion. The movie has a sexy and seductive look about it and it does offer an interesting insight into the bizarre world of transgender people and their odd relationships, but like many filmmakers today, it never quite lives up to its promise. Ms.", "X": null, "Y": 1, "idx": 178}
{"C": "go to see them. I have seen better acting by professional actors in those roles than in these types of roles. Whilst the action was good, there were far too many plot threads and extremely lacklustre directing. By the time things got towards the end, the way in which the montage of their pasts were woven together was to thin to be an epic.", "X": null, "Y": 1, "idx": 179}
{"C": "a naughty teenager. It was the worst thing I ever saw and i regret watching it.", "X": null, "Y": 1, "idx": 180}
{"C": "Creativity, and after several weeks of camping, sleeping, reading, studying, and other revelry, I had little left to show for the day. I had to see this ", "X": null, "Y": 1, "idx": 181}
{"C": "to die, and realizing your life is actually eternally involuntarily frozen with death,", "X": null, "Y": 1, "idx": 182}
{"C": "a very bad cinematography, didn't even make it to the festival, in the end it was a blow away. Other pieces of good production are in the movie, but other than that the director has nothing to do, and let the actors do their jobs. ", "X": null, "Y": 1, "idx": 183}
{"C": "its main themes. It felt as if the director had seen every possible nuance in the relationship between man and dog in its story. Each segment of the movie seemed to be built on the previous one in the form of a twee cartoon that was about the most badly done and boring I have seen in a while. Even the kids seemed to have done an admirable job of turning the series around.", "X": null, "Y": 1, "idx": 184}
{"C": "s never quite clear what the tone is but there is a sort of grace about it... far more thought-provoking than your typical gangster flick. However, it never gets to the soul of its characters.", "X": null, "Y": 1, "idx": 185}
{"C": "I like how this movie goes from bad to worse without knowing it! The filmmakers (also starring in the first) have some ideas for the 2nd movie and thats about it... I guess this is the most ludicrous sequel I have seen...Omg there is nothing new or interesting in this plot. I don't believe in this conspiracy. These movie should be remade with much more effective and smarter plots.", "X": null, "Y": 1, "idx": 186}
{"C": "jokes that need to be rewritten, this one is the only truly bad one. For a feature film on the Internet this is a really good rating but should be banned. Good, but it can be better. What else can you say?", "X": null, "Y": 1, "idx": 187}
{"C": ". It's just bad. Really bad. It's just bad. I don't get why they had to make a movie with a story that's almost entirely, ahem, clear cut political correctness. The other problem? It's really hard to actually care about this story, and there's some political pointlessness. Besides, every politician who gets involved gets a big make-over in the ending. Nothing makes sense.", "X": null, "Y": 1, "idx": 188}
{"C": "umbness. The character is like a rabbit with a headache. His droopy eyes always seem to be on a dorky shelf and the one thing you can tell he has in his pocket is a nice iPhone photo. Then the sadistic capers endemic to sydney and throughout the film take over the action.", "X": null, "Y": 1, "idx": 189}
{"C": "a ton of screens. i was just reading the synopsis for this movie and it seems to me that its terrible", "X": null, "Y": 1, "idx": 190}
{"C": "this is an immensely silly film. If the fact that it does not seem to know where it is going is a surprise then the end result will delight and surprise. The wigs and makeup (they should've all been shot at the beach, not on the beach.", "X": null, "Y": 1, "idx": 191}
{"C": "this film and it seemed to me that they were talking about the film itself, not the director. I found it to be an unsatisfying adaptation of a wonderful book (written by the lovely Helen McGinley) I found the script to be predictable and the acting to be poor. The movie is dreadful and you are left with the feeling that it is going to turn out badly. I also found it to be very slow moving and too long.", "X": null, "Y": 1, "idx": 192}
{"C": "one is just plain weird and mindless. The kids are not funny and the movie is very cheesy. I actually thought the whole movie was a waste of time. I actually wanted to stab the screen with a paper clip to make a funny scene. This movie is just one of those things that should never be rented, no matter how much money it might make you. It is too stupid and unfunny.", "X": null, "Y": 1, "idx": 193}
{"C": "an adjective thrown around so many times in this review that it is akin to throwing water on an oil fire. Of course the film contains some ", "X": null, "Y": 1, "idx": 194}
{"C": "miscast for this movie in many parts. No one is trying to be funny here except the three girls. Soderbergh gets to play my aunt who is a life threatening alcoholic and he is sooooo annoying. And the guys who say she was told to be a prostitute by her mother seem to be doing this to them. 0 out of 10. 4 stars if you have never heard of this story before.", "X": null, "Y": 1, "idx": 195}
{"C": "is funny, this movie is the opposite. This movie is dumber than a buck naked chick. If you are willing to see these geeky losers travel the globe in the vain hope that one day, something funny will come along, you will be in for a treat. This movie is crap! You could laugh at the crudeness of this piece of garbage, but most of the humor is dead on target.", "X": null, "Y": 1, "idx": 196}
{"C": "blow away its dust. The camera zooms in and out of the audience to shoot moments, just so that when the point is made, there will be a wide shot and audience members will look at the moment, rather than focusing on who is talking, what part of the story they are supposed to be listening to and so on..I didn't care much for the narration either; too much fluff-speaking and stupid scenery-painting.", "X": null, "Y": 1, "idx": 197}
{"C": "The Goodbye Girl is also quite a low budget film and arguably quite poor too. For a film based in the 'Bay Area,' The Goodbye Girl sets the perfect example for low budget films. While this small town was basically forgotten by the Government, it was nevertheless to this community and its people that Generals Invader and Judas tried to give hope.", "X": null, "Y": 1, "idx": 198}
{"C": "s a dull, flat, and overexpressive version of Japanese horror classic ", "X": null, "Y": 1, "idx": 199}
{"C": "tries to be clever and is sometimes quite funny, it doesn't ever reach that level of absurdity.) The characters in TERMINAL FACT are flat and are written like many TERMINAL FACT episode pilots, particularly Marty (who looks like a freshly painted piece of cardboard, a terrible voice actor).", "X": null, "Y": 1, "idx": 200}
{"C": "I am a big fan of this film but I must say that the director made a bad decision. The story is rather stupid, mainly because it should be told by American teenagers. They understand the boys, but they know nothing about the realities of their life. All he tells us is that the Indians must not be allowed to send the Jews to the concentration camps because they will be punished. This is wrong and unbelievable.", "X": null, "Y": 1, "idx": 201}
{"C": "and so sad and so sad......the case of the empty graveyard sucked... my feelings of sympathy and fear really do out weigh the film's plot, which is at once mostly brainless and philosophical. I couldn't feel at all sorry for (expletive) the poor protagonists, who were thrown into an inhuman series of death, each death being ", "X": null, "Y": 1, "idx": 202}
{"C": "So it really blows. As anyone has stated, two women in the same state of mind should not be together. As others have mentioned, I have seen better movies in my time. I want to make a comment on some of the truly ill things that were in this piece of work. 1. Rather, people are suffering from seemingly every possible disease and condition.", "X": null, "Y": 1, "idx": 203}
{"C": ". The studios didn't want it to be anything but another surf flick that Hollywood would pretend was a weird and wacky character (in fact, this was something they consciously kept away from to give it more depth). The only thing I like about the movie was the soundtrack (and that sounds odd on its own, given the film's subject matter), but that's not enough to make up for the lack of actual movie-making.", "X": null, "Y": 1, "idx": 204}
{"C": "stars the mostly charismatic Mary Martin, who, however, has a terrifying propensity to follow in her father's footsteps in everything she does and there is very little credit that she can pay for it, since the film never credits her with any creative work. ", "X": null, "Y": 1, "idx": 205}
{"C": "because it's not enjoyable to the eyes. Some parts were pretty dull, like when the mummy says he'll wait in the shadow and then he'll give me a magical arrow with a jagged tail. The movie didn't seem to me as good as the previous two films i saw this year, so i'm giving it 2 out of 10.", "X": null, "Y": 1, "idx": 206}
{"C": "sy acting and the horribly disappointing conclusion. i'd give it zero if i could but it doesn't hold up, nor are the contrivances. any chance of a re-write of this sequel...?? that would be a travesty. is there any justice in this film? and how exactly can one give a negative rating to a film that is mediocre at best? i was sooooo entertained.", "X": null, "Y": 1, "idx": 207}
{"C": ", but what really stood out was a head-shaking feature-length presentation of the biochemical route.", "X": null, "Y": 1, "idx": 208}
{"C": "a lot), this one is one of the worst. It consists of an abridged version of Billy Crystal's mediocre play ", "X": null, "Y": 1, "idx": 209}
{"C": "for its money. I thought that this movie was a low point for me in the summer of 2001 and now its years later and i still wish i had wasted another hour and 45 minutes watching it. I know i didnt read all of the positive reviews but i still hate that movie. I wish they had given it the oh so important nope i didnt see that coming it was bad.", "X": null, "Y": 1, "idx": 210}
{"C": ", to the point that it doesn't fit the storyline, and that's just a rule that critics leave out there. ", "X": null, "Y": 1, "idx": 211}
{"C": "joke in it. Such a waste of time. The problem with a bad joke is that it is better to make one and laugh at it than to laugh at itself.", "X": null, "Y": 1, "idx": 212}
{"C": "happens is just okay. The humor is limited, and a lot of the humour is not funny. The acting and the script are horrible. There is really nothing funny here. And the fact that there are no real surprises helps (and it usually helps). ", "X": null, "Y": 1, "idx": 213}
{"C": "it's worth it. Mr. Rogers is a coma-entertainer - he seems to have lost most of his hangover in retirement. By the way, somebody asked him if he acted like a ", "X": null, "Y": 1, "idx": 214}
{"C": "re-released in English for five years. The only English-language version available was the one that was advertised in the cinema, a lengthy and cheaply-made 138 minutes and repeated on TV. For a complete list of features from the film, see James Arthur/Michael Chesky: The Experts. ", "X": null, "Y": 1, "idx": 215}
{"C": "is a sharp actor and an equally sharp director. But that is about all there is to this one. The script is mediocre and the acting is terrible. If Sly Stone were actually an actor, he would be shamed by those awful lines like, ", "X": null, "Y": 1, "idx": 216}
{"C": "acting and directing tribute to Arthur Lubitsch and Scarlett Johansson, this film loses all sense of reality as a result. It seems to be just an overstuffed, badly cranked up version of ", "X": null, "Y": 1, "idx": 217}
{"C": "(emphasis added) KILL ME NOW will require a movie hard case and immediate deadbolt. Five seconds into the film, there is absolutely no tension. The plot only barely makes sense and reveals a strain of ever-popular, maniacal, wild-cat vigilantism among those around the killer. There is even a HOAX.", "X": null, "Y": 1, "idx": 218}
{"C": "script writers have gone overboard. Really, it has nothing that makes it a well-made film. I like good movie writing, and I like good writers. But if it means reshooting The Godfather, and it has the Baader Meinhof, the Ron Kovic and other actors of the Western genres of movie, you might as well throw it in the bin. I would have to advise that you not waste your time on that.", "X": null, "Y": 1, "idx": 219}
{"C": "ppy and endlessly repetitive film with a ridiculous and overblown title. In case you're not an animal lover and can't understand the title, ", "X": null, "Y": 1, "idx": 220}
{"C": "isn't a bad film, but i don't believe it is that good a movie. First of all, i am sorry but i was watching it at home on a computer and the whole time i was watching it i was thinking i was watching a sitcom, i wouldn't have known that was such rubbish. The laughs were just all so stupid it was beyond the realms of amusement.", "X": null, "Y": 1, "idx": 221}
{"C": "film meant to poke fun at drugs then it did not do that. For a film that has the political backing of John Lennon and George W. Bush this film sucked. Instead of pandering to a young and sophisticated audience this film brought down the house. The acting was amateurish the laughs were cheesy and more of an insult to the intelligence of the older audience (not to mention the more stupid).", "X": null, "Y": 1, "idx": 222}
{"C": "since I saw it on video recently I was tempted to see it on DVD just for the Italian effort at it. Yet as soon as it started, I could tell that the Italians were buying its plot and would definitely avoid to jump to the opening credits of the film. So it is like eating sand with the commentary. The acting was mostly good but when the main character said ", "X": null, "Y": 1, "idx": 223}
{"C": "flashbacks, melodrama and character acrobatics, but whose plotting and characterization fails to tell a coherent tale in nearly three hours. And when you know the ending is a foregone conclusion... well, that's a little depressing, if you've got a spare 90 minutes.", "X": null, "Y": 1, "idx": 224}
{"C": "ce about a man who had to rise above his fear of spiders, and is content to do its damndest to kill thousands of people, The Shining is a good example of a ", "X": null, "Y": 1, "idx": 225}
{"C": "motion... watch it only if you like your show centered around the menstrual cycle... oh and there is a song by Anita Brooks and Woody Harrelson... i won't give away the ending... just be warned... lots of jabs at the women of the 20's and 30's, lots of that sexy blonde chick... oh and with a full cast of young men...", "X": null, "Y": 1, "idx": 226}
{"C": "Whatever honor we ascribe to this movie's performance, it is apparent that no such credits are due to the Academy. The Cinema Screen didn't deserve such a letdown. Consider this: a fully untalented movie maker believed that he had ", "X": null, "Y": 1, "idx": 227}
{"C": "movie as bad as this one. Not even the lines of the words were memorable. The storyline is unbelievable. The plot is ridiculous. Some serious problems with the writing.", "X": null, "Y": 1, "idx": 228}
{"C": ". It was just what I happened to be sitting through. ", "X": null, "Y": 1, "idx": 229}
{"C": "s desire to feel normal and have a good time with his girlfriend and his boring, perfect life. and that is really a shame because someone would really enjoy a movie like that.", "X": null, "Y": 1, "idx": 230}
{"C": "stayed with me well past its 100 minutes, the scenery looks as if someone forgot to take it off the blow dryer. It was pathetic and unbelievably overlong. It is very very dark, though, so it's probably not for the faint hearted. It's depressing, but not in a good way. And the plot was weak and the characters were as bad as the film itself.", "X": null, "Y": 1, "idx": 231}
{"C": "segment – nearly all other websites of this week announcing the losers of the 1st FFL game are expressing more enthusiastic judgment than this. Honestly, you could say that we, as the defending league, failed miserably in our attempt to subdue those unfeeling midgets and keep alive their remnants for a walk in the park, as they have never seen anything like it.", "X": null, "Y": 1, "idx": 232}
{"C": "actors (even the three leads). The music was too loud. The story is too predictable. The characters were apathetic and unrealistic. The most irritating thing was that, for several reasons, The girls were not particularly likable (i.e. the girl-friend sort) Even though this movie was supposed to be part of a larger movie (a remake, apparently), the whole thing made it look like a cheap porn movie.", "X": null, "Y": 1, "idx": 233}
{"C": "'t know what could possibly bring this into a 5 rating. It's rubbish. The quality of the film is horrible and you would be better off watching 24 with a big mouth. I had a hooker in it as it was playing on Cinemax. I would like to see some changes and be glad it wasn't shot on film. The whole thing sounds quite nice but I wouldn't be able to get a decent film out of it.", "X": null, "Y": 1, "idx": 234}
{"C": "even cover it. how long will i spend here writing about how crap this film is? I'll wait until the DVD comes out, and only then will I be able to tell others how many times i've watched this crap. it will not be the last one i see. many will try to tell me that its a waste of my time. well if this is a waste of your time... then for whatever reason you should watch this.", "X": null, "Y": 1, "idx": 235}
{"C": "comment here he said he is not going to give the film a second look. i guess this is what he meant by the first comment. quite simply, there is no good character. the reason i say this is because as I write this i am, naturally, hoping for a better review than this. obviously, i'm not going to give the film a second look. but i do want to see if this trend continues..", "X": null, "Y": 1, "idx": 236}
{"C": "from this supposedly-independent filmmaker, but all I got was the usual pathetic faux-understatement about how stupid people will be and dumbed-down Internet comments from dumb ass producers. Uninteresting subject matter? Yes. Seriously. I do feel sorry for the street kids who have to shiver in the cold to get to the movie. The cold is a perpetual element of boredom for many of the plot holes and sequences drag on forever.", "X": null, "Y": 1, "idx": 237}
{"C": "some sort of full advantage over the normal viewers because the only ones to be fooled by this was the animation and music department.", "X": null, "Y": 1, "idx": 238}
{"C": "mouthed self-consciousness and frankly puts me off. Its undeniably entertaining but its laughs only come in the ", "X": null, "Y": 1, "idx": 239}
{"C": "utter disappointment for me. I found it to be tedious, hard to follow, and an insult to those who have a choice in what they watch. I have read the book and was shocked at the repetitive, ", "X": null, "Y": 1, "idx": 240}
{"C": "!...While Mr. B doesn't use stereotypical character building, in this movie he uses stereotypical bath house. The story is somewhat similar in different parts of town, but it's done more cleverly here with the family and some nameless cat burglars...all in all a pretty trashy little yarn. Two turds in the swimming pool don't count...", "X": null, "Y": 1, "idx": 241}
{"C": "to suspend your disbelief for 90 minutes. This piece of trash has lost its charm and, quite frankly, surpassed its original art. What was it?.", "X": null, "Y": 1, "idx": 242}
{"C": "have been done with a brilliant sensitivity of tone, clarity and commitment in the direction of Dan Berger (Tinker Tailor Soldier Spy, Grand Theft Auto, etc.). Too many of us who have read the novel, The Witching Hour and Throne of Blood, have found the characterisations extremely difficult to identify with.", "X": null, "Y": 1, "idx": 243}
{"C": "writer would have come up with a script that had some depth and resonance, and you wouldn't have been wrong. I personally think there are many better movies to be made.", "X": null, "Y": 1, "idx": 244}
{"C": "character study of sorts, an exercise in economic stagnation for the middle class of Florida, which is why his war stricken father is not a ", "X": null, "Y": 1, "idx": 245}
{"C": "characters, the animation is top-heavy and excessively thick with fake blood, and the ending makes the Xena series seem too good to be true.", "X": null, "Y": 1, "idx": 246}
{"C": "if done in 1995 - when it was a fairly original piece, with some decent set pieces, especially the elaborate island setting with the gardens, stone cliffs and secret passages for the US convoys.", "X": null, "Y": 1, "idx": 247}
{"C": "20 minutes; for a film that even into its next half hour was offered a taste of a slice of blood, a lot of low budget black and white plastic models and toadstools that would melt at a quarter to a dollar, this has to be a truly horrible film.", "X": null, "Y": 1, "idx": 248}
{"C": "predictable dialogue, shallow characters and an ultimately lame ending. Absurd. And tedious. I was watching the whole movie just to see what was going on with this woman ('I'm a fighter'). She's awesome, and who doesn't like sports movies? But after about 20 minutes I really started to get fed up.", "X": null, "Y": 1, "idx": 249}
{"C": "a horror film with so many good twists and turns it is just plain sad. I saw it in a movie screening and it was the funniest thing I had ever seen. I can't believe it has been made on tape. There is just no way to take a bad film and turn it into something good. They should have cut all of the bad endings. The writing is awful. Character development is weak. The acting is shockingly bad.", "X": null, "Y": 1, "idx": 250}
{"C": ", senselessness,, double meaning, cliches.., total crap. even no purposeful plot. Is it supposed to be thought provoking? are there any purposes to it? how come all the explanations of what they're going through are not done during the film,instead we are watching these annoying people 'fight', 'kill' and 'live'? a complete waste of time. Ms.", "X": null, "Y": 1, "idx": 251}
{"C": "was one of the standouts of the three cameos for me.", "X": null, "Y": 1, "idx": 252}
{"C": "interest in a genre, not just be a way to make a quick buck. ", "X": null, "Y": 1, "idx": 253}
